;******************************************************************************
;* TI ARM C/C++ Codegen                                             PC v5.2.5 *
;* Date/Time created: Sat Nov 07 12:29:29 2015                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --disable_dual_state --embedded_constants=on --endian=little --float_support=FPv4SPD16 --hll_source=on --object_format=elf --silicon_version=7M4 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.2.5 Copyright (c) 1996-2015 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("E:\Dev\Ti\Code\GIT\LaunchpadRoomControl\LaunchpadRoomControl\timers\Debug")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("get_fattime")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("get_fattime")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0xfd)
	.dwattr $C$DW$1, DW_AT_decl_column(0x07)


	.dwattr $C$DW$614, DW_AT_decl_column(0x02)
$C$DW$615	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_NO_PATH"), DW_AT_const_value(0x05)
	.dwattr $C$DW$615, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$615, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$615, DW_AT_decl_column(0x02)
$C$DW$616	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_INVALID_NAME"), DW_AT_const_value(0x06)
	.dwattr $C$DW$616, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$616, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$616, DW_AT_decl_column(0x02)
$C$DW$617	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_DENIED"), DW_AT_const_value(0x07)
	.dwattr $C$DW$617, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$617, DW_AT_decl_line(0xba)
	.dwattr $C$DW$617, DW_AT_decl_column(0x02)
$C$DW$618	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_EXIST"), DW_AT_const_value(0x08)
	.dwattr $C$DW$618, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$618, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$618, DW_AT_decl_column(0x02)
$C$DW$619	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_INVALID_OBJECT"), DW_AT_const_value(0x09)
	.dwattr $C$DW$619, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$619, DW_AT_decl_line(0xbc)
	.dwattr $C$DW$619, DW_AT_decl_column(0x02)
$C$DW$620	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_WRITE_PROTECTED"), DW_AT_const_value(0x0a)
	.dwattr $C$DW$620, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$620, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$620, DW_AT_decl_column(0x02)
$C$DW$621	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_INVALID_DRIVE"), DW_AT_const_value(0x0b)
	.dwattr $C$DW$621, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$621, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$621, DW_AT_decl_column(0x02)
$C$DW$622	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_NOT_ENABLED"), DW_AT_const_value(0x0c)
	.dwattr $C$DW$622, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$622, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$622, DW_AT_decl_column(0x02)
$C$DW$623	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_NO_FILESYSTEM"), DW_AT_const_value(0x0d)
	.dwattr $C$DW$623, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$623, DW_AT_decl_line(0xc0)
	.dwattr $C$DW$623, DW_AT_decl_column(0x02)
$C$DW$624	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_MKFS_ABORTED"), DW_AT_const_value(0x0e)
	.dwattr $C$DW$624, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$624, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$624, DW_AT_decl_column(0x02)
$C$DW$625	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_TIMEOUT"), DW_AT_const_value(0x0f)
	.dwattr $C$DW$625, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$625, DW_AT_decl_line(0xc2)
	.dwattr $C$DW$625, DW_AT_decl_column(0x02)
$C$DW$626	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_LOCKED"), DW_AT_const_value(0x10)
	.dwattr $C$DW$626, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$626, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$626, DW_AT_decl_column(0x02)
$C$DW$627	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_NOT_ENOUGH_CORE"), DW_AT_const_value(0x11)
	.dwattr $C$DW$627, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$627, DW_AT_decl_line(0xc4)
	.dwattr $C$DW$627, DW_AT_decl_column(0x02)
$C$DW$628	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_TOO_MANY_OPEN_FILES"), DW_AT_const_value(0x12)
	.dwattr $C$DW$628, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$628, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$628, DW_AT_decl_column(0x02)
$C$DW$629	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_INVALID_PARAMETER"), DW_AT_const_value(0x13)
	.dwattr $C$DW$629, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$629, DW_AT_decl_line(0xc6)
	.dwattr $C$DW$629, DW_AT_decl_column(0x02)
	.dwendtag $C$DW$T$43

	.dwattr $C$DW$T$43, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$T$43, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$T$43, DW_AT_decl_column(0x0e)
$C$DW$T$44	.dwtag  DW_TAG_typedef, DW_AT_name("FRESULT")
	.dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$44, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$T$44, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$T$44, DW_AT_decl_column(0x03)

$C$DW$T$98	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$98, DW_AT_byte_size(0x01)
$C$DW$630	.dwtag  DW_TAG_enumerator, DW_AT_name("FALSE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$630, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
	.dwattr $C$DW$630, DW_AT_decl_line(0x24)
	.dwattr $C$DW$630, DW_AT_decl_column(0x10)
$C$DW$631	.dwtag  DW_TAG_enumerator, DW_AT_name("TRUE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$631, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
	.dwattr $C$DW$631, DW_AT_decl_line(0x24)
	.dwattr $C$DW$631, DW_AT_decl_column(0x1b)
	.dwendtag $C$DW$T$98

	.dwattr $C$DW$T$98, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
	.dwattr $C$DW$T$98, DW_AT_decl_line(0x24)
	.dwattr $C$DW$T$98, DW_AT_decl_column(0x0e)
$C$DW$T$99	.dwtag  DW_TAG_typedef, DW_AT_name("BOOL")
	.dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
	.dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$99, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
	.dwattr $C$DW$T$99, DW_AT_decl_line(0x24)
	.dwattr $C$DW$T$99, DW_AT_decl_column(0x22)

$C$DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x234)
$C$DW$632	.dwtag  DW_TAG_member
	.dwattr $C$DW$632, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$632, DW_AT_name("fs_type")
	.dwattr $C$DW$632, DW_AT_TI_symbol_name("fs_type")
	.dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$632, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$632, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$632, DW_AT_decl_column(0x07)
$C$DW$633	.dwtag  DW_TAG_member
	.dwattr $C$DW$633, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$633, DW_AT_name("drv")
	.dwattr $C$DW$633, DW_AT_TI_symbol_name("drv")
	.dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$633, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$633, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$633, DW_AT_decl_column(0x07)
$C$DW$634	.dwtag  DW_TAG_member
	.dwattr $C$DW$634, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$634, DW_AT_name("csize")
	.dwattr $C$DW$634, DW_AT_TI_symbol_name("csize")
	.dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$634, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$634, DW_AT_decl_line(0x50)
	.dwattr $C$DW$634, DW_AT_decl_column(0x07)
$C$DW$635	.dwtag  DW_TAG_member
	.dwattr $C$DW$635, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$635, DW_AT_name("n_fats")
	.dwattr $C$DW$635, DW_AT_TI_symbol_name("n_fats")
	.dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$635, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$635, DW_AT_decl_line(0x51)
	.dwattr $C$DW$635, DW_AT_decl_column(0x07)
$C$DW$636	.dwtag  DW_TAG_member
	.dwattr $C$DW$636, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$636, DW_AT_name("wflag")
	.dwattr $C$DW$636, DW_AT_TI_symbol_name("wflag")
	.dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$636, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$636, DW_AT_decl_line(0x52)
	.dwattr $C$DW$636, DW_AT_decl_column(0x07)
$C$DW$637	.dwtag  DW_TAG_member
	.dwattr $C$DW$637, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$637, DW_AT_name("fsi_flag")
	.dwattr $C$DW$637, DW_AT_TI_symbol_name("fsi_flag")
	.dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$637, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$637, DW_AT_decl_line(0x53)
	.dwattr $C$DW$637, DW_AT_decl_column(0x07)
$C$DW$638	.dwtag  DW_TAG_member
	.dwattr $C$DW$638, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$638, DW_AT_name("id")
	.dwattr $C$DW$638, DW_AT_TI_symbol_name("id")
	.dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$638, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$638, DW_AT_decl_line(0x54)
	.dwattr $C$DW$638, DW_AT_decl_column(0x07)
$C$DW$639	.dwtag  DW_TAG_member
	.dwattr $C$DW$639, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$639, DW_AT_name("n_rootdir")
	.dwattr $C$DW$639, DW_AT_TI_symbol_name("n_rootdir")
	.dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$639, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$639, DW_AT_decl_line(0x55)
	.dwattr $C$DW$639, DW_AT_decl_column(0x07)
$C$DW$640	.dwtag  DW_TAG_member
	.dwattr $C$DW$640, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$640, DW_AT_name("last_clust")
	.dwattr $C$DW$640, DW_AT_TI_symbol_name("last_clust")
	.dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$640, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$640, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$640, DW_AT_decl_column(0x08)
$C$DW$641	.dwtag  DW_TAG_member
	.dwattr $C$DW$641, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$641, DW_AT_name("free_clust")
	.dwattr $C$DW$641, DW_AT_TI_symbol_name("free_clust")
	.dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$641, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$641, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$641, DW_AT_decl_column(0x08)
$C$DW$642	.dwtag  DW_TAG_member
	.dwattr $C$DW$642, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$642, DW_AT_name("fsi_sector")
	.dwattr $C$DW$642, DW_AT_TI_symbol_name("fsi_sector")
	.dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$642, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$642, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$642, DW_AT_decl_column(0x08)
$C$DW$643	.dwtag  DW_TAG_member
	.dwattr $C$DW$643, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$643, DW_AT_name("n_fatent")
	.dwattr $C$DW$643, DW_AT_TI_symbol_name("n_fatent")
	.dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$643, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$643, DW_AT_decl_line(0x64)
	.dwattr $C$DW$643, DW_AT_decl_column(0x08)
$C$DW$644	.dwtag  DW_TAG_member
	.dwattr $C$DW$644, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$644, DW_AT_name("fsize")
	.dwattr $C$DW$644, DW_AT_TI_symbol_name("fsize")
	.dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$644, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$644, DW_AT_decl_line(0x65)
	.dwattr $C$DW$644, DW_AT_decl_column(0x08)
$C$DW$645	.dwtag  DW_TAG_member
	.dwattr $C$DW$645, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$645, DW_AT_name("volbase")
	.dwattr $C$DW$645, DW_AT_TI_symbol_name("volbase")
	.dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$645, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$645, DW_AT_decl_line(0x66)
	.dwattr $C$DW$645, DW_AT_decl_column(0x08)
$C$DW$646	.dwtag  DW_TAG_member
	.dwattr $C$DW$646, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$646, DW_AT_name("fatbase")
	.dwattr $C$DW$646, DW_AT_TI_symbol_name("fatbase")
	.dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$646, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$646, DW_AT_decl_line(0x67)
	.dwattr $C$DW$646, DW_AT_decl_column(0x08)
$C$DW$647	.dwtag  DW_TAG_member
	.dwattr $C$DW$647, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$647, DW_AT_name("dirbase")
	.dwattr $C$DW$647, DW_AT_TI_symbol_name("dirbase")
	.dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$647, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$647, DW_AT_decl_line(0x68)
	.dwattr $C$DW$647, DW_AT_decl_column(0x08)
$C$DW$648	.dwtag  DW_TAG_member
	.dwattr $C$DW$648, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$648, DW_AT_name("database")
	.dwattr $C$DW$648, DW_AT_TI_symbol_name("database")
	.dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$648, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$648, DW_AT_decl_line(0x69)
	.dwattr $C$DW$648, DW_AT_decl_column(0x08)
$C$DW$649	.dwtag  DW_TAG_member
	.dwattr $C$DW$649, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$649, DW_AT_name("winsect")
	.dwattr $C$DW$649, DW_AT_TI_symbol_name("winsect")
	.dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$649, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$649, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$649, DW_AT_decl_column(0x08)
$C$DW$650	.dwtag  DW_TAG_member
	.dwattr $C$DW$650, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$650, DW_AT_name("win")
	.dwattr $C$DW$650, DW_AT_TI_symbol_name("win")
	.dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$650, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$650, DW_AT_decl_line(0x6b)
	.dwattr $C$DW$650, DW_AT_decl_column(0x07)
	.dwendtag $C$DW$T$23

	.dwattr $C$DW$T$23, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$T$23, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
$C$DW$T$24	.dwtag  DW_TAG_typedef, DW_AT_name("FATFS")
	.dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$24, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$T$24, DW_AT_decl_line(0x6c)
	.dwattr $C$DW$T$24, DW_AT_decl_column(0x03)
$C$DW$T$25	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$25, DW_AT_address_class(0x20)
$C$DW$T$69	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$69, DW_AT_address_class(0x20)

$C$DW$T$100	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$100, DW_AT_byte_size(0x04)
$C$DW$651	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$651, DW_AT_upper_bound(0x00)
	.dwendtag $C$DW$T$100


$C$DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x1c)
$C$DW$652	.dwtag  DW_TAG_member
	.dwattr $C$DW$652, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$652, DW_AT_name("fs")
	.dwattr $C$DW$652, DW_AT_TI_symbol_name("fs")
	.dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$652, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$652, DW_AT_decl_line(0x90)
	.dwattr $C$DW$652, DW_AT_decl_column(0x09)
$C$DW$653	.dwtag  DW_TAG_member
	.dwattr $C$DW$653, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$653, DW_AT_name("id")
	.dwattr $C$DW$653, DW_AT_TI_symbol_name("id")
	.dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$653, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$653, DW_AT_decl_line(0x91)
	.dwattr $C$DW$653, DW_AT_decl_column(0x07)
$C$DW$654	.dwtag  DW_TAG_member
	.dwattr $C$DW$654, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$654, DW_AT_name("index")
	.dwattr $C$DW$654, DW_AT_TI_symbol_name("index")
	.dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$654, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$654, DW_AT_decl_line(0x92)
	.dwattr $C$DW$654, DW_AT_decl_column(0x07)
$C$DW$655	.dwtag  DW_TAG_member
	.dwattr $C$DW$655, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$655, DW_AT_name("sclust")
	.dwattr $C$DW$655, DW_AT_TI_symbol_name("sclust")
	.dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$655, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$655, DW_AT_decl_line(0x93)
	.dwattr $C$DW$655, DW_AT_decl_column(0x08)
$C$DW$656	.dwtag  DW_TAG_member
	.dwattr $C$DW$656, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$656, DW_AT_name("clust")
	.dwattr $C$DW$656, DW_AT_TI_symbol_name("clust")
	.dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$656, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$656, DW_AT_decl_line(0x94)
	.dwattr $C$DW$656, DW_AT_decl_column(0x08)
$C$DW$657	.dwtag  DW_TAG_member
	.dwattr $C$DW$657, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$657, DW_AT_name("sect")
	.dwattr $C$DW$657, DW_AT_TI_symbol_name("sect")
	.dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$657, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$657, DW_AT_decl_line(0x95)
	.dwattr $C$DW$657, DW_AT_decl_column(0x08)
$C$DW$658	.dwtag  DW_TAG_member
	.dwattr $C$DW$658, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$658, DW_AT_name("dir")
	.dwattr $C$DW$658, DW_AT_TI_symbol_name("dir")
	.dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$658, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$658, DW_AT_decl_line(0x96)
	.dwattr $C$DW$658, DW_AT_decl_column(0x08)
$C$DW$659	.dwtag  DW_TAG_member
	.dwattr $C$DW$659, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$659, DW_AT_name("fn")
	.dwattr $C$DW$659, DW_AT_TI_symbol_name("fn")
	.dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$659, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$659, DW_AT_decl_line(0x97)
	.dwattr $C$DW$659, DW_AT_decl_column(0x08)
	.dwendtag $C$DW$T$27

	.dwattr $C$DW$T$27, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$T$27, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
$C$DW$T$51	.dwtag  DW_TAG_typedef, DW_AT_name("DIR")
	.dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$51, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$T$51, DW_AT_decl_line(0x9c)
	.dwattr $C$DW$T$51, DW_AT_decl_column(0x03)
$C$DW$T$52	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$T$52, DW_AT_address_class(0x20)

$C$DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x18)
$C$DW$660	.dwtag  DW_TAG_member
	.dwattr $C$DW$660, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$660, DW_AT_name("fsize")
	.dwattr $C$DW$660, DW_AT_TI_symbol_name("fsize")
	.dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$660, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$660, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$660, DW_AT_decl_column(0x08)
$C$DW$661	.dwtag  DW_TAG_member
	.dwattr $C$DW$661, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$661, DW_AT_name("fdate")
	.dwattr $C$DW$661, DW_AT_TI_symbol_name("fdate")
	.dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$661, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$661, DW_AT_decl_line(0xa4)
	.dwattr $C$DW$661, DW_AT_decl_column(0x07)
$C$DW$662	.dwtag  DW_TAG_member
	.dwattr $C$DW$662, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$662, DW_AT_name("ftime")
	.dwattr $C$DW$662, DW_AT_TI_symbol_name("ftime")
	.dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$662, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$662, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$662, DW_AT_decl_column(0x07)
$C$DW$663	.dwtag  DW_TAG_member
	.dwattr $C$DW$663, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$663, DW_AT_name("fattrib")
	.dwattr $C$DW$663, DW_AT_TI_symbol_name("fattrib")
	.dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$663, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$663, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$663, DW_AT_decl_column(0x07)
$C$DW$664	.dwtag  DW_TAG_member
	.dwattr $C$DW$664, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$664, DW_AT_name("fname")
	.dwattr $C$DW$664, DW_AT_TI_symbol_name("fname")
	.dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$664, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$664, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$664, DW_AT_decl_column(0x08)
	.dwendtag $C$DW$T$31

	.dwattr $C$DW$T$31, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$T$31, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
$C$DW$T$86	.dwtag  DW_TAG_typedef, DW_AT_name("FILINFO")
	.dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$86, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$T$86, DW_AT_decl_line(0xac)
	.dwattr $C$DW$T$86, DW_AT_decl_column(0x03)
$C$DW$T$94	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$86)
$C$DW$T$95	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$T$95, DW_AT_address_class(0x20)
$C$DW$T$87	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$T$87, DW_AT_address_class(0x20)

$C$DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x224)
$C$DW$665	.dwtag  DW_TAG_member
	.dwattr $C$DW$665, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$665, DW_AT_name("fs")
	.dwattr $C$DW$665, DW_AT_TI_symbol_name("fs")
	.dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$665, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$665, DW_AT_decl_line(0x73)
	.dwattr $C$DW$665, DW_AT_decl_column(0x09)
$C$DW$666	.dwtag  DW_TAG_member
	.dwattr $C$DW$666, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$666, DW_AT_name("id")
	.dwattr $C$DW$666, DW_AT_TI_symbol_name("id")
	.dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$666, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$666, DW_AT_decl_line(0x74)
	.dwattr $C$DW$666, DW_AT_decl_column(0x07)
$C$DW$667	.dwtag  DW_TAG_member
	.dwattr $C$DW$667, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$667, DW_AT_name("flag")
	.dwattr $C$DW$667, DW_AT_TI_symbol_name("flag")
	.dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$667, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$667, DW_AT_decl_line(0x75)
	.dwattr $C$DW$667, DW_AT_decl_column(0x07)
$C$DW$668	.dwtag  DW_TAG_member
	.dwattr $C$DW$668, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$668, DW_AT_name("pad1")
	.dwattr $C$DW$668, DW_AT_TI_symbol_name("pad1")
	.dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$668, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$668, DW_AT_decl_line(0x76)
	.dwattr $C$DW$668, DW_AT_decl_column(0x07)
$C$DW$669	.dwtag  DW_TAG_member
	.dwattr $C$DW$669, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$669, DW_AT_name("fptr")
	.dwattr $C$DW$669, DW_AT_TI_symbol_name("fptr")
	.dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$669, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$669, DW_AT_decl_line(0x77)
	.dwattr $C$DW$669, DW_AT_decl_column(0x08)
$C$DW$670	.dwtag  DW_TAG_member
	.dwattr $C$DW$670, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$670, DW_AT_name("fsize")
	.dwattr $C$DW$670, DW_AT_TI_symbol_name("fsize")
	.dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$670, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$670, DW_AT_decl_line(0x78)
	.dwattr $C$DW$670, DW_AT_decl_column(0x08)
$C$DW$671	.dwtag  DW_TAG_member
	.dwattr $C$DW$671, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$671, DW_AT_name("sclust")
	.dwattr $C$DW$671, DW_AT_TI_symbol_name("sclust")
	.dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$671, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$671, DW_AT_decl_line(0x79)
	.dwattr $C$DW$671, DW_AT_decl_column(0x08)
$C$DW$672	.dwtag  DW_TAG_member
	.dwattr $C$DW$672, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$672, DW_AT_name("clust")
	.dwattr $C$DW$672, DW_AT_TI_symbol_name("clust")
	.dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$672, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$672, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$672, DW_AT_decl_column(0x08)
$C$DW$673	.dwtag  DW_TAG_member
	.dwattr $C$DW$673, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$673, DW_AT_name("dsect")
	.dwattr $C$DW$673, DW_AT_TI_symbol_name("dsect")
	.dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$673, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$673, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$673, DW_AT_decl_column(0x08)
$C$DW$674	.dwtag  DW_TAG_member
	.dwattr $C$DW$674, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$674, DW_AT_name("dir_sect")
	.dwattr $C$DW$674, DW_AT_TI_symbol_name("dir_sect")
	.dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$674, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$674, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$674, DW_AT_decl_column(0x08)
$C$DW$675	.dwtag  DW_TAG_member
	.dwattr $C$DW$675, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$675, DW_AT_name("dir_ptr")
	.dwattr $C$DW$675, DW_AT_TI_symbol_name("dir_ptr")
	.dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$675, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$675, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$675, DW_AT_decl_column(0x08)
$C$DW$676	.dwtag  DW_TAG_member
	.dwattr $C$DW$676, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$676, DW_AT_name("buf")
	.dwattr $C$DW$676, DW_AT_TI_symbol_name("buf")
	.dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$676, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$676, DW_AT_decl_line(0x87)
	.dwattr $C$DW$676, DW_AT_decl_column(0x07)
	.dwendtag $C$DW$T$32

	.dwattr $C$DW$T$32, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0x72)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
$C$DW$T$75	.dwtag  DW_TAG_typedef, DW_AT_name("FIL")
	.dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$75, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\ff.h")
	.dwattr $C$DW$T$75, DW_AT_decl_line(0x89)
	.dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
$C$DW$T$76	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$T$76, DW_AT_address_class(0x20)
$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")
$C$DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
	.dwattr $C$DW$T$3, DW_AT_address_class(0x20)
$C$DW$T$80	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$2)
$C$DW$T$81	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$T$81, DW_AT_address_class(0x20)
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
$C$DW$T$19	.dwtag  DW_TAG_typedef, DW_AT_name("BYTE")
	.dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$19, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0x16)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x17)
$C$DW$T$37	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$19)
$C$DW$T$38	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$T$38, DW_AT_address_class(0x20)
$C$DW$T$109	.dwtag  DW_TAG_typedef, DW_AT_name("DSTATUS")
	.dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$109, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\diskio.h")
	.dwattr $C$DW$T$109, DW_AT_decl_line(0x13)
	.dwattr $C$DW$T$109, DW_AT_decl_column(0x0e)

$C$DW$T$22	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x200)
$C$DW$677	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$677, DW_AT_upper_bound(0x1ff)
	.dwendtag $C$DW$T$22

$C$DW$T$26	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$26, DW_AT_address_class(0x20)

$C$DW$T$114	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$114, DW_AT_byte_size(0x0c)
$C$DW$678	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$678, DW_AT_upper_bound(0x0b)
	.dwendtag $C$DW$T$114


$C$DW$T$115	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$115, DW_AT_byte_size(0x15)
$C$DW$679	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$679, DW_AT_upper_bound(0x14)
	.dwendtag $C$DW$T$115

$C$DW$T$116	.dwtag  DW_TAG_typedef, DW_AT_name("UCHAR")
	.dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$116, DW_AT_language(DW_LANG_C)
