TI ARM Assembler PC v5.2.5 Wed Oct 21 13:38:44 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                             PC v5.2.5 *
       3                    ;* Date/Time created: Wed Oct 21 13:38:44 2015                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --disab
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../timers.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.2.5 Copyright (c) 1996-2015 Te
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("E:\Dev\Ti\Code\GIT\LaunchpadRoomControl\LaunchpadRoomControl
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("GPIOPinWrite")

    2029                    $C$DW$140       .dwtag  DW_TAG_enumerator, DW_AT_name("FR_NOT_ENOUGH_CORE"), DW_AT_const_value(0x11)
    2030                            .dwattr $C$DW$140, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2031                            .dwattr $C$DW$140, DW_AT_decl_line(0xc4)
    2032                            .dwattr $C$DW$140, DW_AT_decl_column(0x02)
    2033                    $C$DW$141       .dwtag  DW_TAG_enumerator, DW_AT_name("FR_TOO_MANY_OPEN_FILES"), DW_AT_const_value(0x1
    2034                            .dwattr $C$DW$141, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2035                            .dwattr $C$DW$141, DW_AT_decl_line(0xc5)
    2036                            .dwattr $C$DW$141, DW_AT_decl_column(0x02)
    2037                    $C$DW$142       .dwtag  DW_TAG_enumerator, DW_AT_name("FR_INVALID_PARAMETER"), DW_AT_const_value(0x13)
    2038                            .dwattr $C$DW$142, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2039                            .dwattr $C$DW$142, DW_AT_decl_line(0xc6)
    2040                            .dwattr $C$DW$142, DW_AT_decl_column(0x02)
    2041                            .dwendtag $C$DW$T$40
    2042                    
    2043                            .dwattr $C$DW$T$40, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2044                            .dwattr $C$DW$T$40, DW_AT_decl_line(0xb2)
    2045                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x0e)
    2046                    $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("FRESULT")
    2047                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    2048                            .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    2049                            .dwattr $C$DW$T$41, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2050                            .dwattr $C$DW$T$41, DW_AT_decl_line(0xc7)
    2051                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x03)
    2052                    
    2053                    $C$DW$T$42      .dwtag  DW_TAG_enumeration_type
    2054                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    2055                    $C$DW$143       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_OK"), DW_AT_const_value(0x00)
    2056                            .dwattr $C$DW$143, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2057                            .dwattr $C$DW$143, DW_AT_decl_line(0x17)
    2058                            .dwattr $C$DW$143, DW_AT_decl_column(0x02)
    2059                    $C$DW$144       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_ERROR"), DW_AT_const_value(0x01)
    2060                            .dwattr $C$DW$144, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2061                            .dwattr $C$DW$144, DW_AT_decl_line(0x18)
    2062                            .dwattr $C$DW$144, DW_AT_decl_column(0x02)
    2063                    $C$DW$145       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_WRPRT"), DW_AT_const_value(0x02)
    2064                            .dwattr $C$DW$145, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2065                            .dwattr $C$DW$145, DW_AT_decl_line(0x19)
    2066                            .dwattr $C$DW$145, DW_AT_decl_column(0x02)
TI ARM Assembler PC v5.2.5 Wed Oct 21 13:38:44 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   39

    2067                    $C$DW$146       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_NOTRDY"), DW_AT_const_value(0x03)
    2068                            .dwattr $C$DW$146, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2069                            .dwattr $C$DW$146, DW_AT_decl_line(0x1a)
    2070                            .dwattr $C$DW$146, DW_AT_decl_column(0x02)
    2071                    $C$DW$147       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_PARERR"), DW_AT_const_value(0x04)
    2072                            .dwattr $C$DW$147, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2073                            .dwattr $C$DW$147, DW_AT_decl_line(0x1b)
    2074                            .dwattr $C$DW$147, DW_AT_decl_column(0x02)
    2075                            .dwendtag $C$DW$T$42
    2076                    
    2077                            .dwattr $C$DW$T$42, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2078                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x16)
    2079                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x0e)
    2080                    $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("DRESULT")
    2081                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    2082                            .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    2083                            .dwattr $C$DW$T$43, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2084                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x1c)
    2085                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x03)
    2086                    
    2087                    $C$DW$T$19      .dwtag  DW_TAG_structure_type
    2088                            .dwattr $C$DW$T$19, DW_AT_byte_size(0x48)
    2089                    $C$DW$148       .dwtag  DW_TAG_member
    2090                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$10)
    2091                            .dwattr $C$DW$148, DW_AT_name("_Ddig")
    2092                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("_Ddig")
    2093                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2094                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2095                            .dwattr $C$DW$148, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2096                            .dwattr $C$DW$148, DW_AT_decl_line(0x37)
    2097                            .dwattr $C$DW$148, DW_AT_decl_column(0x06)
    2098                    $C$DW$149       .dwtag  DW_TAG_member
    2099                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$10)
    2100                            .dwattr $C$DW$149, DW_AT_name("_Dmdig")
    2101                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("_Dmdig")
    2102                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2103                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2104                            .dwattr $C$DW$149, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2105                            .dwattr $C$DW$149, DW_AT_decl_line(0x37)
    2106                            .dwattr $C$DW$149, DW_AT_decl_column(0x0d)
    2107                    $C$DW$150       .dwtag  DW_TAG_member
    2108                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$10)
    2109                            .dwattr $C$DW$150, DW_AT_name("_Dmax10e")
    2110                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("_Dmax10e")
    2111                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2112                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2113                            .dwattr $C$DW$150, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2114                            .dwattr $C$DW$150, DW_AT_decl_line(0x37)
    2115                            .dwattr $C$DW$150, DW_AT_decl_column(0x15)
    2116                    $C$DW$151       .dwtag  DW_TAG_member
    2117                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$10)
    2118                            .dwattr $C$DW$151, DW_AT_name("_Dmaxe")
    2119                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("_Dmaxe")
    2120                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2121                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v5.2.5 Wed Oct 21 13:38:44 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   40

    2122                            .dwattr $C$DW$151, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2123                            .dwattr $C$DW$151, DW_AT_decl_line(0x37)
    2124                            .dwattr $C$DW$151, DW_AT_decl_column(0x1f)
    2125                    $C$DW$152       .dwtag  DW_TAG_member
    2126                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$10)
    2127                            .dwattr $C$DW$152, DW_AT_name("_Dmin10e")
    2128                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("_Dmin10e")
    2129                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2130                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2131                            .dwattr $C$DW$152, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2132                            .dwattr $C$DW$152, DW_AT_decl_line(0x37)
    2133                            .dwattr $C$DW$152, DW_AT_decl_column(0x27)
    2134                    $C$DW$153       .dwtag  DW_TAG_member
    2135                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$10)
    2136                            .dwattr $C$DW$153, DW_AT_name("_Dmine")
    2137                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("_Dmine")
    2138                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2139                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2140                            .dwattr $C$DW$153, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2141                            .dwattr $C$DW$153, DW_AT_decl_line(0x37)
    2142                            .dwattr $C$DW$153, DW_AT_decl_column(0x31)
    2143                    $C$DW$154       .dwtag  DW_TAG_member
    2144                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$35)
    2145                            .dwattr $C$DW$154, DW_AT_name("_Deps")
    2146                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("_Deps")
    2147                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2148                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2149                            .dwattr $C$DW$154, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2150                            .dwattr $C$DW$154, DW_AT_decl_line(0x3e)
    2151                            .dwattr $C$DW$154, DW_AT_decl_column(0x05)
    2152                    $C$DW$155       .dwtag  DW_TAG_member
    2153                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$35)
    2154                            .dwattr $C$DW$155, DW_AT_name("_Dmax")
    2155                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("_Dmax")
    2156                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2157                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2158                            .dwattr $C$DW$155, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2159                            .dwattr $C$DW$155, DW_AT_decl_line(0x3e)
    2160                            .dwattr $C$DW$155, DW_AT_decl_column(0x0c)
    2161                    $C$DW$156       .dwtag  DW_TAG_member
    2162                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$35)
    2163                            .dwattr $C$DW$156, DW_AT_name("_Dmin")
    2164                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("_Dmin")
    2165                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2166                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2167                            .dwattr $C$DW$156, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2168                            .dwattr $C$DW$156, DW_AT_decl_line(0x3e)
    2169                            .dwattr $C$DW$156, DW_AT_decl_column(0x13)
    2170                            .dwendtag $C$DW$T$19
    2171                    
    2172                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float
    2173                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x36)
    2174                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x02)
    2175                    $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("_Dvals")
    2176                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$19)
TI ARM Assembler PC v5.2.5 Wed Oct 21 13:38:44 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   41

    2177                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    2178                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float
    2179                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x3f)
    2180                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x04)
    2181                    
    2182                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2183                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x234)
    2184                    $C$DW$157       .dwtag  DW_TAG_member
    2185                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$20)
    2186                            .dwattr $C$DW$157, DW_AT_name("fs_type")
    2187                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("fs_type")
    2188                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2189                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2190                            .dwattr $C$DW$157, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2191                            .dwattr $C$DW$157, DW_AT_decl_line(0x4e)
    2192                            .dwattr $C$DW$157, DW_AT_decl_column(0x07)
    2193                    $C$DW$158       .dwtag  DW_TAG_member
    2194                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$20)
    2195                            .dwattr $C$DW$158, DW_AT_name("drv")
    2196                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("drv")
    2197                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2198                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2199                            .dwattr $C$DW$158, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2200                            .dwattr $C$DW$158, DW_AT_decl_line(0x4f)
    2201                            .dwattr $C$DW$158, DW_AT_decl_column(0x07)
    2202                    $C$DW$159       .dwtag  DW_TAG_member
    2203                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$20)
    2204                            .dwattr $C$DW$159, DW_AT_name("csize")
    2205                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("csize")
    2206                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2207                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2208                            .dwattr $C$DW$159, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2209                            .dwattr $C$DW$159, DW_AT_decl_line(0x50)
    2210                            .dwattr $C$DW$159, DW_AT_decl_column(0x07)
    2211                    $C$DW$160       .dwtag  DW_TAG_member
    2212                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$20)
    2213                            .dwattr $C$DW$160, DW_AT_name("n_fats")
    2214                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("n_fats")
    2215                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2216                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2217                            .dwattr $C$DW$160, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2218                            .dwattr $C$DW$160, DW_AT_decl_line(0x51)
    2219                            .dwattr $C$DW$160, DW_AT_decl_column(0x07)
    2220                    $C$DW$161       .dwtag  DW_TAG_member
    2221                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$20)
    2222                            .dwattr $C$DW$161, DW_AT_name("wflag")
    2223                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("wflag")
    2224                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2225                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2226                            .dwattr $C$DW$161, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2227                            .dwattr $C$DW$161, DW_AT_decl_line(0x52)
    2228                            .dwattr $C$DW$161, DW_AT_decl_column(0x07)
    2229                    $C$DW$162       .dwtag  DW_TAG_member
    2230                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    2231                            .dwattr $C$DW$162, DW_AT_name("fsi_flag")
TI ARM Assembler PC v5.2.5 Wed Oct 21 13:38:44 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   42

    2232                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("fsi_flag")
    2233                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2234                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2235                            .dwattr $C$DW$162, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2236                            .dwattr $C$DW$162, DW_AT_decl_line(0x53)
    2237                            .dwattr $C$DW$162, DW_AT_decl_column(0x07)
    2238                    $C$DW$163       .dwtag  DW_TAG_member
    2239                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$21)
    2240                            .dwattr $C$DW$163, DW_AT_name("id")
    2241                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("id")
    2242                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2243                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2244                            .dwattr $C$DW$163, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2245                            .dwattr $C$DW$163, DW_AT_decl_line(0x54)
    2246                            .dwattr $C$DW$163, DW_AT_decl_column(0x07)
    2247                    $C$DW$164       .dwtag  DW_TAG_member
    2248                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$21)
    2249                            .dwattr $C$DW$164, DW_AT_name("n_rootdir")
    2250                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("n_rootdir")
    2251                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2252                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2253                            .dwattr $C$DW$164, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2254                            .dwattr $C$DW$164, DW_AT_decl_line(0x55)
    2255                            .dwattr $C$DW$164, DW_AT_decl_column(0x07)
    2256                    $C$DW$165       .dwtag  DW_TAG_member
    2257                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$22)
    2258                            .dwattr $C$DW$165, DW_AT_name("last_clust")
    2259                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("last_clust")
    2260                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2261                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2262                            .dwattr $C$DW$165, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2263                            .dwattr $C$DW$165, DW_AT_decl_line(0x5d)
    2264                            .dwattr $C$DW$165, DW_AT_decl_column(0x08)
    2265                    $C$DW$166       .dwtag  DW_TAG_member
    2266                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$22)
    2267                            .dwattr $C$DW$166, DW_AT_name("free_clust")
    2268                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("free_clust")
    2269                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2270                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2271                            .dwattr $C$DW$166, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2272                            .dwattr $C$DW$166, DW_AT_decl_line(0x5e)
    2273                            .dwattr $C$DW$166, DW_AT_decl_column(0x08)
    2274                    $C$DW$167       .dwtag  DW_TAG_member
    2275                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$22)
    2276                            .dwattr $C$DW$167, DW_AT_name("fsi_sector")
    2277                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("fsi_sector")
    2278                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2279                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2280                            .dwattr $C$DW$167, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2281                            .dwattr $C$DW$167, DW_AT_decl_line(0x5f)
    2282                            .dwattr $C$DW$167, DW_AT_decl_column(0x08)
    2283                    $C$DW$168       .dwtag  DW_TAG_member
    2284                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$22)
    2285                            .dwattr $C$DW$168, DW_AT_name("n_fatent")
    2286                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("n_fatent")
TI ARM Assembler PC v5.2.5 Wed Oct 21 13:38:44 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   43

    2287                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2288                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2289                            .dwattr $C$DW$168, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2290                            .dwattr $C$DW$168, DW_AT_decl_line(0x64)
    2291                            .dwattr $C$DW$168, DW_AT_decl_column(0x08)
    2292                    $C$DW$169       .dwtag  DW_TAG_member
    2293                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$22)
    2294                            .dwattr $C$DW$169, DW_AT_name("fsize")
    2295                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("fsize")
    2296                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2297                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2298                            .dwattr $C$DW$169, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2299                            .dwattr $C$DW$169, DW_AT_decl_line(0x65)
    2300                            .dwattr $C$DW$169, DW_AT_decl_column(0x08)
    2301                    $C$DW$170       .dwtag  DW_TAG_member
    2302                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$22)
    2303                            .dwattr $C$DW$170, DW_AT_name("volbase")
    2304                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("volbase")
    2305                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2306                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2307                            .dwattr $C$DW$170, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2308                            .dwattr $C$DW$170, DW_AT_decl_line(0x66)
    2309                            .dwattr $C$DW$170, DW_AT_decl_column(0x08)
    2310                    $C$DW$171       .dwtag  DW_TAG_member
    2311                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$22)
    2312                            .dwattr $C$DW$171, DW_AT_name("fatbase")
    2313                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("fatbase")
    2314                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2315                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2316                            .dwattr $C$DW$171, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2317                            .dwattr $C$DW$171, DW_AT_decl_line(0x67)
    2318                            .dwattr $C$DW$171, DW_AT_decl_column(0x08)
    2319                    $C$DW$172       .dwtag  DW_TAG_member
    2320                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$22)
    2321                            .dwattr $C$DW$172, DW_AT_name("dirbase")
    2322                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("dirbase")
    2323                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2324                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2325                            .dwattr $C$DW$172, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2326                            .dwattr $C$DW$172, DW_AT_decl_line(0x68)
    2327                            .dwattr $C$DW$172, DW_AT_decl_column(0x08)
    2328                    $C$DW$173       .dwtag  DW_TAG_member
    2329                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$22)
    2330                            .dwattr $C$DW$173, DW_AT_name("database")
    2331                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("database")
    2332                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2333                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2334                            .dwattr $C$DW$173, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2335                            .dwattr $C$DW$173, DW_AT_decl_line(0x69)
    2336                            .dwattr $C$DW$173, DW_AT_decl_column(0x08)
    2337                    $C$DW$174       .dwtag  DW_TAG_member
    2338                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$22)
    2339                            .dwattr $C$DW$174, DW_AT_name("winsect")
    2340                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("winsect")
    2341                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
TI ARM Assembler PC v5.2.5 Wed Oct 21 13:38:44 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   44

    2342                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2343                            .dwattr $C$DW$174, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2344                            .dwattr $C$DW$174, DW_AT_decl_line(0x6a)
    2345                            .dwattr $C$DW$174, DW_AT_decl_column(0x08)
    2346                    $C$DW$175       .dwtag  DW_TAG_member
    2347                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$23)
    2348                            .dwattr $C$DW$175, DW_AT_name("win")
    2349                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("win")
    2350                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2351                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2352                            .dwattr $C$DW$175, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2353                            .dwattr $C$DW$175, DW_AT_decl_line(0x6b)
    2354                            .dwattr $C$DW$175, DW_AT_decl_column(0x07)
    2355                            .dwendtag $C$DW$T$24
    2356                    
    2357                            .dwattr $C$DW$T$24, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2358                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x4d)
    2359                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    2360                    $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("FATFS")
    2361                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    2362                            .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    2363                            .dwattr $C$DW$T$25, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2364                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x6c)
    2365                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x03)
    2366                    $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    2367                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    2368                            .dwattr $C$DW$T$26, DW_AT_address_class(0x20)
    2369                    
    2370                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2371                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x224)
    2372                    $C$DW$176       .dwtag  DW_TAG_member
    2373                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$26)
    2374                            .dwattr $C$DW$176, DW_AT_name("fs")
    2375                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("fs")
    2376                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2377                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2378                            .dwattr $C$DW$176, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2379                            .dwattr $C$DW$176, DW_AT_decl_line(0x73)
    2380                            .dwattr $C$DW$176, DW_AT_decl_column(0x09)
    2381                    $C$DW$177       .dwtag  DW_TAG_member
    2382                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$21)
    2383                            .dwattr $C$DW$177, DW_AT_name("id")
    2384                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("id")
    2385                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2386                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2387                            .dwattr $C$DW$177, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2388                            .dwattr $C$DW$177, DW_AT_decl_line(0x74)
    2389                            .dwattr $C$DW$177, DW_AT_decl_column(0x07)
    2390                    $C$DW$178       .dwtag  DW_TAG_member
    2391                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$20)
    2392                            .dwattr $C$DW$178, DW_AT_name("flag")
    2393                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("flag")
    2394                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2395                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2396                            .dwattr $C$DW$178, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
TI ARM Assembler PC v5.2.5 Wed Oct 21 13:38:44 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   45

    2397                            .dwattr $C$DW$178, DW_AT_decl_line(0x75)
    2398                            .dwattr $C$DW$178, DW_AT_decl_column(0x07)
    2399                    $C$DW$179       .dwtag  DW_TAG_member
    2400                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$20)
    2401                            .dwattr $C$DW$179, DW_AT_name("pad1")
    2402                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("pad1")
    2403                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2404                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2405                            .dwattr $C$DW$179, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2406                            .dwattr $C$DW$179, DW_AT_decl_line(0x76)
    2407                            .dwattr $C$DW$179, DW_AT_decl_column(0x07)
    2408                    $C$DW$180       .dwtag  DW_TAG_member
    2409                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$22)
    2410                            .dwattr $C$DW$180, DW_AT_name("fptr")
    2411                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("fptr")
    2412                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2413                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2414                            .dwattr $C$DW$180, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2415                            .dwattr $C$DW$180, DW_AT_decl_line(0x77)
    2416                            .dwattr $C$DW$180, DW_AT_decl_column(0x08)
    2417                    $C$DW$181       .dwtag  DW_TAG_member
    2418                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$22)
    2419                            .dwattr $C$DW$181, DW_AT_name("fsize")
    2420                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("fsize")
    2421                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2422                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2423                            .dwattr $C$DW$181, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2424                            .dwattr $C$DW$181, DW_AT_decl_line(0x78)
    2425                            .dwattr $C$DW$181, DW_AT_decl_column(0x08)
    2426                    $C$DW$182       .dwtag  DW_TAG_member
    2427                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$22)
    2428                            .dwattr $C$DW$182, DW_AT_name("sclust")
    2429                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("sclust")
    2430                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2431                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2432                            .dwattr $C$DW$182, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2433                            .dwattr $C$DW$182, DW_AT_decl_line(0x79)
    2434                            .dwattr $C$DW$182, DW_AT_decl_column(0x08)
    2435                    $C$DW$183       .dwtag  DW_TAG_member
    2436                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$22)
    2437                            .dwattr $C$DW$183, DW_AT_name("clust")
    2438                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("clust")
    2439                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2440                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2441                            .dwattr $C$DW$183, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2442                            .dwattr $C$DW$183, DW_AT_decl_line(0x7a)
    2443                            .dwattr $C$DW$183, DW_AT_decl_column(0x08)
    2444                    $C$DW$184       .dwtag  DW_TAG_member
    2445                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$22)
    2446                            .dwattr $C$DW$184, DW_AT_name("dsect")
    2447                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("dsect")
    2448                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2449                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2450                            .dwattr $C$DW$184, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2451                            .dwattr $C$DW$184, DW_AT_decl_line(0x7b)
TI ARM Assembler PC v5.2.5 Wed Oct 21 13:38:44 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   46

    2452                            .dwattr $C$DW$184, DW_AT_decl_column(0x08)
    2453                    $C$DW$185       .dwtag  DW_TAG_member
    2454                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$22)
    2455                            .dwattr $C$DW$185, DW_AT_name("dir_sect")
    2456                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("dir_sect")
    2457                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2458                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2459                            .dwattr $C$DW$185, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2460                            .dwattr $C$DW$185, DW_AT_decl_line(0x7d)
    2461                            .dwattr $C$DW$185, DW_AT_decl_column(0x08)
    2462                    $C$DW$186       .dwtag  DW_TAG_member
    2463                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$27)
    2464                            .dwattr $C$DW$186, DW_AT_name("dir_ptr")
    2465                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("dir_ptr")
    2466                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2467                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2468                            .dwattr $C$DW$186, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2469                            .dwattr $C$DW$186, DW_AT_decl_line(0x7e)
    2470                            .dwattr $C$DW$186, DW_AT_decl_column(0x08)
    2471                    $C$DW$187       .dwtag  DW_TAG_member
    2472                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$23)
    2473                            .dwattr $C$DW$187, DW_AT_name("buf")
    2474                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("buf")
    2475                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2476                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2477                            .dwattr $C$DW$187, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2478                            .dwattr $C$DW$187, DW_AT_decl_line(0x87)
    2479                            .dwattr $C$DW$187, DW_AT_decl_column(0x07)
    2480                            .dwendtag $C$DW$T$28
    2481                    
    2482                            .dwattr $C$DW$T$28, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2483                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x72)
    2484                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    2485                    $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("FIL")
    2486                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$28)
    2487                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    2488                            .dwattr $C$DW$T$45, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2489                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x89)
    2490                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x03)
    2491                    
    2492                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2493                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x1c)
    2494                    $C$DW$188       .dwtag  DW_TAG_member
    2495                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$26)
    2496                            .dwattr $C$DW$188, DW_AT_name("fs")
    2497                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("fs")
    2498                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2499                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2500                            .dwattr $C$DW$188, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2501                            .dwattr $C$DW$188, DW_AT_decl_line(0x90)
    2502                            .dwattr $C$DW$188, DW_AT_decl_column(0x09)
    2503                    $C$DW$189       .dwtag  DW_TAG_member
    2504                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$21)
    2505                            .dwattr $C$DW$189, DW_AT_name("id")
    2506                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("id")
TI ARM Assembler PC v5.2.5 Wed Oct 21 13:38:44 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   47

    2507                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2508                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2509                            .dwattr $C$DW$189, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2510                            .dwattr $C$DW$189, DW_AT_decl_line(0x91)
    2511                            .dwattr $C$DW$189, DW_AT_decl_column(0x07)
    2512                    $C$DW$190       .dwtag  DW_TAG_member
    2513                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$21)
    2514                            .dwattr $C$DW$190, DW_AT_name("index")
    2515                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("index")
    2516                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2517                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2518                            .dwattr $C$DW$190, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2519                            .dwattr $C$DW$190, DW_AT_decl_line(0x92)
    2520                            .dwattr $C$DW$190, DW_AT_decl_column(0x07)
    2521                    $C$DW$191       .dwtag  DW_TAG_member
    2522                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$22)
    2523                            .dwattr $C$DW$191, DW_AT_name("sclust")
    2524                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("sclust")
    2525                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2526                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2527                            .dwattr $C$DW$191, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2528                            .dwattr $C$DW$191, DW_AT_decl_line(0x93)
    2529                            .dwattr $C$DW$191, DW_AT_decl_column(0x08)
    2530                    $C$DW$192       .dwtag  DW_TAG_member
    2531                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$22)
    2532                            .dwattr $C$DW$192, DW_AT_name("clust")
    2533                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("clust")
    2534                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2535                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2536                            .dwattr $C$DW$192, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2537                            .dwattr $C$DW$192, DW_AT_decl_line(0x94)
    2538                            .dwattr $C$DW$192, DW_AT_decl_column(0x08)
    2539                    $C$DW$193       .dwtag  DW_TAG_member
    2540                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$22)
    2541                            .dwattr $C$DW$193, DW_AT_name("sect")
    2542                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("sect")
    2543                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2544                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2545                            .dwattr $C$DW$193, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2546                            .dwattr $C$DW$193, DW_AT_decl_line(0x95)
    2547                            .dwattr $C$DW$193, DW_AT_decl_column(0x08)
    2548                    $C$DW$194       .dwtag  DW_TAG_member
    2549                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$27)
    2550                            .dwattr $C$DW$194, DW_AT_name("dir")
    2551                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("dir")
    2552                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2553                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2554                            .dwattr $C$DW$194, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2555                            .dwattr $C$DW$194, DW_AT_decl_line(0x96)
    2556                            .dwattr $C$DW$194, DW_AT_decl_column(0x08)
    2557                    $C$DW$195       .dwtag  DW_TAG_member
    2558                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$27)
    2559                            .dwattr $C$DW$195, DW_AT_name("fn")
    2560                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("fn")
    2561                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
TI ARM Assembler PC v5.2.5 Wed Oct 21 13:38:44 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   48

    2562                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2563                            .dwattr $C$DW$195, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2564                            .dwattr $C$DW$195, DW_AT_decl_line(0x97)
    2565                            .dwattr $C$DW$195, DW_AT_decl_column(0x08)
    2566                            .dwendtag $C$DW$T$29
    2567                    
    2568                            .dwattr $C$DW$T$29, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2569                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x8f)
    2570                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    2571                    $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("DIR")
    2572                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$29)
    2573                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    2574                            .dwattr $C$DW$T$46, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2575                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x9c)
    2576                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x03)
    2577                    
    2578                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2579                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x18)
    2580                    $C$DW$196       .dwtag  DW_TAG_member
    2581                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$22)
    2582                            .dwattr $C$DW$196, DW_AT_name("fsize")
    2583                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("fsize")
    2584                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2585                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2586                            .dwattr $C$DW$196, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2587                            .dwattr $C$DW$196, DW_AT_decl_line(0xa3)
    2588                            .dwattr $C$DW$196, DW_AT_decl_column(0x08)
    2589                    $C$DW$197       .dwtag  DW_TAG_member
    2590                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$21)
    2591                            .dwattr $C$DW$197, DW_AT_name("fdate")
    2592                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("fdate")
    2593                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2594                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2595                            .dwattr $C$DW$197, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2596                            .dwattr $C$DW$197, DW_AT_decl_line(0xa4)
    2597                            .dwattr $C$DW$197, DW_AT_decl_column(0x07)
    2598                    $C$DW$198       .dwtag  DW_TAG_member
    2599                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$21)
    2600                            .dwattr $C$DW$198, DW_AT_name("ftime")
    2601                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("ftime")
    2602                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2603                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2604                            .dwattr $C$DW$198, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2605                            .dwattr $C$DW$198, DW_AT_decl_line(0xa5)
    2606                            .dwattr $C$DW$198, DW_AT_decl_column(0x07)
    2607                    $C$DW$199       .dwtag  DW_TAG_member
    2608                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$20)
    2609                            .dwattr $C$DW$199, DW_AT_name("fattrib")
    2610                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("fattrib")
    2611                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2612                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2613                            .dwattr $C$DW$199, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2614                            .dwattr $C$DW$199, DW_AT_decl_line(0xa6)
    2615                            .dwattr $C$DW$199, DW_AT_decl_column(0x07)
    2616                    $C$DW$200       .dwtag  DW_TAG_member
TI ARM Assembler PC v5.2.5 Wed Oct 21 13:38:44 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   49

    2617                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$32)
    2618                            .dwattr $C$DW$200, DW_AT_name("fname")
    2619                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("fname")
    2620                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2621                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2622                            .dwattr $C$DW$200, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2623                            .dwattr $C$DW$200, DW_AT_decl_line(0xa7)
    2624                            .dwattr $C$DW$200, DW_AT_decl_column(0x08)
    2625                            .dwendtag $C$DW$T$33
    2626                    
    2627                            .dwattr $C$DW$T$33, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2628                            .dwattr $C$DW$T$33, DW_AT_decl_line(0xa2)
    2629                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    2630                    $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("FILINFO")
    2631                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$33)
    2632                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    2633                            .dwattr $C$DW$T$47, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2634                            .dwattr $C$DW$T$47, DW_AT_decl_line(0xac)
    2635                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x03)
    2636                    
    2637                    $C$DW$T$35      .dwtag  DW_TAG_union_type
    2638                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x10)
    2639                    $C$DW$201       .dwtag  DW_TAG_member
    2640                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$34)
    2641                            .dwattr $C$DW$201, DW_AT_name("_Us")
    2642                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("_Us")
    2643                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2644                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2645                            .dwattr $C$DW$201, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2646                            .dwattr $C$DW$201, DW_AT_decl_line(0x3a)
    2647                            .dwattr $C$DW$201, DW_AT_decl_column(0x12)
    2648                    $C$DW$202       .dwtag  DW_TAG_member
    2649                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$16)
    2650                            .dwattr $C$DW$202, DW_AT_name("_Float")
    2651                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("_Float")
    2652                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2653                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2654                            .dwattr $C$DW$202, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2655                            .dwattr $C$DW$202, DW_AT_decl_line(0x3b)
    2656                            .dwattr $C$DW$202, DW_AT_decl_column(0x09)
    2657                    $C$DW$203       .dwtag  DW_TAG_member
    2658                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$17)
    2659                            .dwattr $C$DW$203, DW_AT_name("_Double")
    2660                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("_Double")
    2661                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2662                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2663                            .dwattr $C$DW$203, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2664                            .dwattr $C$DW$203, DW_AT_decl_line(0x3c)
    2665                            .dwattr $C$DW$203, DW_AT_decl_column(0x0a)
    2666                    $C$DW$204       .dwtag  DW_TAG_member
    2667                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$18)
    2668                            .dwattr $C$DW$204, DW_AT_name("_Long_double")
    2669                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("_Long_double")
    2670                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2671                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v5.2.5 Wed Oct 21 13:38:44 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   50

    2672                            .dwattr $C$DW$204, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2673                            .dwattr $C$DW$204, DW_AT_decl_line(0x3d)
    2674                            .dwattr $C$DW$204, DW_AT_decl_column(0x0f)
    2675                            .dwendtag $C$DW$T$35
    2676                    
    2677                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float
    2678                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x39)
    2679                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x03)
    2680                    
    2681                    $C$DW$T$36      .dwtag  DW_TAG_union_type
    2682                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x10)
    2683                    $C$DW$205       .dwtag  DW_TAG_member
    2684                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$34)
    2685                            .dwattr $C$DW$205, DW_AT_name("_Word")
    2686                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("_Word")
    2687                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2688                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2689                            .dwattr $C$DW$205, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath.
    2690                            .dwattr $C$DW$205, DW_AT_decl_line(0x8f)
    2691                            .dwattr $C$DW$205, DW_AT_decl_column(0x11)
    2692                    $C$DW$206       .dwtag  DW_TAG_member
    2693                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$16)
    2694                            .dwattr $C$DW$206, DW_AT_name("_Float")
    2695                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("_Float")
    2696                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2697                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2698                            .dwattr $C$DW$206, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath.
    2699                            .dwattr $C$DW$206, DW_AT_decl_line(0x90)
    2700                            .dwattr $C$DW$206, DW_AT_decl_column(0x08)
    2701                    $C$DW$207       .dwtag  DW_TAG_member
    2702                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$17)
    2703                            .dwattr $C$DW$207, DW_AT_name("_Double")
    2704                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("_Double")
    2705                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2706                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2707                            .dwattr $C$DW$207, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath.
    2708                            .dwattr $C$DW$207, DW_AT_decl_line(0x91)
    2709                            .dwattr $C$DW$207, DW_AT_decl_column(0x09)
    2710                    $C$DW$208       .dwtag  DW_TAG_member
    2711                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$18)
    2712                            .dwattr $C$DW$208, DW_AT_name("_Long_double")
    2713                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("_Long_double")
    2714                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2715                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2716                            .dwattr $C$DW$208, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath.
    2717                            .dwattr $C$DW$208, DW_AT_decl_line(0x92)
    2718                            .dwattr $C$DW$208, DW_AT_decl_column(0x0e)
    2719                            .dwendtag $C$DW$T$36
    2720                    
    2721                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath
    2722                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x8e)
    2723                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x02)
    2724                    $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("_Dconst")
    2725                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$36)
    2726                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v5.2.5 Wed Oct 21 13:38:44 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   51

    2727                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath
    2728                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x93)
    2729                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x04)
    2730                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2731                            .dwattr $C$DW$T$2, DW_AT_name("void")
    2732                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2733                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2734                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2735                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    2736                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2737                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    2738                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2739                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    2740                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2741                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2742                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2743                    $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    2744                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$5)
    2745                            .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    2746                            .dwattr $C$DW$T$67, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2747                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x2a)
    2748                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x1d)
    2749                    $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
    2750                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    2751                            .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    2752                            .dwattr $C$DW$T$68, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2753                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x37)
    2754                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x17)
    2755                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    2756                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2757                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2758                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2759                    $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("BYTE")
    2760                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$6)
    2761                            .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    2762                            .dwattr $C$DW$T$20, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2763                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x16)
    2764                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x17)
    2765                    $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("DSTATUS")
    2766                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$20)
    2767                            .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    2768                            .dwattr $C$DW$T$69, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2769                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x13)
    2770                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x0e)
    2771                    
    2772                    $C$DW$T$23      .dwtag  DW_TAG_array_type
    2773                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$20)
    2774                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    2775                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x200)
    2776                    $C$DW$209       .dwtag  DW_TAG_subrange_type
    2777                            .dwattr $C$DW$209, DW_AT_upper_bound(0x1ff)
    2778                            .dwendtag $C$DW$T$23
    2779                    
    2780                    $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    2781                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$20)
TI ARM Assembler PC v5.2.5 Wed Oct 21 13:38:44 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   52

    2782                            .dwattr $C$DW$T$27, DW_AT_address_class(0x20)
    2783                    $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("UCHAR")
    2784                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$6)
    2785                            .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    2786                            .dwattr $C$DW$T$70, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2787                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x15)
    2788                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x17)
    2789                    $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    2790                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$6)
    2791                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    2792                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2793                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x2b)
    2794                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x1c)
    2795                    $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
    2796                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$50)
    2797                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    2798                            .dwattr $C$DW$T$73, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2799                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x38)
    2800                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x16)
    2801                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    2802                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2803                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2804                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    2805                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    2806                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2807                            .dwattr $C$DW$T$8, DW_AT_name("short")
    2808                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    2809                    $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("SHORT")
    2810                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$8)
    2811                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    2812                            .dwattr $C$DW$T$74, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2813                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x19)
    2814                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x11)
    2815                    $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
    2816                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$8)
    2817                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2818                            .dwattr $C$DW$T$75, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2819                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x2c)
    2820                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x1d)
    2821                    $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
    2822                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    2823                            .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    2824                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2825                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x3a)
    2826                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x17)
    2827                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    2828                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2829                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2830                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    2831                    $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("USHORT")
    2832                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$9)
    2833                            .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    2834                            .dwattr $C$DW$T$77, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2835                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x1a)
    2836                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x18)
TI ARM Assembler PC v5.2.5 Wed Oct 21 13:38:44 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   53

    2837                    $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("WCHAR")
    2838                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$9)
    2839                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    2840                            .dwattr $C$DW$T$78, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2841                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x1c)
    2842                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x18)
    2843                    $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("WORD")
    2844                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$9)
    2845                            .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    2846                            .dwattr $C$DW$T$21, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2847                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x1b)
    2848                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x18)
    2849                    $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("_Wchart")
    2850                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$9)
    2851                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    2852                            .dwattr $C$DW$T$79, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yvals
    2853                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x1e5)
    2854                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x21)
    2855                    $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("_Wintt")
    2856                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$9)
    2857                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    2858                            .dwattr $C$DW$T$80, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yvals
    2859                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x1e6)
    2860                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x21)
    2861                    
    2862                    $C$DW$T$34      .dwtag  DW_TAG_array_type
    2863                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$9)
    2864                            .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    2865                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x10)
    2866                    $C$DW$210       .dwtag  DW_TAG_subrange_type
    2867                            .dwattr $C$DW$210, DW_AT_upper_bound(0x07)
    2868                            .dwendtag $C$DW$T$34
    2869                    
    2870                    $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    2871                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$9)
    2872                            .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    2873                            .dwattr $C$DW$T$81, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2874                            .dwattr $C$DW$T$81, DW_AT_decl_line(0x2d)
    2875                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x1c)
    2876                    $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
    2877                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    2878                            .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    2879                            .dwattr $C$DW$T$82, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2880                            .dwattr $C$DW$T$82, DW_AT_decl_line(0x3b)
    2881                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x16)
    2882                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    2883                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2884                            .dwattr $C$DW$T$10, DW_AT_name("int")
    2885                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    2886                    $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("INT")
    2887                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$10)
    2888                            .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    2889                            .dwattr $C$DW$T$83, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2890                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x10)
    2891                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x10)
TI ARM Assembler PC v5.2.5 Wed Oct 21 13:38:44 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   54

    2892                    $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("_Ptrdifft")
    2893                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$10)
    2894                            .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    2895                            .dwattr $C$DW$T$84, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yvals
    2896                            .dwattr $C$DW$T$84, DW_AT_decl_line(0xa9)
    2897                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x1e)
    2898                    $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
    2899                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$10)
    2900                            .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    2901                            .dwattr $C$DW$T$86, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2902                            .dwattr $C$DW$T$86, DW_AT_decl_line(0x2e)
    2903                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x1d)
    2904                    $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast16_t")
    2905                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    2906                            .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    2907                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2908                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x47)
    2909                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x17)
    2910                    $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast32_t")
    2911                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$86)
    2912                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    2913                            .dwattr $C$DW$T$88, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2914                            .dwattr $C$DW$T$88, DW_AT_decl_line(0x4a)
    2915                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x17)
    2916                    $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast8_t")
    2917                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$86)
    2918                            .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    2919                            .dwattr $C$DW$T$89, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2920                            .dwattr $C$DW$T$89, DW_AT_decl_line(0x45)
    2921                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x17)
    2922                    $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("int_least32_t")
    2923                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$86)
    2924                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    2925                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2926                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x3c)
    2927                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x17)
    2928                    $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("intptr_t")
    2929                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$10)
    2930                            .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    2931                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2932                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x52)
    2933                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x1a)
    2934                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    2935                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2936                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    2937                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    2938                    $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("UINT")
    2939                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$11)
    2940                            .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    2941                            .dwattr $C$DW$T$92, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2942                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x11)
    2943                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x16)
    2944                    $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("_Sizet")
    2945                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$11)
    2946                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v5.2.5 Wed Oct 21 13:38:44 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   55

    2947                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yvals
    2948                            .dwattr $C$DW$T$93, DW_AT_decl_line(0xab)
    2949                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x1a)
    2950                    $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("_TI_uint32_t")
    2951                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$11)
    2952                            .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    2953                            .dwattr $C$DW$T$94, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath
    2954                            .dwattr $C$DW$T$94, DW_AT_decl_line(0xb6)
    2955                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x19)
    2956                    $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
    2957                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$11)
    2958                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    2959                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2960                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x2f)
    2961                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x1c)
    2962                    $C$DW$T$100     .dwtag  DW_TAG_volatile_type
    2963                            .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$49)
    2964                    $C$DW$T$101     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast16_t")
    2965                            .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$49)
    2966                            .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    2967                            .dwattr $C$DW$T$101, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    2968                            .dwattr $C$DW$T$101, DW_AT_decl_line(0x48)
    2969                            .dwattr $C$DW$T$101, DW_AT_decl_column(0x16)
    2970                    $C$DW$T$102     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast32_t")
    2971                            .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$49)
    2972                            .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    2973                            .dwattr $C$DW$T$102, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    2974                            .dwattr $C$DW$T$102, DW_AT_decl_line(0x4b)
    2975                            .dwattr $C$DW$T$102, DW_AT_decl_column(0x16)
    2976                    $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast8_t")
    2977                            .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$49)
    2978                            .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    2979                            .dwattr $C$DW$T$103, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    2980                            .dwattr $C$DW$T$103, DW_AT_decl_line(0x46)
    2981                            .dwattr $C$DW$T$103, DW_AT_decl_column(0x16)
    2982                    $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least32_t")
    2983                            .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$49)
    2984                            .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    2985                            .dwattr $C$DW$T$104, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    2986                            .dwattr $C$DW$T$104, DW_AT_decl_line(0x3d)
    2987                            .dwattr $C$DW$T$104, DW_AT_decl_column(0x16)
    2988                    $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("uintptr_t")
    2989                            .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$11)
    2990                            .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    2991                            .dwattr $C$DW$T$105, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    2992                            .dwattr $C$DW$T$105, DW_AT_decl_line(0x53)
    2993                            .dwattr $C$DW$T$105, DW_AT_decl_column(0x1a)
    2994                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    2995                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    2996                            .dwattr $C$DW$T$12, DW_AT_name("long")
    2997                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    2998                    $C$DW$T$106     .dwtag  DW_TAG_typedef, DW_AT_name("LONG")
    2999                            .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$12)
    3000                            .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    3001                            .dwattr $C$DW$T$106, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
TI ARM Assembler PC v5.2.5 Wed Oct 21 13:38:44 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   56

    3002                            .dwattr $C$DW$T$106, DW_AT_decl_line(0x1f)
    3003                            .dwattr $C$DW$T$106, DW_AT_decl_column(0x10)
    3004                    $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("_Int32t")
    3005                            .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$12)
    3006                            .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    3007                            .dwattr $C$DW$T$107, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yval
    3008                            .dwattr $C$DW$T$107, DW_AT_decl_line(0xa6)
    3009                            .dwattr $C$DW$T$107, DW_AT_decl_column(0x0e)
    3010                    $C$DW$T$13      .dwtag  DW_TAG_base_type
    3011                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    3012                            .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    3013                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
    3014                    $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("DWORD")
    3015                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$13)
    3016                            .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    3017                            .dwattr $C$DW$T$22, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    3018                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x21)
    3019                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x17)
    3020                    $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("ULONG")
    3021                            .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$13)
    3022                            .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
    3023                            .dwattr $C$DW$T$108, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    3024                            .dwattr $C$DW$T$108, DW_AT_decl_line(0x20)
    3025                            .dwattr $C$DW$T$108, DW_AT_decl_column(0x17)
    3026                    $C$DW$T$109     .dwtag  DW_TAG_typedef, DW_AT_name("_Uint32t")
    3027                            .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$13)
    3028                            .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    3029                            .dwattr $C$DW$T$109, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yval
    3030                            .dwattr $C$DW$T$109, DW_AT_decl_line(0xa7)
    3031                            .dwattr $C$DW$T$109, DW_AT_decl_column(0x17)
    3032                    $C$DW$T$14      .dwtag  DW_TAG_base_type
    3033                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    3034                            .dwattr $C$DW$T$14, DW_AT_name("long long")
    3035                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    3036                    $C$DW$T$110     .dwtag  DW_TAG_typedef, DW_AT_name("_Longlong")
    3037                            .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$14)
    3038                            .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    3039                            .dwattr $C$DW$T$110, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yval
    3040                            .dwattr $C$DW$T$110, DW_AT_decl_line(0x1b5)
    3041                            .dwattr $C$DW$T$110, DW_AT_decl_column(0x13)
    3042                    $C$DW$T$111     .dwtag  DW_TAG_typedef, DW_AT_name("int64_t")
    3043                            .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$14)
    3044                            .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
    3045                            .dwattr $C$DW$T$111, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3046                            .dwattr $C$DW$T$111, DW_AT_decl_line(0x32)
    3047                            .dwattr $C$DW$T$111, DW_AT_decl_column(0x21)
    3048                    $C$DW$T$112     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast64_t")
    3049                            .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$111)
    3050                            .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    3051                            .dwattr $C$DW$T$112, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3052                            .dwattr $C$DW$T$112, DW_AT_decl_line(0x4e)
    3053                            .dwattr $C$DW$T$112, DW_AT_decl_column(0x17)
    3054                    $C$DW$T$113     .dwtag  DW_TAG_typedef, DW_AT_name("int_least64_t")
    3055                            .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$111)
    3056                            .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v5.2.5 Wed Oct 21 13:38:44 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   57

    3057                            .dwattr $C$DW$T$113, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3058                            .dwattr $C$DW$T$113, DW_AT_decl_line(0x40)
    3059                            .dwattr $C$DW$T$113, DW_AT_decl_column(0x17)
    3060                    $C$DW$T$114     .dwtag  DW_TAG_typedef, DW_AT_name("intmax_t")
    3061                            .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$14)
    3062                            .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    3063                            .dwattr $C$DW$T$114, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3064                            .dwattr $C$DW$T$114, DW_AT_decl_line(0x56)
    3065                            .dwattr $C$DW$T$114, DW_AT_decl_column(0x20)
    3066                    $C$DW$T$15      .dwtag  DW_TAG_base_type
    3067                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    3068                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    3069                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    3070                    $C$DW$T$115     .dwtag  DW_TAG_typedef, DW_AT_name("_TI_uint64_t")
    3071                            .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$15)
    3072                            .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
    3073                            .dwattr $C$DW$T$115, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymat
    3074                            .dwattr $C$DW$T$115, DW_AT_decl_line(0xbc)
    3075                            .dwattr $C$DW$T$115, DW_AT_decl_column(0x1c)
    3076                    $C$DW$T$116     .dwtag  DW_TAG_typedef, DW_AT_name("_ULonglong")
    3077                            .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$15)
    3078                            .dwattr $C$DW$T$116, DW_AT_language(DW_LANG_C)
    3079                            .dwattr $C$DW$T$116, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yval
    3080                            .dwattr $C$DW$T$116, DW_AT_decl_line(0x1b6)
    3081                            .dwattr $C$DW$T$116, DW_AT_decl_column(0x14)
    3082                    $C$DW$T$117     .dwtag  DW_TAG_typedef, DW_AT_name("uint64_t")
    3083                            .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$15)
    3084                            .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
    3085                            .dwattr $C$DW$T$117, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3086                            .dwattr $C$DW$T$117, DW_AT_decl_line(0x33)
    3087                            .dwattr $C$DW$T$117, DW_AT_decl_column(0x20)
    3088                    $C$DW$T$118     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast64_t")
    3089                            .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$117)
    3090                            .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
    3091                            .dwattr $C$DW$T$118, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3092                            .dwattr $C$DW$T$118, DW_AT_decl_line(0x4f)
    3093                            .dwattr $C$DW$T$118, DW_AT_decl_column(0x16)
    3094                    $C$DW$T$119     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least64_t")
    3095                            .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$117)
    3096                            .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    3097                            .dwattr $C$DW$T$119, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3098                            .dwattr $C$DW$T$119, DW_AT_decl_line(0x41)
    3099                            .dwattr $C$DW$T$119, DW_AT_decl_column(0x16)
    3100                    $C$DW$T$120     .dwtag  DW_TAG_typedef, DW_AT_name("uintmax_t")
    3101                            .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$15)
    3102                            .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    3103                            .dwattr $C$DW$T$120, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3104                            .dwattr $C$DW$T$120, DW_AT_decl_line(0x57)
    3105                            .dwattr $C$DW$T$120, DW_AT_decl_column(0x20)
    3106                    $C$DW$T$16      .dwtag  DW_TAG_base_type
    3107                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    3108                            .dwattr $C$DW$T$16, DW_AT_name("float")
    3109                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    3110                    $C$DW$T$123     .dwtag  DW_TAG_typedef, DW_AT_name("float_t")
    3111                            .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$16)
