TI ARM Assembler PC v5.2.5 Wed Nov 04 18:29:40 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                             PC v5.2.5 *
       3                    ;* Date/Time created: Wed Nov 04 18:29:40 2015                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --disab
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../timers.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.2.5 Copyright (c) 1996-2015 Te
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("E:\Dev\Ti\Code\GIT\LaunchpadRoomControl\LaunchpadRoomControl
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("GPIOPinWrite")

    2046                    $C$DW$142       .dwtag  DW_TAG_enumerator, DW_AT_name("FR_NOT_ENOUGH_CORE"), DW_AT_const_value(0x11)
    2047                            .dwattr $C$DW$142, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2048                            .dwattr $C$DW$142, DW_AT_decl_line(0xc4)
    2049                            .dwattr $C$DW$142, DW_AT_decl_column(0x02)
    2050                    $C$DW$143       .dwtag  DW_TAG_enumerator, DW_AT_name("FR_TOO_MANY_OPEN_FILES"), DW_AT_const_value(0x1
    2051                            .dwattr $C$DW$143, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2052                            .dwattr $C$DW$143, DW_AT_decl_line(0xc5)
    2053                            .dwattr $C$DW$143, DW_AT_decl_column(0x02)
    2054                    $C$DW$144       .dwtag  DW_TAG_enumerator, DW_AT_name("FR_INVALID_PARAMETER"), DW_AT_const_value(0x13)
    2055                            .dwattr $C$DW$144, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2056                            .dwattr $C$DW$144, DW_AT_decl_line(0xc6)
    2057                            .dwattr $C$DW$144, DW_AT_decl_column(0x02)
    2058                            .dwendtag $C$DW$T$40
    2059                    
    2060                            .dwattr $C$DW$T$40, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2061                            .dwattr $C$DW$T$40, DW_AT_decl_line(0xb2)
    2062                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x0e)
    2063                    $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("FRESULT")
    2064                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    2065                            .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    2066                            .dwattr $C$DW$T$41, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2067                            .dwattr $C$DW$T$41, DW_AT_decl_line(0xc7)
    2068                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x03)
    2069                    
    2070                    $C$DW$T$42      .dwtag  DW_TAG_enumeration_type
    2071                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    2072                    $C$DW$145       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_OK"), DW_AT_const_value(0x00)
    2073                            .dwattr $C$DW$145, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2074                            .dwattr $C$DW$145, DW_AT_decl_line(0x17)
    2075                            .dwattr $C$DW$145, DW_AT_decl_column(0x02)
    2076                    $C$DW$146       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_ERROR"), DW_AT_const_value(0x01)
    2077                            .dwattr $C$DW$146, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2078                            .dwattr $C$DW$146, DW_AT_decl_line(0x18)
    2079                            .dwattr $C$DW$146, DW_AT_decl_column(0x02)
    2080                    $C$DW$147       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_WRPRT"), DW_AT_const_value(0x02)
    2081                            .dwattr $C$DW$147, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2082                            .dwattr $C$DW$147, DW_AT_decl_line(0x19)
    2083                            .dwattr $C$DW$147, DW_AT_decl_column(0x02)
    2084                    $C$DW$148       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_NOTRDY"), DW_AT_const_value(0x03)
    2085                            .dwattr $C$DW$148, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2086                            .dwattr $C$DW$148, DW_AT_decl_line(0x1a)
    2087                            .dwattr $C$DW$148, DW_AT_decl_column(0x02)
    2088                    $C$DW$149       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_PARERR"), DW_AT_const_value(0x04)
    2089                            .dwattr $C$DW$149, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2090                            .dwattr $C$DW$149, DW_AT_decl_line(0x1b)
    2091                            .dwattr $C$DW$149, DW_AT_decl_column(0x02)
    2092                            .dwendtag $C$DW$T$42
    2093                    
    2094                            .dwattr $C$DW$T$42, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2095                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x16)
TI ARM Assembler PC v5.2.5 Wed Nov 04 18:29:40 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   40

    2096                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x0e)
    2097                    $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("DRESULT")
    2098                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    2099                            .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    2100                            .dwattr $C$DW$T$43, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2101                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x1c)
    2102                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x03)
    2103                    
    2104                    $C$DW$T$19      .dwtag  DW_TAG_structure_type
    2105                            .dwattr $C$DW$T$19, DW_AT_byte_size(0x48)
    2106                    $C$DW$150       .dwtag  DW_TAG_member
    2107                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$10)
    2108                            .dwattr $C$DW$150, DW_AT_name("_Ddig")
    2109                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("_Ddig")
    2110                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2111                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2112                            .dwattr $C$DW$150, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2113                            .dwattr $C$DW$150, DW_AT_decl_line(0x37)
    2114                            .dwattr $C$DW$150, DW_AT_decl_column(0x06)
    2115                    $C$DW$151       .dwtag  DW_TAG_member
    2116                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$10)
    2117                            .dwattr $C$DW$151, DW_AT_name("_Dmdig")
    2118                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("_Dmdig")
    2119                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2120                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2121                            .dwattr $C$DW$151, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2122                            .dwattr $C$DW$151, DW_AT_decl_line(0x37)
    2123                            .dwattr $C$DW$151, DW_AT_decl_column(0x0d)
    2124                    $C$DW$152       .dwtag  DW_TAG_member
    2125                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$10)
    2126                            .dwattr $C$DW$152, DW_AT_name("_Dmax10e")
    2127                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("_Dmax10e")
    2128                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2129                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2130                            .dwattr $C$DW$152, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2131                            .dwattr $C$DW$152, DW_AT_decl_line(0x37)
    2132                            .dwattr $C$DW$152, DW_AT_decl_column(0x15)
    2133                    $C$DW$153       .dwtag  DW_TAG_member
    2134                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$10)
    2135                            .dwattr $C$DW$153, DW_AT_name("_Dmaxe")
    2136                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("_Dmaxe")
    2137                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2138                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2139                            .dwattr $C$DW$153, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2140                            .dwattr $C$DW$153, DW_AT_decl_line(0x37)
    2141                            .dwattr $C$DW$153, DW_AT_decl_column(0x1f)
    2142                    $C$DW$154       .dwtag  DW_TAG_member
    2143                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$10)
    2144                            .dwattr $C$DW$154, DW_AT_name("_Dmin10e")
    2145                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("_Dmin10e")
    2146                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2147                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2148                            .dwattr $C$DW$154, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2149                            .dwattr $C$DW$154, DW_AT_decl_line(0x37)
    2150                            .dwattr $C$DW$154, DW_AT_decl_column(0x27)
TI ARM Assembler PC v5.2.5 Wed Nov 04 18:29:40 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   41

    2151                    $C$DW$155       .dwtag  DW_TAG_member
    2152                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$10)
    2153                            .dwattr $C$DW$155, DW_AT_name("_Dmine")
    2154                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("_Dmine")
    2155                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2156                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2157                            .dwattr $C$DW$155, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2158                            .dwattr $C$DW$155, DW_AT_decl_line(0x37)
    2159                            .dwattr $C$DW$155, DW_AT_decl_column(0x31)
    2160                    $C$DW$156       .dwtag  DW_TAG_member
    2161                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$35)
    2162                            .dwattr $C$DW$156, DW_AT_name("_Deps")
    2163                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("_Deps")
    2164                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2165                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2166                            .dwattr $C$DW$156, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2167                            .dwattr $C$DW$156, DW_AT_decl_line(0x3e)
    2168                            .dwattr $C$DW$156, DW_AT_decl_column(0x05)
    2169                    $C$DW$157       .dwtag  DW_TAG_member
    2170                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$35)
    2171                            .dwattr $C$DW$157, DW_AT_name("_Dmax")
    2172                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("_Dmax")
    2173                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2174                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2175                            .dwattr $C$DW$157, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2176                            .dwattr $C$DW$157, DW_AT_decl_line(0x3e)
    2177                            .dwattr $C$DW$157, DW_AT_decl_column(0x0c)
    2178                    $C$DW$158       .dwtag  DW_TAG_member
    2179                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$35)
    2180                            .dwattr $C$DW$158, DW_AT_name("_Dmin")
    2181                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("_Dmin")
    2182                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2183                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2184                            .dwattr $C$DW$158, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2185                            .dwattr $C$DW$158, DW_AT_decl_line(0x3e)
    2186                            .dwattr $C$DW$158, DW_AT_decl_column(0x13)
    2187                            .dwendtag $C$DW$T$19
    2188                    
    2189                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float
    2190                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x36)
    2191                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x02)
    2192                    $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("_Dvals")
    2193                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$19)
    2194                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    2195                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float
    2196                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x3f)
    2197                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x04)
    2198                    
    2199                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2200                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x234)
    2201                    $C$DW$159       .dwtag  DW_TAG_member
    2202                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$20)
    2203                            .dwattr $C$DW$159, DW_AT_name("fs_type")
    2204                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("fs_type")
    2205                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v5.2.5 Wed Nov 04 18:29:40 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   42

    2206                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2207                            .dwattr $C$DW$159, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2208                            .dwattr $C$DW$159, DW_AT_decl_line(0x4e)
    2209                            .dwattr $C$DW$159, DW_AT_decl_column(0x07)
    2210                    $C$DW$160       .dwtag  DW_TAG_member
    2211                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$20)
    2212                            .dwattr $C$DW$160, DW_AT_name("drv")
    2213                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("drv")
    2214                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2215                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2216                            .dwattr $C$DW$160, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2217                            .dwattr $C$DW$160, DW_AT_decl_line(0x4f)
    2218                            .dwattr $C$DW$160, DW_AT_decl_column(0x07)
    2219                    $C$DW$161       .dwtag  DW_TAG_member
    2220                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$20)
    2221                            .dwattr $C$DW$161, DW_AT_name("csize")
    2222                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("csize")
    2223                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2224                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2225                            .dwattr $C$DW$161, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2226                            .dwattr $C$DW$161, DW_AT_decl_line(0x50)
    2227                            .dwattr $C$DW$161, DW_AT_decl_column(0x07)
    2228                    $C$DW$162       .dwtag  DW_TAG_member
    2229                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    2230                            .dwattr $C$DW$162, DW_AT_name("n_fats")
    2231                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("n_fats")
    2232                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2233                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2234                            .dwattr $C$DW$162, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2235                            .dwattr $C$DW$162, DW_AT_decl_line(0x51)
    2236                            .dwattr $C$DW$162, DW_AT_decl_column(0x07)
    2237                    $C$DW$163       .dwtag  DW_TAG_member
    2238                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$20)
    2239                            .dwattr $C$DW$163, DW_AT_name("wflag")
    2240                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("wflag")
    2241                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2242                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2243                            .dwattr $C$DW$163, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2244                            .dwattr $C$DW$163, DW_AT_decl_line(0x52)
    2245                            .dwattr $C$DW$163, DW_AT_decl_column(0x07)
    2246                    $C$DW$164       .dwtag  DW_TAG_member
    2247                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$20)
    2248                            .dwattr $C$DW$164, DW_AT_name("fsi_flag")
    2249                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("fsi_flag")
    2250                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2251                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2252                            .dwattr $C$DW$164, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2253                            .dwattr $C$DW$164, DW_AT_decl_line(0x53)
    2254                            .dwattr $C$DW$164, DW_AT_decl_column(0x07)
    2255                    $C$DW$165       .dwtag  DW_TAG_member
    2256                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$21)
    2257                            .dwattr $C$DW$165, DW_AT_name("id")
    2258                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("id")
    2259                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2260                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v5.2.5 Wed Nov 04 18:29:40 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   43

    2261                            .dwattr $C$DW$165, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2262                            .dwattr $C$DW$165, DW_AT_decl_line(0x54)
    2263                            .dwattr $C$DW$165, DW_AT_decl_column(0x07)
    2264                    $C$DW$166       .dwtag  DW_TAG_member
    2265                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$21)
    2266                            .dwattr $C$DW$166, DW_AT_name("n_rootdir")
    2267                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("n_rootdir")
    2268                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2269                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2270                            .dwattr $C$DW$166, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2271                            .dwattr $C$DW$166, DW_AT_decl_line(0x55)
    2272                            .dwattr $C$DW$166, DW_AT_decl_column(0x07)
    2273                    $C$DW$167       .dwtag  DW_TAG_member
    2274                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$22)
    2275                            .dwattr $C$DW$167, DW_AT_name("last_clust")
    2276                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("last_clust")
    2277                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2278                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2279                            .dwattr $C$DW$167, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2280                            .dwattr $C$DW$167, DW_AT_decl_line(0x5d)
    2281                            .dwattr $C$DW$167, DW_AT_decl_column(0x08)
    2282                    $C$DW$168       .dwtag  DW_TAG_member
    2283                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$22)
    2284                            .dwattr $C$DW$168, DW_AT_name("free_clust")
    2285                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("free_clust")
    2286                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2287                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2288                            .dwattr $C$DW$168, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2289                            .dwattr $C$DW$168, DW_AT_decl_line(0x5e)
    2290                            .dwattr $C$DW$168, DW_AT_decl_column(0x08)
    2291                    $C$DW$169       .dwtag  DW_TAG_member
    2292                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$22)
    2293                            .dwattr $C$DW$169, DW_AT_name("fsi_sector")
    2294                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("fsi_sector")
    2295                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2296                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2297                            .dwattr $C$DW$169, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2298                            .dwattr $C$DW$169, DW_AT_decl_line(0x5f)
    2299                            .dwattr $C$DW$169, DW_AT_decl_column(0x08)
    2300                    $C$DW$170       .dwtag  DW_TAG_member
    2301                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$22)
    2302                            .dwattr $C$DW$170, DW_AT_name("n_fatent")
    2303                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("n_fatent")
    2304                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2305                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2306                            .dwattr $C$DW$170, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2307                            .dwattr $C$DW$170, DW_AT_decl_line(0x64)
    2308                            .dwattr $C$DW$170, DW_AT_decl_column(0x08)
    2309                    $C$DW$171       .dwtag  DW_TAG_member
    2310                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$22)
    2311                            .dwattr $C$DW$171, DW_AT_name("fsize")
    2312                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("fsize")
    2313                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2314                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2315                            .dwattr $C$DW$171, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
TI ARM Assembler PC v5.2.5 Wed Nov 04 18:29:40 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   44

    2316                            .dwattr $C$DW$171, DW_AT_decl_line(0x65)
    2317                            .dwattr $C$DW$171, DW_AT_decl_column(0x08)
    2318                    $C$DW$172       .dwtag  DW_TAG_member
    2319                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$22)
    2320                            .dwattr $C$DW$172, DW_AT_name("volbase")
    2321                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("volbase")
    2322                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2323                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2324                            .dwattr $C$DW$172, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2325                            .dwattr $C$DW$172, DW_AT_decl_line(0x66)
    2326                            .dwattr $C$DW$172, DW_AT_decl_column(0x08)
    2327                    $C$DW$173       .dwtag  DW_TAG_member
    2328                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$22)
    2329                            .dwattr $C$DW$173, DW_AT_name("fatbase")
    2330                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("fatbase")
    2331                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2332                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2333                            .dwattr $C$DW$173, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2334                            .dwattr $C$DW$173, DW_AT_decl_line(0x67)
    2335                            .dwattr $C$DW$173, DW_AT_decl_column(0x08)
    2336                    $C$DW$174       .dwtag  DW_TAG_member
    2337                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$22)
    2338                            .dwattr $C$DW$174, DW_AT_name("dirbase")
    2339                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("dirbase")
    2340                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2341                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2342                            .dwattr $C$DW$174, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2343                            .dwattr $C$DW$174, DW_AT_decl_line(0x68)
    2344                            .dwattr $C$DW$174, DW_AT_decl_column(0x08)
    2345                    $C$DW$175       .dwtag  DW_TAG_member
    2346                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$22)
    2347                            .dwattr $C$DW$175, DW_AT_name("database")
    2348                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("database")
    2349                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2350                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2351                            .dwattr $C$DW$175, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2352                            .dwattr $C$DW$175, DW_AT_decl_line(0x69)
    2353                            .dwattr $C$DW$175, DW_AT_decl_column(0x08)
    2354                    $C$DW$176       .dwtag  DW_TAG_member
    2355                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$22)
    2356                            .dwattr $C$DW$176, DW_AT_name("winsect")
    2357                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("winsect")
    2358                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2359                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2360                            .dwattr $C$DW$176, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2361                            .dwattr $C$DW$176, DW_AT_decl_line(0x6a)
    2362                            .dwattr $C$DW$176, DW_AT_decl_column(0x08)
    2363                    $C$DW$177       .dwtag  DW_TAG_member
    2364                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$23)
    2365                            .dwattr $C$DW$177, DW_AT_name("win")
    2366                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("win")
    2367                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2368                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2369                            .dwattr $C$DW$177, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2370                            .dwattr $C$DW$177, DW_AT_decl_line(0x6b)
TI ARM Assembler PC v5.2.5 Wed Nov 04 18:29:40 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   45

    2371                            .dwattr $C$DW$177, DW_AT_decl_column(0x07)
    2372                            .dwendtag $C$DW$T$24
    2373                    
    2374                            .dwattr $C$DW$T$24, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2375                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x4d)
    2376                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    2377                    $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("FATFS")
    2378                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    2379                            .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    2380                            .dwattr $C$DW$T$25, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2381                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x6c)
    2382                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x03)
    2383                    $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    2384                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    2385                            .dwattr $C$DW$T$26, DW_AT_address_class(0x20)
    2386                    
    2387                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2388                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x224)
    2389                    $C$DW$178       .dwtag  DW_TAG_member
    2390                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$26)
    2391                            .dwattr $C$DW$178, DW_AT_name("fs")
    2392                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("fs")
    2393                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2394                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2395                            .dwattr $C$DW$178, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2396                            .dwattr $C$DW$178, DW_AT_decl_line(0x73)
    2397                            .dwattr $C$DW$178, DW_AT_decl_column(0x09)
    2398                    $C$DW$179       .dwtag  DW_TAG_member
    2399                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$21)
    2400                            .dwattr $C$DW$179, DW_AT_name("id")
    2401                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("id")
    2402                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2403                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2404                            .dwattr $C$DW$179, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2405                            .dwattr $C$DW$179, DW_AT_decl_line(0x74)
    2406                            .dwattr $C$DW$179, DW_AT_decl_column(0x07)
    2407                    $C$DW$180       .dwtag  DW_TAG_member
    2408                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$20)
    2409                            .dwattr $C$DW$180, DW_AT_name("flag")
    2410                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("flag")
    2411                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2412                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2413                            .dwattr $C$DW$180, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2414                            .dwattr $C$DW$180, DW_AT_decl_line(0x75)
    2415                            .dwattr $C$DW$180, DW_AT_decl_column(0x07)
    2416                    $C$DW$181       .dwtag  DW_TAG_member
    2417                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$20)
    2418                            .dwattr $C$DW$181, DW_AT_name("pad1")
    2419                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("pad1")
    2420                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2421                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2422                            .dwattr $C$DW$181, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2423                            .dwattr $C$DW$181, DW_AT_decl_line(0x76)
    2424                            .dwattr $C$DW$181, DW_AT_decl_column(0x07)
    2425                    $C$DW$182       .dwtag  DW_TAG_member
TI ARM Assembler PC v5.2.5 Wed Nov 04 18:29:40 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   46

    2426                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$22)
    2427                            .dwattr $C$DW$182, DW_AT_name("fptr")
    2428                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("fptr")
    2429                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2430                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2431                            .dwattr $C$DW$182, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2432                            .dwattr $C$DW$182, DW_AT_decl_line(0x77)
    2433                            .dwattr $C$DW$182, DW_AT_decl_column(0x08)
    2434                    $C$DW$183       .dwtag  DW_TAG_member
    2435                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$22)
    2436                            .dwattr $C$DW$183, DW_AT_name("fsize")
    2437                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("fsize")
    2438                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2439                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2440                            .dwattr $C$DW$183, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2441                            .dwattr $C$DW$183, DW_AT_decl_line(0x78)
    2442                            .dwattr $C$DW$183, DW_AT_decl_column(0x08)
    2443                    $C$DW$184       .dwtag  DW_TAG_member
    2444                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$22)
    2445                            .dwattr $C$DW$184, DW_AT_name("sclust")
    2446                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("sclust")
    2447                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2448                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2449                            .dwattr $C$DW$184, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2450                            .dwattr $C$DW$184, DW_AT_decl_line(0x79)
    2451                            .dwattr $C$DW$184, DW_AT_decl_column(0x08)
    2452                    $C$DW$185       .dwtag  DW_TAG_member
    2453                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$22)
    2454                            .dwattr $C$DW$185, DW_AT_name("clust")
    2455                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("clust")
    2456                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2457                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2458                            .dwattr $C$DW$185, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2459                            .dwattr $C$DW$185, DW_AT_decl_line(0x7a)
    2460                            .dwattr $C$DW$185, DW_AT_decl_column(0x08)
    2461                    $C$DW$186       .dwtag  DW_TAG_member
    2462                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$22)
    2463                            .dwattr $C$DW$186, DW_AT_name("dsect")
    2464                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("dsect")
    2465                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2466                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2467                            .dwattr $C$DW$186, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2468                            .dwattr $C$DW$186, DW_AT_decl_line(0x7b)
    2469                            .dwattr $C$DW$186, DW_AT_decl_column(0x08)
    2470                    $C$DW$187       .dwtag  DW_TAG_member
    2471                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$22)
    2472                            .dwattr $C$DW$187, DW_AT_name("dir_sect")
    2473                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("dir_sect")
    2474                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2475                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2476                            .dwattr $C$DW$187, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2477                            .dwattr $C$DW$187, DW_AT_decl_line(0x7d)
    2478                            .dwattr $C$DW$187, DW_AT_decl_column(0x08)
    2479                    $C$DW$188       .dwtag  DW_TAG_member
    2480                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$27)
TI ARM Assembler PC v5.2.5 Wed Nov 04 18:29:40 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   47

    2481                            .dwattr $C$DW$188, DW_AT_name("dir_ptr")
    2482                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("dir_ptr")
    2483                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2484                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2485                            .dwattr $C$DW$188, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2486                            .dwattr $C$DW$188, DW_AT_decl_line(0x7e)
    2487                            .dwattr $C$DW$188, DW_AT_decl_column(0x08)
    2488                    $C$DW$189       .dwtag  DW_TAG_member
    2489                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$23)
    2490                            .dwattr $C$DW$189, DW_AT_name("buf")
    2491                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("buf")
    2492                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2493                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2494                            .dwattr $C$DW$189, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2495                            .dwattr $C$DW$189, DW_AT_decl_line(0x87)
    2496                            .dwattr $C$DW$189, DW_AT_decl_column(0x07)
    2497                            .dwendtag $C$DW$T$28
    2498                    
    2499                            .dwattr $C$DW$T$28, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2500                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x72)
    2501                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    2502                    $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("FIL")
    2503                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$28)
    2504                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    2505                            .dwattr $C$DW$T$45, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2506                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x89)
    2507                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x03)
    2508                    
    2509                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2510                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x1c)
    2511                    $C$DW$190       .dwtag  DW_TAG_member
    2512                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$26)
    2513                            .dwattr $C$DW$190, DW_AT_name("fs")
    2514                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("fs")
    2515                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2516                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2517                            .dwattr $C$DW$190, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2518                            .dwattr $C$DW$190, DW_AT_decl_line(0x90)
    2519                            .dwattr $C$DW$190, DW_AT_decl_column(0x09)
    2520                    $C$DW$191       .dwtag  DW_TAG_member
    2521                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$21)
    2522                            .dwattr $C$DW$191, DW_AT_name("id")
    2523                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("id")
    2524                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2525                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2526                            .dwattr $C$DW$191, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2527                            .dwattr $C$DW$191, DW_AT_decl_line(0x91)
    2528                            .dwattr $C$DW$191, DW_AT_decl_column(0x07)
    2529                    $C$DW$192       .dwtag  DW_TAG_member
    2530                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$21)
    2531                            .dwattr $C$DW$192, DW_AT_name("index")
    2532                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("index")
    2533                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2534                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2535                            .dwattr $C$DW$192, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
TI ARM Assembler PC v5.2.5 Wed Nov 04 18:29:40 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   48

    2536                            .dwattr $C$DW$192, DW_AT_decl_line(0x92)
    2537                            .dwattr $C$DW$192, DW_AT_decl_column(0x07)
    2538                    $C$DW$193       .dwtag  DW_TAG_member
    2539                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$22)
    2540                            .dwattr $C$DW$193, DW_AT_name("sclust")
    2541                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("sclust")
    2542                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2543                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2544                            .dwattr $C$DW$193, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2545                            .dwattr $C$DW$193, DW_AT_decl_line(0x93)
    2546                            .dwattr $C$DW$193, DW_AT_decl_column(0x08)
    2547                    $C$DW$194       .dwtag  DW_TAG_member
    2548                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$22)
    2549                            .dwattr $C$DW$194, DW_AT_name("clust")
    2550                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("clust")
    2551                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2552                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2553                            .dwattr $C$DW$194, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2554                            .dwattr $C$DW$194, DW_AT_decl_line(0x94)
    2555                            .dwattr $C$DW$194, DW_AT_decl_column(0x08)
    2556                    $C$DW$195       .dwtag  DW_TAG_member
    2557                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$22)
    2558                            .dwattr $C$DW$195, DW_AT_name("sect")
    2559                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("sect")
    2560                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2561                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2562                            .dwattr $C$DW$195, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2563                            .dwattr $C$DW$195, DW_AT_decl_line(0x95)
    2564                            .dwattr $C$DW$195, DW_AT_decl_column(0x08)
    2565                    $C$DW$196       .dwtag  DW_TAG_member
    2566                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$27)
    2567                            .dwattr $C$DW$196, DW_AT_name("dir")
    2568                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("dir")
    2569                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2570                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2571                            .dwattr $C$DW$196, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2572                            .dwattr $C$DW$196, DW_AT_decl_line(0x96)
    2573                            .dwattr $C$DW$196, DW_AT_decl_column(0x08)
    2574                    $C$DW$197       .dwtag  DW_TAG_member
    2575                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$27)
    2576                            .dwattr $C$DW$197, DW_AT_name("fn")
    2577                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("fn")
    2578                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2579                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2580                            .dwattr $C$DW$197, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2581                            .dwattr $C$DW$197, DW_AT_decl_line(0x97)
    2582                            .dwattr $C$DW$197, DW_AT_decl_column(0x08)
    2583                            .dwendtag $C$DW$T$29
    2584                    
    2585                            .dwattr $C$DW$T$29, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2586                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x8f)
    2587                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    2588                    $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("DIR")
    2589                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$29)
    2590                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v5.2.5 Wed Nov 04 18:29:40 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   49

    2591                            .dwattr $C$DW$T$46, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2592                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x9c)
    2593                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x03)
    2594                    
    2595                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2596                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x18)
    2597                    $C$DW$198       .dwtag  DW_TAG_member
    2598                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$22)
    2599                            .dwattr $C$DW$198, DW_AT_name("fsize")
    2600                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("fsize")
    2601                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2602                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2603                            .dwattr $C$DW$198, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2604                            .dwattr $C$DW$198, DW_AT_decl_line(0xa3)
    2605                            .dwattr $C$DW$198, DW_AT_decl_column(0x08)
    2606                    $C$DW$199       .dwtag  DW_TAG_member
    2607                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$21)
    2608                            .dwattr $C$DW$199, DW_AT_name("fdate")
    2609                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("fdate")
    2610                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2611                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2612                            .dwattr $C$DW$199, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2613                            .dwattr $C$DW$199, DW_AT_decl_line(0xa4)
    2614                            .dwattr $C$DW$199, DW_AT_decl_column(0x07)
    2615                    $C$DW$200       .dwtag  DW_TAG_member
    2616                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$21)
    2617                            .dwattr $C$DW$200, DW_AT_name("ftime")
    2618                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("ftime")
    2619                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2620                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2621                            .dwattr $C$DW$200, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2622                            .dwattr $C$DW$200, DW_AT_decl_line(0xa5)
    2623                            .dwattr $C$DW$200, DW_AT_decl_column(0x07)
    2624                    $C$DW$201       .dwtag  DW_TAG_member
    2625                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$20)
    2626                            .dwattr $C$DW$201, DW_AT_name("fattrib")
    2627                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("fattrib")
    2628                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2629                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2630                            .dwattr $C$DW$201, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2631                            .dwattr $C$DW$201, DW_AT_decl_line(0xa6)
    2632                            .dwattr $C$DW$201, DW_AT_decl_column(0x07)
    2633                    $C$DW$202       .dwtag  DW_TAG_member
    2634                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$32)
    2635                            .dwattr $C$DW$202, DW_AT_name("fname")
    2636                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("fname")
    2637                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2638                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2639                            .dwattr $C$DW$202, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2640                            .dwattr $C$DW$202, DW_AT_decl_line(0xa7)
    2641                            .dwattr $C$DW$202, DW_AT_decl_column(0x08)
    2642                            .dwendtag $C$DW$T$33
    2643                    
    2644                            .dwattr $C$DW$T$33, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2645                            .dwattr $C$DW$T$33, DW_AT_decl_line(0xa2)
TI ARM Assembler PC v5.2.5 Wed Nov 04 18:29:40 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   50

    2646                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    2647                    $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("FILINFO")
    2648                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$33)
    2649                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    2650                            .dwattr $C$DW$T$47, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2651                            .dwattr $C$DW$T$47, DW_AT_decl_line(0xac)
    2652                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x03)
    2653                    
    2654                    $C$DW$T$35      .dwtag  DW_TAG_union_type
    2655                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x10)
    2656                    $C$DW$203       .dwtag  DW_TAG_member
    2657                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$34)
    2658                            .dwattr $C$DW$203, DW_AT_name("_Us")
    2659                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("_Us")
    2660                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2661                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2662                            .dwattr $C$DW$203, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2663                            .dwattr $C$DW$203, DW_AT_decl_line(0x3a)
    2664                            .dwattr $C$DW$203, DW_AT_decl_column(0x12)
    2665                    $C$DW$204       .dwtag  DW_TAG_member
    2666                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$16)
    2667                            .dwattr $C$DW$204, DW_AT_name("_Float")
    2668                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("_Float")
    2669                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2670                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2671                            .dwattr $C$DW$204, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2672                            .dwattr $C$DW$204, DW_AT_decl_line(0x3b)
    2673                            .dwattr $C$DW$204, DW_AT_decl_column(0x09)
    2674                    $C$DW$205       .dwtag  DW_TAG_member
    2675                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$17)
    2676                            .dwattr $C$DW$205, DW_AT_name("_Double")
    2677                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("_Double")
    2678                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2679                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2680                            .dwattr $C$DW$205, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2681                            .dwattr $C$DW$205, DW_AT_decl_line(0x3c)
    2682                            .dwattr $C$DW$205, DW_AT_decl_column(0x0a)
    2683                    $C$DW$206       .dwtag  DW_TAG_member
    2684                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$18)
    2685                            .dwattr $C$DW$206, DW_AT_name("_Long_double")
    2686                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("_Long_double")
    2687                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2688                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2689                            .dwattr $C$DW$206, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2690                            .dwattr $C$DW$206, DW_AT_decl_line(0x3d)
    2691                            .dwattr $C$DW$206, DW_AT_decl_column(0x0f)
    2692                            .dwendtag $C$DW$T$35
    2693                    
    2694                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float
    2695                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x39)
    2696                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x03)
    2697                    
    2698                    $C$DW$T$36      .dwtag  DW_TAG_union_type
    2699                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x10)
    2700                    $C$DW$207       .dwtag  DW_TAG_member
TI ARM Assembler PC v5.2.5 Wed Nov 04 18:29:40 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   51

    2701                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$34)
    2702                            .dwattr $C$DW$207, DW_AT_name("_Word")
    2703                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("_Word")
    2704                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2705                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2706                            .dwattr $C$DW$207, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath.
    2707                            .dwattr $C$DW$207, DW_AT_decl_line(0x8f)
    2708                            .dwattr $C$DW$207, DW_AT_decl_column(0x11)
    2709                    $C$DW$208       .dwtag  DW_TAG_member
    2710                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$16)
    2711                            .dwattr $C$DW$208, DW_AT_name("_Float")
    2712                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("_Float")
    2713                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2714                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2715                            .dwattr $C$DW$208, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath.
    2716                            .dwattr $C$DW$208, DW_AT_decl_line(0x90)
    2717                            .dwattr $C$DW$208, DW_AT_decl_column(0x08)
    2718                    $C$DW$209       .dwtag  DW_TAG_member
    2719                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$17)
    2720                            .dwattr $C$DW$209, DW_AT_name("_Double")
    2721                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("_Double")
    2722                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2723                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2724                            .dwattr $C$DW$209, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath.
    2725                            .dwattr $C$DW$209, DW_AT_decl_line(0x91)
    2726                            .dwattr $C$DW$209, DW_AT_decl_column(0x09)
    2727                    $C$DW$210       .dwtag  DW_TAG_member
    2728                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$18)
    2729                            .dwattr $C$DW$210, DW_AT_name("_Long_double")
    2730                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("_Long_double")
    2731                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2732                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2733                            .dwattr $C$DW$210, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath.
    2734                            .dwattr $C$DW$210, DW_AT_decl_line(0x92)
    2735                            .dwattr $C$DW$210, DW_AT_decl_column(0x0e)
    2736                            .dwendtag $C$DW$T$36
    2737                    
    2738                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath
    2739                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x8e)
    2740                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x02)
    2741                    $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("_Dconst")
    2742                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$36)
    2743                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    2744                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath
    2745                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x93)
    2746                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x04)
    2747                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2748                            .dwattr $C$DW$T$2, DW_AT_name("void")
    2749                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2750                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2751                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2752                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    2753                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2754                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    2755                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
TI ARM Assembler PC v5.2.5 Wed Nov 04 18:29:40 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   52

    2756                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    2757                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2758                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2759                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2760                    $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    2761                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$5)
    2762                            .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    2763                            .dwattr $C$DW$T$67, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2764                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x2a)
    2765                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x1d)
    2766                    $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
    2767                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    2768                            .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    2769                            .dwattr $C$DW$T$68, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2770                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x37)
    2771                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x17)
    2772                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    2773                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2774                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2775                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2776                    $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("BYTE")
    2777                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$6)
    2778                            .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    2779                            .dwattr $C$DW$T$20, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2780                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x16)
    2781                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x17)
    2782                    $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("DSTATUS")
    2783                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$20)
    2784                            .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    2785                            .dwattr $C$DW$T$69, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2786                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x13)
    2787                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x0e)
    2788                    
    2789                    $C$DW$T$23      .dwtag  DW_TAG_array_type
    2790                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$20)
    2791                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    2792                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x200)
    2793                    $C$DW$211       .dwtag  DW_TAG_subrange_type
    2794                            .dwattr $C$DW$211, DW_AT_upper_bound(0x1ff)
    2795                            .dwendtag $C$DW$T$23
    2796                    
    2797                    $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    2798                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$20)
    2799                            .dwattr $C$DW$T$27, DW_AT_address_class(0x20)
    2800                    $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("UCHAR")
    2801                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$6)
    2802                            .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    2803                            .dwattr $C$DW$T$70, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2804                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x15)
    2805                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x17)
    2806                    $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    2807                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$6)
    2808                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    2809                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2810                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x2b)
TI ARM Assembler PC v5.2.5 Wed Nov 04 18:29:40 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   53

    2811                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x1c)
    2812                    $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
    2813                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$50)
    2814                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    2815                            .dwattr $C$DW$T$73, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2816                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x38)
    2817                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x16)
    2818                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    2819                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2820                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2821                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    2822                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    2823                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2824                            .dwattr $C$DW$T$8, DW_AT_name("short")
    2825                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    2826                    $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("SHORT")
    2827                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$8)
    2828                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    2829                            .dwattr $C$DW$T$74, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2830                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x19)
    2831                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x11)
    2832                    $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
    2833                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$8)
    2834                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2835                            .dwattr $C$DW$T$75, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2836                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x2c)
    2837                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x1d)
    2838                    $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
    2839                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    2840                            .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    2841                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2842                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x3a)
    2843                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x17)
    2844                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    2845                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2846                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2847                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    2848                    $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("USHORT")
    2849                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$9)
    2850                            .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    2851                            .dwattr $C$DW$T$77, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2852                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x1a)
    2853                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x18)
    2854                    $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("WCHAR")
    2855                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$9)
    2856                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    2857                            .dwattr $C$DW$T$78, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2858                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x1c)
    2859                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x18)
    2860                    $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("WORD")
    2861                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$9)
    2862                            .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    2863                            .dwattr $C$DW$T$21, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2864                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x1b)
    2865                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x18)
TI ARM Assembler PC v5.2.5 Wed Nov 04 18:29:40 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   54

    2866                    $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("_Wchart")
    2867                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$9)
    2868                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    2869                            .dwattr $C$DW$T$79, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yvals
    2870                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x1e5)
    2871                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x21)
    2872                    $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("_Wintt")
    2873                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$9)
    2874                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    2875                            .dwattr $C$DW$T$80, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yvals
    2876                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x1e6)
    2877                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x21)
    2878                    
    2879                    $C$DW$T$34      .dwtag  DW_TAG_array_type
    2880                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$9)
    2881                            .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    2882                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x10)
    2883                    $C$DW$212       .dwtag  DW_TAG_subrange_type
    2884                            .dwattr $C$DW$212, DW_AT_upper_bound(0x07)
    2885                            .dwendtag $C$DW$T$34
    2886                    
    2887                    $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    2888                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$9)
    2889                            .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    2890                            .dwattr $C$DW$T$81, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2891                            .dwattr $C$DW$T$81, DW_AT_decl_line(0x2d)
    2892                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x1c)
    2893                    $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
    2894                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    2895                            .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    2896                            .dwattr $C$DW$T$82, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2897                            .dwattr $C$DW$T$82, DW_AT_decl_line(0x3b)
    2898                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x16)
    2899                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    2900                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2901                            .dwattr $C$DW$T$10, DW_AT_name("int")
    2902                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    2903                    $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("INT")
    2904                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$10)
    2905                            .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    2906                            .dwattr $C$DW$T$83, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2907                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x10)
    2908                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x10)
    2909                    $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("_Ptrdifft")
    2910                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$10)
    2911                            .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    2912                            .dwattr $C$DW$T$84, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yvals
    2913                            .dwattr $C$DW$T$84, DW_AT_decl_line(0xa9)
    2914                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x1e)
    2915                    $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
    2916                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$10)
    2917                            .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    2918                            .dwattr $C$DW$T$86, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2919                            .dwattr $C$DW$T$86, DW_AT_decl_line(0x2e)
    2920                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x1d)
TI ARM Assembler PC v5.2.5 Wed Nov 04 18:29:40 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   55

    2921                    $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast16_t")
    2922                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    2923                            .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    2924                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2925                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x47)
    2926                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x17)
    2927                    $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast32_t")
    2928                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$86)
    2929                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    2930                            .dwattr $C$DW$T$88, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2931                            .dwattr $C$DW$T$88, DW_AT_decl_line(0x4a)
    2932                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x17)
    2933                    $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast8_t")
    2934                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$86)
    2935                            .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    2936                            .dwattr $C$DW$T$89, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2937                            .dwattr $C$DW$T$89, DW_AT_decl_line(0x45)
    2938                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x17)
    2939                    $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("int_least32_t")
    2940                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$86)
    2941                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    2942                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2943                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x3c)
    2944                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x17)
    2945                    $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("intptr_t")
    2946                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$10)
    2947                            .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    2948                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2949                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x52)
    2950                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x1a)
    2951                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    2952                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2953                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    2954                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    2955                    $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("UINT")
    2956                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$11)
    2957                            .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    2958                            .dwattr $C$DW$T$92, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2959                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x11)
    2960                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x16)
    2961                    $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("_Sizet")
    2962                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$11)
    2963                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    2964                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yvals
    2965                            .dwattr $C$DW$T$93, DW_AT_decl_line(0xab)
    2966                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x1a)
    2967                    $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("_TI_uint32_t")
    2968                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$11)
    2969                            .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    2970                            .dwattr $C$DW$T$94, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath
    2971                            .dwattr $C$DW$T$94, DW_AT_decl_line(0xb6)
    2972                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x19)
    2973                    $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
    2974                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$11)
    2975                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v5.2.5 Wed Nov 04 18:29:40 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   56

    2976                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2977                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x2f)
    2978                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x1c)
    2979                    $C$DW$T$100     .dwtag  DW_TAG_volatile_type
    2980                            .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$49)
    2981                    $C$DW$T$101     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast16_t")
    2982                            .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$49)
    2983                            .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    2984                            .dwattr $C$DW$T$101, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    2985                            .dwattr $C$DW$T$101, DW_AT_decl_line(0x48)
    2986                            .dwattr $C$DW$T$101, DW_AT_decl_column(0x16)
    2987                    $C$DW$T$102     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast32_t")
    2988                            .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$49)
    2989                            .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    2990                            .dwattr $C$DW$T$102, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    2991                            .dwattr $C$DW$T$102, DW_AT_decl_line(0x4b)
    2992                            .dwattr $C$DW$T$102, DW_AT_decl_column(0x16)
    2993                    $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast8_t")
    2994                            .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$49)
    2995                            .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    2996                            .dwattr $C$DW$T$103, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    2997                            .dwattr $C$DW$T$103, DW_AT_decl_line(0x46)
    2998                            .dwattr $C$DW$T$103, DW_AT_decl_column(0x16)
    2999                    $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least32_t")
    3000                            .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$49)
    3001                            .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    3002                            .dwattr $C$DW$T$104, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3003                            .dwattr $C$DW$T$104, DW_AT_decl_line(0x3d)
    3004                            .dwattr $C$DW$T$104, DW_AT_decl_column(0x16)
    3005                    $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("uintptr_t")
    3006                            .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$11)
    3007                            .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    3008                            .dwattr $C$DW$T$105, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3009                            .dwattr $C$DW$T$105, DW_AT_decl_line(0x53)
    3010                            .dwattr $C$DW$T$105, DW_AT_decl_column(0x1a)
    3011                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    3012                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    3013                            .dwattr $C$DW$T$12, DW_AT_name("long")
    3014                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    3015                    $C$DW$T$106     .dwtag  DW_TAG_typedef, DW_AT_name("LONG")
    3016                            .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$12)
    3017                            .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    3018                            .dwattr $C$DW$T$106, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    3019                            .dwattr $C$DW$T$106, DW_AT_decl_line(0x1f)
    3020                            .dwattr $C$DW$T$106, DW_AT_decl_column(0x10)
    3021                    $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("_Int32t")
    3022                            .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$12)
    3023                            .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    3024                            .dwattr $C$DW$T$107, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yval
    3025                            .dwattr $C$DW$T$107, DW_AT_decl_line(0xa6)
    3026                            .dwattr $C$DW$T$107, DW_AT_decl_column(0x0e)
    3027                    $C$DW$T$13      .dwtag  DW_TAG_base_type
    3028                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    3029                            .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    3030                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
TI ARM Assembler PC v5.2.5 Wed Nov 04 18:29:40 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   57

    3031                    $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("DWORD")
    3032                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$13)
    3033                            .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    3034                            .dwattr $C$DW$T$22, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    3035                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x21)
    3036                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x17)
    3037                    $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("ULONG")
    3038                            .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$13)
    3039                            .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
    3040                            .dwattr $C$DW$T$108, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    3041                            .dwattr $C$DW$T$108, DW_AT_decl_line(0x20)
    3042                            .dwattr $C$DW$T$108, DW_AT_decl_column(0x17)
    3043                    $C$DW$T$109     .dwtag  DW_TAG_typedef, DW_AT_name("_Uint32t")
    3044                            .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$13)
    3045                            .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    3046                            .dwattr $C$DW$T$109, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yval
    3047                            .dwattr $C$DW$T$109, DW_AT_decl_line(0xa7)
    3048                            .dwattr $C$DW$T$109, DW_AT_decl_column(0x17)
    3049                    $C$DW$T$14      .dwtag  DW_TAG_base_type
    3050                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    3051                            .dwattr $C$DW$T$14, DW_AT_name("long long")
    3052                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    3053                    $C$DW$T$110     .dwtag  DW_TAG_typedef, DW_AT_name("_Longlong")
    3054                            .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$14)
    3055                            .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    3056                            .dwattr $C$DW$T$110, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yval
    3057                            .dwattr $C$DW$T$110, DW_AT_decl_line(0x1b5)
    3058                            .dwattr $C$DW$T$110, DW_AT_decl_column(0x13)
    3059                    $C$DW$T$111     .dwtag  DW_TAG_typedef, DW_AT_name("int64_t")
    3060                            .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$14)
    3061                            .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
    3062                            .dwattr $C$DW$T$111, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3063                            .dwattr $C$DW$T$111, DW_AT_decl_line(0x32)
    3064                            .dwattr $C$DW$T$111, DW_AT_decl_column(0x21)
    3065                    $C$DW$T$112     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast64_t")
    3066                            .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$111)
    3067                            .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    3068                            .dwattr $C$DW$T$112, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3069                            .dwattr $C$DW$T$112, DW_AT_decl_line(0x4e)
    3070                            .dwattr $C$DW$T$112, DW_AT_decl_column(0x17)
    3071                    $C$DW$T$113     .dwtag  DW_TAG_typedef, DW_AT_name("int_least64_t")
    3072                            .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$111)
    3073                            .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    3074                            .dwattr $C$DW$T$113, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3075                            .dwattr $C$DW$T$113, DW_AT_decl_line(0x40)
    3076                            .dwattr $C$DW$T$113, DW_AT_decl_column(0x17)
    3077                    $C$DW$T$114     .dwtag  DW_TAG_typedef, DW_AT_name("intmax_t")
    3078                            .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$14)
    3079                            .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    3080                            .dwattr $C$DW$T$114, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3081                            .dwattr $C$DW$T$114, DW_AT_decl_line(0x56)
    3082                            .dwattr $C$DW$T$114, DW_AT_decl_column(0x20)
    3083                    $C$DW$T$15      .dwtag  DW_TAG_base_type
    3084                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    3085                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
TI ARM Assembler PC v5.2.5 Wed Nov 04 18:29:40 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   58

    3086                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    3087                    $C$DW$T$115     .dwtag  DW_TAG_typedef, DW_AT_name("_TI_uint64_t")
    3088                            .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$15)
    3089                            .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
    3090                            .dwattr $C$DW$T$115, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymat
    3091                            .dwattr $C$DW$T$115, DW_AT_decl_line(0xbc)
    3092                            .dwattr $C$DW$T$115, DW_AT_decl_column(0x1c)
    3093                    $C$DW$T$116     .dwtag  DW_TAG_typedef, DW_AT_name("_ULonglong")
    3094                            .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$15)
    3095                            .dwattr $C$DW$T$116, DW_AT_language(DW_LANG_C)
    3096                            .dwattr $C$DW$T$116, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yval
    3097                            .dwattr $C$DW$T$116, DW_AT_decl_line(0x1b6)
    3098                            .dwattr $C$DW$T$116, DW_AT_decl_column(0x14)
    3099                    $C$DW$T$117     .dwtag  DW_TAG_typedef, DW_AT_name("uint64_t")
    3100                            .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$15)
    3101                            .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
    3102                            .dwattr $C$DW$T$117, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3103                            .dwattr $C$DW$T$117, DW_AT_decl_line(0x33)
    3104                            .dwattr $C$DW$T$117, DW_AT_decl_column(0x20)
    3105                    $C$DW$T$118     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast64_t")
    3106                            .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$117)
    3107                            .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
    3108                            .dwattr $C$DW$T$118, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3109                            .dwattr $C$DW$T$118, DW_AT_decl_line(0x4f)
    3110                            .dwattr $C$DW$T$118, DW_AT_decl_column(0x16)
    3111                    $C$DW$T$119     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least64_t")
    3112                            .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$117)
    3113                            .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    3114                            .dwattr $C$DW$T$119, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3115                            .dwattr $C$DW$T$119, DW_AT_decl_line(0x41)
    3116                            .dwattr $C$DW$T$119, DW_AT_decl_column(0x16)
    3117                    $C$DW$T$120     .dwtag  DW_TAG_typedef, DW_AT_name("uintmax_t")
    3118                            .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$15)
    3119                            .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    3120                            .dwattr $C$DW$T$120, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3121                            .dwattr $C$DW$T$120, DW_AT_decl_line(0x57)
    3122                            .dwattr $C$DW$T$120, DW_AT_decl_column(0x20)
    3123                    $C$DW$T$16      .dwtag  DW_TAG_base_type
    3124                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    3125                            .dwattr $C$DW$T$16, DW_AT_name("float")
    3126                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    3127                    $C$DW$T$123     .dwtag  DW_TAG_typedef, DW_AT_name("float_t")
    3128                            .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$16)
