TI ARM Assembler PC v5.2.6 Thu Apr 28 10:43:48 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                             PC v5.2.6 *
       3                    ;* Date/Time created: Thu Apr 28 10:43:48 2016                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --disab
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../timers.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.2.6 Copyright (c) 1996-2015 Te
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Deian\Dev\TI\workspace6\LaunchpadRoomControl\timers\Debug
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("memset")

    2283                            .dwattr $C$DW$164, DW_AT_decl_column(0x02)
    2284                    $C$DW$165       .dwtag  DW_TAG_enumerator, DW_AT_name("FR_NOT_ENOUGH_CORE"), DW_AT_const_value(0x11)
    2285                            .dwattr $C$DW$165, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2286                            .dwattr $C$DW$165, DW_AT_decl_line(0xc4)
    2287                            .dwattr $C$DW$165, DW_AT_decl_column(0x02)
    2288                    $C$DW$166       .dwtag  DW_TAG_enumerator, DW_AT_name("FR_TOO_MANY_OPEN_FILES"), DW_AT_const_value(0x1
    2289                            .dwattr $C$DW$166, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2290                            .dwattr $C$DW$166, DW_AT_decl_line(0xc5)
    2291                            .dwattr $C$DW$166, DW_AT_decl_column(0x02)
    2292                    $C$DW$167       .dwtag  DW_TAG_enumerator, DW_AT_name("FR_INVALID_PARAMETER"), DW_AT_const_value(0x13)
    2293                            .dwattr $C$DW$167, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2294                            .dwattr $C$DW$167, DW_AT_decl_line(0xc6)
    2295                            .dwattr $C$DW$167, DW_AT_decl_column(0x02)
    2296                            .dwendtag $C$DW$T$43
    2297                    
    2298                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2299                            .dwattr $C$DW$T$43, DW_AT_decl_line(0xb2)
    2300                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x0e)
    2301                    $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("FRESULT")
    2302                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
TI ARM Assembler PC v5.2.6 Thu Apr 28 10:43:48 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   44

    2303                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    2304                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2305                            .dwattr $C$DW$T$44, DW_AT_decl_line(0xc7)
    2306                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x03)
    2307                    
    2308                    $C$DW$T$45      .dwtag  DW_TAG_enumeration_type
    2309                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    2310                    $C$DW$168       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_OK"), DW_AT_const_value(0x00)
    2311                            .dwattr $C$DW$168, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/diskio.h")
    2312                            .dwattr $C$DW$168, DW_AT_decl_line(0x17)
    2313                            .dwattr $C$DW$168, DW_AT_decl_column(0x02)
    2314                    $C$DW$169       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_ERROR"), DW_AT_const_value(0x01)
    2315                            .dwattr $C$DW$169, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/diskio.h")
    2316                            .dwattr $C$DW$169, DW_AT_decl_line(0x18)
    2317                            .dwattr $C$DW$169, DW_AT_decl_column(0x02)
    2318                    $C$DW$170       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_WRPRT"), DW_AT_const_value(0x02)
    2319                            .dwattr $C$DW$170, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/diskio.h")
    2320                            .dwattr $C$DW$170, DW_AT_decl_line(0x19)
    2321                            .dwattr $C$DW$170, DW_AT_decl_column(0x02)
    2322                    $C$DW$171       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_NOTRDY"), DW_AT_const_value(0x03)
    2323                            .dwattr $C$DW$171, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/diskio.h")
    2324                            .dwattr $C$DW$171, DW_AT_decl_line(0x1a)
    2325                            .dwattr $C$DW$171, DW_AT_decl_column(0x02)
    2326                    $C$DW$172       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_PARERR"), DW_AT_const_value(0x04)
    2327                            .dwattr $C$DW$172, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/diskio.h")
    2328                            .dwattr $C$DW$172, DW_AT_decl_line(0x1b)
    2329                            .dwattr $C$DW$172, DW_AT_decl_column(0x02)
    2330                            .dwendtag $C$DW$T$45
    2331                    
    2332                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/diskio.h")
    2333                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x16)
    2334                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x0e)
    2335                    $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("DRESULT")
    2336                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    2337                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    2338                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/diskio.h")
    2339                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x1c)
    2340                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x03)
    2341                    
    2342                    $C$DW$T$19      .dwtag  DW_TAG_structure_type
    2343                            .dwattr $C$DW$T$19, DW_AT_byte_size(0x48)
    2344                    $C$DW$173       .dwtag  DW_TAG_member
    2345                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$10)
    2346                            .dwattr $C$DW$173, DW_AT_name("_Ddig")
    2347                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("_Ddig")
    2348                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2349                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2350                            .dwattr $C$DW$173, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/float.
    2351                            .dwattr $C$DW$173, DW_AT_decl_line(0x37)
    2352                            .dwattr $C$DW$173, DW_AT_decl_column(0x06)
    2353                    $C$DW$174       .dwtag  DW_TAG_member
    2354                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$10)
    2355                            .dwattr $C$DW$174, DW_AT_name("_Dmdig")
    2356                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("_Dmdig")
    2357                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TI ARM Assembler PC v5.2.6 Thu Apr 28 10:43:48 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   45

    2358                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2359                            .dwattr $C$DW$174, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/float.
    2360                            .dwattr $C$DW$174, DW_AT_decl_line(0x37)
    2361                            .dwattr $C$DW$174, DW_AT_decl_column(0x0d)
    2362                    $C$DW$175       .dwtag  DW_TAG_member
    2363                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$10)
    2364                            .dwattr $C$DW$175, DW_AT_name("_Dmax10e")
    2365                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("_Dmax10e")
    2366                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2367                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2368                            .dwattr $C$DW$175, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/float.
    2369                            .dwattr $C$DW$175, DW_AT_decl_line(0x37)
    2370                            .dwattr $C$DW$175, DW_AT_decl_column(0x15)
    2371                    $C$DW$176       .dwtag  DW_TAG_member
    2372                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$10)
    2373                            .dwattr $C$DW$176, DW_AT_name("_Dmaxe")
    2374                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("_Dmaxe")
    2375                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2376                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2377                            .dwattr $C$DW$176, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/float.
    2378                            .dwattr $C$DW$176, DW_AT_decl_line(0x37)
    2379                            .dwattr $C$DW$176, DW_AT_decl_column(0x1f)
    2380                    $C$DW$177       .dwtag  DW_TAG_member
    2381                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$10)
    2382                            .dwattr $C$DW$177, DW_AT_name("_Dmin10e")
    2383                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("_Dmin10e")
    2384                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2385                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2386                            .dwattr $C$DW$177, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/float.
    2387                            .dwattr $C$DW$177, DW_AT_decl_line(0x37)
    2388                            .dwattr $C$DW$177, DW_AT_decl_column(0x27)
    2389                    $C$DW$178       .dwtag  DW_TAG_member
    2390                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$10)
    2391                            .dwattr $C$DW$178, DW_AT_name("_Dmine")
    2392                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("_Dmine")
    2393                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2394                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2395                            .dwattr $C$DW$178, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/float.
    2396                            .dwattr $C$DW$178, DW_AT_decl_line(0x37)
    2397                            .dwattr $C$DW$178, DW_AT_decl_column(0x31)
    2398                    $C$DW$179       .dwtag  DW_TAG_member
    2399                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$37)
    2400                            .dwattr $C$DW$179, DW_AT_name("_Deps")
    2401                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("_Deps")
    2402                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2403                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2404                            .dwattr $C$DW$179, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/float.
    2405                            .dwattr $C$DW$179, DW_AT_decl_line(0x3e)
    2406                            .dwattr $C$DW$179, DW_AT_decl_column(0x05)
    2407                    $C$DW$180       .dwtag  DW_TAG_member
    2408                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$37)
    2409                            .dwattr $C$DW$180, DW_AT_name("_Dmax")
    2410                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("_Dmax")
    2411                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2412                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v5.2.6 Thu Apr 28 10:43:48 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   46

    2413                            .dwattr $C$DW$180, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/float.
    2414                            .dwattr $C$DW$180, DW_AT_decl_line(0x3e)
    2415                            .dwattr $C$DW$180, DW_AT_decl_column(0x0c)
    2416                    $C$DW$181       .dwtag  DW_TAG_member
    2417                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$37)
    2418                            .dwattr $C$DW$181, DW_AT_name("_Dmin")
    2419                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("_Dmin")
    2420                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2421                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2422                            .dwattr $C$DW$181, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/float.
    2423                            .dwattr $C$DW$181, DW_AT_decl_line(0x3e)
    2424                            .dwattr $C$DW$181, DW_AT_decl_column(0x13)
    2425                            .dwendtag $C$DW$T$19
    2426                    
    2427                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/float
    2428                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x36)
    2429                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x02)
    2430                    $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("_Dvals")
    2431                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$19)
    2432                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    2433                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/float
    2434                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x3f)
    2435                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x04)
    2436                    
    2437                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2438                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    2439                    $C$DW$182       .dwtag  DW_TAG_member
    2440                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$8)
    2441                            .dwattr $C$DW$182, DW_AT_name("daylight")
    2442                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("daylight")
    2443                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2444                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2445                            .dwattr $C$DW$182, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/time.h
    2446                            .dwattr $C$DW$182, DW_AT_decl_line(0x6d)
    2447                            .dwattr $C$DW$182, DW_AT_decl_column(0x0b)
    2448                    $C$DW$183       .dwtag  DW_TAG_member
    2449                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$12)
    2450                            .dwattr $C$DW$183, DW_AT_name("timezone")
    2451                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("timezone")
    2452                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2453                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2454                            .dwattr $C$DW$183, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/time.h
    2455                            .dwattr $C$DW$183, DW_AT_decl_line(0x6e)
    2456                            .dwattr $C$DW$183, DW_AT_decl_column(0x0b)
    2457                    $C$DW$184       .dwtag  DW_TAG_member
    2458                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$21)
    2459                            .dwattr $C$DW$184, DW_AT_name("tzname")
    2460                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("tzname")
    2461                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2462                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2463                            .dwattr $C$DW$184, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/time.h
    2464                            .dwattr $C$DW$184, DW_AT_decl_line(0x6f)
    2465                            .dwattr $C$DW$184, DW_AT_decl_column(0x0b)
    2466                    $C$DW$185       .dwtag  DW_TAG_member
    2467                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$21)
TI ARM Assembler PC v5.2.6 Thu Apr 28 10:43:48 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   47

    2468                            .dwattr $C$DW$185, DW_AT_name("dstname")
    2469                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("dstname")
    2470                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2471                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2472                            .dwattr $C$DW$185, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/time.h
    2473                            .dwattr $C$DW$185, DW_AT_decl_line(0x70)
    2474                            .dwattr $C$DW$185, DW_AT_decl_column(0x0b)
    2475                            .dwendtag $C$DW$T$22
    2476                    
    2477                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/time.
    2478                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x6c)
    2479                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x01)
    2480                    $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("TZ")
    2481                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$22)
    2482                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    2483                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/time.
    2484                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x71)
    2485                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x03)
    2486                    
    2487                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2488                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x234)
    2489                    $C$DW$186       .dwtag  DW_TAG_member
    2490                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$23)
    2491                            .dwattr $C$DW$186, DW_AT_name("fs_type")
    2492                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("fs_type")
    2493                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2494                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2495                            .dwattr $C$DW$186, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2496                            .dwattr $C$DW$186, DW_AT_decl_line(0x4e)
    2497                            .dwattr $C$DW$186, DW_AT_decl_column(0x07)
    2498                    $C$DW$187       .dwtag  DW_TAG_member
    2499                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$23)
    2500                            .dwattr $C$DW$187, DW_AT_name("drv")
    2501                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("drv")
    2502                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2503                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2504                            .dwattr $C$DW$187, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2505                            .dwattr $C$DW$187, DW_AT_decl_line(0x4f)
    2506                            .dwattr $C$DW$187, DW_AT_decl_column(0x07)
    2507                    $C$DW$188       .dwtag  DW_TAG_member
    2508                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$23)
    2509                            .dwattr $C$DW$188, DW_AT_name("csize")
    2510                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("csize")
    2511                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2512                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2513                            .dwattr $C$DW$188, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2514                            .dwattr $C$DW$188, DW_AT_decl_line(0x50)
    2515                            .dwattr $C$DW$188, DW_AT_decl_column(0x07)
    2516                    $C$DW$189       .dwtag  DW_TAG_member
    2517                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$23)
    2518                            .dwattr $C$DW$189, DW_AT_name("n_fats")
    2519                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("n_fats")
    2520                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2521                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2522                            .dwattr $C$DW$189, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
TI ARM Assembler PC v5.2.6 Thu Apr 28 10:43:48 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   48

    2523                            .dwattr $C$DW$189, DW_AT_decl_line(0x51)
    2524                            .dwattr $C$DW$189, DW_AT_decl_column(0x07)
    2525                    $C$DW$190       .dwtag  DW_TAG_member
    2526                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$23)
    2527                            .dwattr $C$DW$190, DW_AT_name("wflag")
    2528                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("wflag")
    2529                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2530                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2531                            .dwattr $C$DW$190, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2532                            .dwattr $C$DW$190, DW_AT_decl_line(0x52)
    2533                            .dwattr $C$DW$190, DW_AT_decl_column(0x07)
    2534                    $C$DW$191       .dwtag  DW_TAG_member
    2535                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$23)
    2536                            .dwattr $C$DW$191, DW_AT_name("fsi_flag")
    2537                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("fsi_flag")
    2538                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2539                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2540                            .dwattr $C$DW$191, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2541                            .dwattr $C$DW$191, DW_AT_decl_line(0x53)
    2542                            .dwattr $C$DW$191, DW_AT_decl_column(0x07)
    2543                    $C$DW$192       .dwtag  DW_TAG_member
    2544                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$24)
    2545                            .dwattr $C$DW$192, DW_AT_name("id")
    2546                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("id")
    2547                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2548                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2549                            .dwattr $C$DW$192, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2550                            .dwattr $C$DW$192, DW_AT_decl_line(0x54)
    2551                            .dwattr $C$DW$192, DW_AT_decl_column(0x07)
    2552                    $C$DW$193       .dwtag  DW_TAG_member
    2553                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$24)
    2554                            .dwattr $C$DW$193, DW_AT_name("n_rootdir")
    2555                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("n_rootdir")
    2556                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2557                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2558                            .dwattr $C$DW$193, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2559                            .dwattr $C$DW$193, DW_AT_decl_line(0x55)
    2560                            .dwattr $C$DW$193, DW_AT_decl_column(0x07)
    2561                    $C$DW$194       .dwtag  DW_TAG_member
    2562                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$25)
    2563                            .dwattr $C$DW$194, DW_AT_name("last_clust")
    2564                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("last_clust")
    2565                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2566                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2567                            .dwattr $C$DW$194, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2568                            .dwattr $C$DW$194, DW_AT_decl_line(0x5d)
    2569                            .dwattr $C$DW$194, DW_AT_decl_column(0x08)
    2570                    $C$DW$195       .dwtag  DW_TAG_member
    2571                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$25)
    2572                            .dwattr $C$DW$195, DW_AT_name("free_clust")
    2573                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("free_clust")
    2574                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2575                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2576                            .dwattr $C$DW$195, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2577                            .dwattr $C$DW$195, DW_AT_decl_line(0x5e)
TI ARM Assembler PC v5.2.6 Thu Apr 28 10:43:48 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   49

    2578                            .dwattr $C$DW$195, DW_AT_decl_column(0x08)
    2579                    $C$DW$196       .dwtag  DW_TAG_member
    2580                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$25)
    2581                            .dwattr $C$DW$196, DW_AT_name("fsi_sector")
    2582                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("fsi_sector")
    2583                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2584                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2585                            .dwattr $C$DW$196, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2586                            .dwattr $C$DW$196, DW_AT_decl_line(0x5f)
    2587                            .dwattr $C$DW$196, DW_AT_decl_column(0x08)
    2588                    $C$DW$197       .dwtag  DW_TAG_member
    2589                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$25)
    2590                            .dwattr $C$DW$197, DW_AT_name("n_fatent")
    2591                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("n_fatent")
    2592                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2593                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2594                            .dwattr $C$DW$197, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2595                            .dwattr $C$DW$197, DW_AT_decl_line(0x64)
    2596                            .dwattr $C$DW$197, DW_AT_decl_column(0x08)
    2597                    $C$DW$198       .dwtag  DW_TAG_member
    2598                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$25)
    2599                            .dwattr $C$DW$198, DW_AT_name("fsize")
    2600                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("fsize")
    2601                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2602                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2603                            .dwattr $C$DW$198, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2604                            .dwattr $C$DW$198, DW_AT_decl_line(0x65)
    2605                            .dwattr $C$DW$198, DW_AT_decl_column(0x08)
    2606                    $C$DW$199       .dwtag  DW_TAG_member
    2607                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$25)
    2608                            .dwattr $C$DW$199, DW_AT_name("volbase")
    2609                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("volbase")
    2610                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2611                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2612                            .dwattr $C$DW$199, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2613                            .dwattr $C$DW$199, DW_AT_decl_line(0x66)
    2614                            .dwattr $C$DW$199, DW_AT_decl_column(0x08)
    2615                    $C$DW$200       .dwtag  DW_TAG_member
    2616                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$25)
    2617                            .dwattr $C$DW$200, DW_AT_name("fatbase")
    2618                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("fatbase")
    2619                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2620                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2621                            .dwattr $C$DW$200, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2622                            .dwattr $C$DW$200, DW_AT_decl_line(0x67)
    2623                            .dwattr $C$DW$200, DW_AT_decl_column(0x08)
    2624                    $C$DW$201       .dwtag  DW_TAG_member
    2625                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$25)
    2626                            .dwattr $C$DW$201, DW_AT_name("dirbase")
    2627                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("dirbase")
    2628                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2629                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2630                            .dwattr $C$DW$201, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2631                            .dwattr $C$DW$201, DW_AT_decl_line(0x68)
    2632                            .dwattr $C$DW$201, DW_AT_decl_column(0x08)
TI ARM Assembler PC v5.2.6 Thu Apr 28 10:43:48 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   50

    2633                    $C$DW$202       .dwtag  DW_TAG_member
    2634                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$25)
    2635                            .dwattr $C$DW$202, DW_AT_name("database")
    2636                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("database")
    2637                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2638                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2639                            .dwattr $C$DW$202, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2640                            .dwattr $C$DW$202, DW_AT_decl_line(0x69)
    2641                            .dwattr $C$DW$202, DW_AT_decl_column(0x08)
    2642                    $C$DW$203       .dwtag  DW_TAG_member
    2643                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$25)
    2644                            .dwattr $C$DW$203, DW_AT_name("winsect")
    2645                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("winsect")
    2646                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2647                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2648                            .dwattr $C$DW$203, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2649                            .dwattr $C$DW$203, DW_AT_decl_line(0x6a)
    2650                            .dwattr $C$DW$203, DW_AT_decl_column(0x08)
    2651                    $C$DW$204       .dwtag  DW_TAG_member
    2652                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$26)
    2653                            .dwattr $C$DW$204, DW_AT_name("win")
    2654                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("win")
    2655                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2656                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2657                            .dwattr $C$DW$204, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2658                            .dwattr $C$DW$204, DW_AT_decl_line(0x6b)
    2659                            .dwattr $C$DW$204, DW_AT_decl_column(0x07)
    2660                            .dwendtag $C$DW$T$27
    2661                    
    2662                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2663                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x4d)
    2664                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    2665                    $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("FATFS")
    2666                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    2667                            .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    2668                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2669                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x6c)
    2670                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x03)
    2671                    $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    2672                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    2673                            .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
    2674                    
    2675                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2676                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x224)
    2677                    $C$DW$205       .dwtag  DW_TAG_member
    2678                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$29)
    2679                            .dwattr $C$DW$205, DW_AT_name("fs")
    2680                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("fs")
    2681                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2682                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2683                            .dwattr $C$DW$205, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2684                            .dwattr $C$DW$205, DW_AT_decl_line(0x73)
    2685                            .dwattr $C$DW$205, DW_AT_decl_column(0x09)
    2686                    $C$DW$206       .dwtag  DW_TAG_member
    2687                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$24)
TI ARM Assembler PC v5.2.6 Thu Apr 28 10:43:48 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   51

    2688                            .dwattr $C$DW$206, DW_AT_name("id")
    2689                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("id")
    2690                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2691                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2692                            .dwattr $C$DW$206, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2693                            .dwattr $C$DW$206, DW_AT_decl_line(0x74)
    2694                            .dwattr $C$DW$206, DW_AT_decl_column(0x07)
    2695                    $C$DW$207       .dwtag  DW_TAG_member
    2696                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$23)
    2697                            .dwattr $C$DW$207, DW_AT_name("flag")
    2698                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("flag")
    2699                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2700                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2701                            .dwattr $C$DW$207, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2702                            .dwattr $C$DW$207, DW_AT_decl_line(0x75)
    2703                            .dwattr $C$DW$207, DW_AT_decl_column(0x07)
    2704                    $C$DW$208       .dwtag  DW_TAG_member
    2705                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$23)
    2706                            .dwattr $C$DW$208, DW_AT_name("pad1")
    2707                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("pad1")
    2708                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2709                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2710                            .dwattr $C$DW$208, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2711                            .dwattr $C$DW$208, DW_AT_decl_line(0x76)
    2712                            .dwattr $C$DW$208, DW_AT_decl_column(0x07)
    2713                    $C$DW$209       .dwtag  DW_TAG_member
    2714                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$25)
    2715                            .dwattr $C$DW$209, DW_AT_name("fptr")
    2716                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("fptr")
    2717                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2718                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2719                            .dwattr $C$DW$209, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2720                            .dwattr $C$DW$209, DW_AT_decl_line(0x77)
    2721                            .dwattr $C$DW$209, DW_AT_decl_column(0x08)
    2722                    $C$DW$210       .dwtag  DW_TAG_member
    2723                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$25)
    2724                            .dwattr $C$DW$210, DW_AT_name("fsize")
    2725                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("fsize")
    2726                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2727                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2728                            .dwattr $C$DW$210, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2729                            .dwattr $C$DW$210, DW_AT_decl_line(0x78)
    2730                            .dwattr $C$DW$210, DW_AT_decl_column(0x08)
    2731                    $C$DW$211       .dwtag  DW_TAG_member
    2732                            .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$25)
    2733                            .dwattr $C$DW$211, DW_AT_name("sclust")
    2734                            .dwattr $C$DW$211, DW_AT_TI_symbol_name("sclust")
    2735                            .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2736                            .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2737                            .dwattr $C$DW$211, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2738                            .dwattr $C$DW$211, DW_AT_decl_line(0x79)
    2739                            .dwattr $C$DW$211, DW_AT_decl_column(0x08)
    2740                    $C$DW$212       .dwtag  DW_TAG_member
    2741                            .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$25)
    2742                            .dwattr $C$DW$212, DW_AT_name("clust")
TI ARM Assembler PC v5.2.6 Thu Apr 28 10:43:48 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   52

    2743                            .dwattr $C$DW$212, DW_AT_TI_symbol_name("clust")
    2744                            .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2745                            .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2746                            .dwattr $C$DW$212, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2747                            .dwattr $C$DW$212, DW_AT_decl_line(0x7a)
    2748                            .dwattr $C$DW$212, DW_AT_decl_column(0x08)
    2749                    $C$DW$213       .dwtag  DW_TAG_member
    2750                            .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$25)
    2751                            .dwattr $C$DW$213, DW_AT_name("dsect")
    2752                            .dwattr $C$DW$213, DW_AT_TI_symbol_name("dsect")
    2753                            .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2754                            .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2755                            .dwattr $C$DW$213, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2756                            .dwattr $C$DW$213, DW_AT_decl_line(0x7b)
    2757                            .dwattr $C$DW$213, DW_AT_decl_column(0x08)
    2758                    $C$DW$214       .dwtag  DW_TAG_member
    2759                            .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$25)
    2760                            .dwattr $C$DW$214, DW_AT_name("dir_sect")
    2761                            .dwattr $C$DW$214, DW_AT_TI_symbol_name("dir_sect")
    2762                            .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2763                            .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2764                            .dwattr $C$DW$214, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2765                            .dwattr $C$DW$214, DW_AT_decl_line(0x7d)
    2766                            .dwattr $C$DW$214, DW_AT_decl_column(0x08)
    2767                    $C$DW$215       .dwtag  DW_TAG_member
    2768                            .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$30)
    2769                            .dwattr $C$DW$215, DW_AT_name("dir_ptr")
    2770                            .dwattr $C$DW$215, DW_AT_TI_symbol_name("dir_ptr")
    2771                            .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2772                            .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2773                            .dwattr $C$DW$215, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2774                            .dwattr $C$DW$215, DW_AT_decl_line(0x7e)
    2775                            .dwattr $C$DW$215, DW_AT_decl_column(0x08)
    2776                    $C$DW$216       .dwtag  DW_TAG_member
    2777                            .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$26)
    2778                            .dwattr $C$DW$216, DW_AT_name("buf")
    2779                            .dwattr $C$DW$216, DW_AT_TI_symbol_name("buf")
    2780                            .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2781                            .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2782                            .dwattr $C$DW$216, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2783                            .dwattr $C$DW$216, DW_AT_decl_line(0x87)
    2784                            .dwattr $C$DW$216, DW_AT_decl_column(0x07)
    2785                            .dwendtag $C$DW$T$31
    2786                    
    2787                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2788                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x72)
    2789                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    2790                    $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("FIL")
    2791                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$31)
    2792                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    2793                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2794                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x89)
    2795                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x03)
    2796                    
    2797                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v5.2.6 Thu Apr 28 10:43:48 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   53

    2798                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x1c)
    2799                    $C$DW$217       .dwtag  DW_TAG_member
    2800                            .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$29)
    2801                            .dwattr $C$DW$217, DW_AT_name("fs")
    2802                            .dwattr $C$DW$217, DW_AT_TI_symbol_name("fs")
    2803                            .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2804                            .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2805                            .dwattr $C$DW$217, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2806                            .dwattr $C$DW$217, DW_AT_decl_line(0x90)
    2807                            .dwattr $C$DW$217, DW_AT_decl_column(0x09)
    2808                    $C$DW$218       .dwtag  DW_TAG_member
    2809                            .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$24)
    2810                            .dwattr $C$DW$218, DW_AT_name("id")
    2811                            .dwattr $C$DW$218, DW_AT_TI_symbol_name("id")
    2812                            .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2813                            .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2814                            .dwattr $C$DW$218, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2815                            .dwattr $C$DW$218, DW_AT_decl_line(0x91)
    2816                            .dwattr $C$DW$218, DW_AT_decl_column(0x07)
    2817                    $C$DW$219       .dwtag  DW_TAG_member
    2818                            .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$24)
    2819                            .dwattr $C$DW$219, DW_AT_name("index")
    2820                            .dwattr $C$DW$219, DW_AT_TI_symbol_name("index")
    2821                            .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2822                            .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2823                            .dwattr $C$DW$219, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2824                            .dwattr $C$DW$219, DW_AT_decl_line(0x92)
    2825                            .dwattr $C$DW$219, DW_AT_decl_column(0x07)
    2826                    $C$DW$220       .dwtag  DW_TAG_member
    2827                            .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$25)
    2828                            .dwattr $C$DW$220, DW_AT_name("sclust")
    2829                            .dwattr $C$DW$220, DW_AT_TI_symbol_name("sclust")
    2830                            .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2831                            .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2832                            .dwattr $C$DW$220, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2833                            .dwattr $C$DW$220, DW_AT_decl_line(0x93)
    2834                            .dwattr $C$DW$220, DW_AT_decl_column(0x08)
    2835                    $C$DW$221       .dwtag  DW_TAG_member
    2836                            .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$25)
    2837                            .dwattr $C$DW$221, DW_AT_name("clust")
    2838                            .dwattr $C$DW$221, DW_AT_TI_symbol_name("clust")
    2839                            .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2840                            .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2841                            .dwattr $C$DW$221, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2842                            .dwattr $C$DW$221, DW_AT_decl_line(0x94)
    2843                            .dwattr $C$DW$221, DW_AT_decl_column(0x08)
    2844                    $C$DW$222       .dwtag  DW_TAG_member
    2845                            .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$25)
    2846                            .dwattr $C$DW$222, DW_AT_name("sect")
    2847                            .dwattr $C$DW$222, DW_AT_TI_symbol_name("sect")
    2848                            .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2849                            .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2850                            .dwattr $C$DW$222, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2851                            .dwattr $C$DW$222, DW_AT_decl_line(0x95)
    2852                            .dwattr $C$DW$222, DW_AT_decl_column(0x08)
TI ARM Assembler PC v5.2.6 Thu Apr 28 10:43:48 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   54

    2853                    $C$DW$223       .dwtag  DW_TAG_member
    2854                            .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$30)
    2855                            .dwattr $C$DW$223, DW_AT_name("dir")
    2856                            .dwattr $C$DW$223, DW_AT_TI_symbol_name("dir")
    2857                            .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2858                            .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2859                            .dwattr $C$DW$223, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2860                            .dwattr $C$DW$223, DW_AT_decl_line(0x96)
    2861                            .dwattr $C$DW$223, DW_AT_decl_column(0x08)
    2862                    $C$DW$224       .dwtag  DW_TAG_member
    2863                            .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$30)
    2864                            .dwattr $C$DW$224, DW_AT_name("fn")
    2865                            .dwattr $C$DW$224, DW_AT_TI_symbol_name("fn")
    2866                            .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2867                            .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2868                            .dwattr $C$DW$224, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2869                            .dwattr $C$DW$224, DW_AT_decl_line(0x97)
    2870                            .dwattr $C$DW$224, DW_AT_decl_column(0x08)
    2871                            .dwendtag $C$DW$T$32
    2872                    
    2873                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2874                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x8f)
    2875                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    2876                    $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("DIR")
    2877                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$32)
    2878                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    2879                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2880                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x9c)
    2881                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x03)
    2882                    
    2883                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2884                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x18)
    2885                    $C$DW$225       .dwtag  DW_TAG_member
    2886                            .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$25)
    2887                            .dwattr $C$DW$225, DW_AT_name("fsize")
    2888                            .dwattr $C$DW$225, DW_AT_TI_symbol_name("fsize")
    2889                            .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2890                            .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2891                            .dwattr $C$DW$225, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2892                            .dwattr $C$DW$225, DW_AT_decl_line(0xa3)
    2893                            .dwattr $C$DW$225, DW_AT_decl_column(0x08)
    2894                    $C$DW$226       .dwtag  DW_TAG_member
    2895                            .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$24)
    2896                            .dwattr $C$DW$226, DW_AT_name("fdate")
    2897                            .dwattr $C$DW$226, DW_AT_TI_symbol_name("fdate")
    2898                            .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2899                            .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2900                            .dwattr $C$DW$226, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2901                            .dwattr $C$DW$226, DW_AT_decl_line(0xa4)
    2902                            .dwattr $C$DW$226, DW_AT_decl_column(0x07)
    2903                    $C$DW$227       .dwtag  DW_TAG_member
    2904                            .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$24)
    2905                            .dwattr $C$DW$227, DW_AT_name("ftime")
    2906                            .dwattr $C$DW$227, DW_AT_TI_symbol_name("ftime")
    2907                            .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TI ARM Assembler PC v5.2.6 Thu Apr 28 10:43:48 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   55

    2908                            .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2909                            .dwattr $C$DW$227, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2910                            .dwattr $C$DW$227, DW_AT_decl_line(0xa5)
    2911                            .dwattr $C$DW$227, DW_AT_decl_column(0x07)
    2912                    $C$DW$228       .dwtag  DW_TAG_member
    2913                            .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$23)
    2914                            .dwattr $C$DW$228, DW_AT_name("fattrib")
    2915                            .dwattr $C$DW$228, DW_AT_TI_symbol_name("fattrib")
    2916                            .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2917                            .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2918                            .dwattr $C$DW$228, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2919                            .dwattr $C$DW$228, DW_AT_decl_line(0xa6)
    2920                            .dwattr $C$DW$228, DW_AT_decl_column(0x07)
    2921                    $C$DW$229       .dwtag  DW_TAG_member
    2922                            .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$34)
    2923                            .dwattr $C$DW$229, DW_AT_name("fname")
    2924                            .dwattr $C$DW$229, DW_AT_TI_symbol_name("fname")
    2925                            .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2926                            .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2927                            .dwattr $C$DW$229, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2928                            .dwattr $C$DW$229, DW_AT_decl_line(0xa7)
    2929                            .dwattr $C$DW$229, DW_AT_decl_column(0x08)
    2930                            .dwendtag $C$DW$T$35
    2931                    
    2932                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2933                            .dwattr $C$DW$T$35, DW_AT_decl_line(0xa2)
    2934                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    2935                    $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("FILINFO")
    2936                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$35)
    2937                            .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    2938                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/ff.h")
    2939                            .dwattr $C$DW$T$51, DW_AT_decl_line(0xac)
    2940                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x03)
    2941                    
    2942                    $C$DW$T$37      .dwtag  DW_TAG_union_type
    2943                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x10)
    2944                    $C$DW$230       .dwtag  DW_TAG_member
    2945                            .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$36)
    2946                            .dwattr $C$DW$230, DW_AT_name("_Us")
    2947                            .dwattr $C$DW$230, DW_AT_TI_symbol_name("_Us")
    2948                            .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2949                            .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2950                            .dwattr $C$DW$230, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/float.
    2951                            .dwattr $C$DW$230, DW_AT_decl_line(0x3a)
    2952                            .dwattr $C$DW$230, DW_AT_decl_column(0x12)
    2953                    $C$DW$231       .dwtag  DW_TAG_member
    2954                            .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$16)
    2955                            .dwattr $C$DW$231, DW_AT_name("_Float")
    2956                            .dwattr $C$DW$231, DW_AT_TI_symbol_name("_Float")
    2957                            .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2958                            .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2959                            .dwattr $C$DW$231, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/float.
    2960                            .dwattr $C$DW$231, DW_AT_decl_line(0x3b)
    2961                            .dwattr $C$DW$231, DW_AT_decl_column(0x09)
    2962                    $C$DW$232       .dwtag  DW_TAG_member
TI ARM Assembler PC v5.2.6 Thu Apr 28 10:43:48 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   56

    2963                            .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$17)
    2964                            .dwattr $C$DW$232, DW_AT_name("_Double")
    2965                            .dwattr $C$DW$232, DW_AT_TI_symbol_name("_Double")
    2966                            .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2967                            .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2968                            .dwattr $C$DW$232, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/float.
    2969                            .dwattr $C$DW$232, DW_AT_decl_line(0x3c)
    2970                            .dwattr $C$DW$232, DW_AT_decl_column(0x0a)
    2971                    $C$DW$233       .dwtag  DW_TAG_member
    2972                            .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$18)
    2973                            .dwattr $C$DW$233, DW_AT_name("_Long_double")
    2974                            .dwattr $C$DW$233, DW_AT_TI_symbol_name("_Long_double")
    2975                            .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2976                            .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2977                            .dwattr $C$DW$233, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/float.
    2978                            .dwattr $C$DW$233, DW_AT_decl_line(0x3d)
    2979                            .dwattr $C$DW$233, DW_AT_decl_column(0x0f)
    2980                            .dwendtag $C$DW$T$37
    2981                    
    2982                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/float
    2983                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x39)
    2984                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x03)
    2985                    
    2986                    $C$DW$T$38      .dwtag  DW_TAG_union_type
    2987                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x10)
    2988                    $C$DW$234       .dwtag  DW_TAG_member
    2989                            .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$36)
    2990                            .dwattr $C$DW$234, DW_AT_name("_Word")
    2991                            .dwattr $C$DW$234, DW_AT_TI_symbol_name("_Word")
    2992                            .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2993                            .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2994                            .dwattr $C$DW$234, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/ymath.
    2995                            .dwattr $C$DW$234, DW_AT_decl_line(0x8f)
    2996                            .dwattr $C$DW$234, DW_AT_decl_column(0x11)
    2997                    $C$DW$235       .dwtag  DW_TAG_member
    2998                            .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$16)
    2999                            .dwattr $C$DW$235, DW_AT_name("_Float")
    3000                            .dwattr $C$DW$235, DW_AT_TI_symbol_name("_Float")
    3001                            .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3002                            .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3003                            .dwattr $C$DW$235, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/ymath.
    3004                            .dwattr $C$DW$235, DW_AT_decl_line(0x90)
    3005                            .dwattr $C$DW$235, DW_AT_decl_column(0x08)
    3006                    $C$DW$236       .dwtag  DW_TAG_member
    3007                            .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$17)
    3008                            .dwattr $C$DW$236, DW_AT_name("_Double")
    3009                            .dwattr $C$DW$236, DW_AT_TI_symbol_name("_Double")
    3010                            .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3011                            .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3012                            .dwattr $C$DW$236, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/ymath.
    3013                            .dwattr $C$DW$236, DW_AT_decl_line(0x91)
    3014                            .dwattr $C$DW$236, DW_AT_decl_column(0x09)
    3015                    $C$DW$237       .dwtag  DW_TAG_member
    3016                            .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$18)
    3017                            .dwattr $C$DW$237, DW_AT_name("_Long_double")
TI ARM Assembler PC v5.2.6 Thu Apr 28 10:43:48 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   57

    3018                            .dwattr $C$DW$237, DW_AT_TI_symbol_name("_Long_double")
    3019                            .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3020                            .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3021                            .dwattr $C$DW$237, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/ymath.
    3022                            .dwattr $C$DW$237, DW_AT_decl_line(0x92)
    3023                            .dwattr $C$DW$237, DW_AT_decl_column(0x0e)
    3024                            .dwendtag $C$DW$T$38
    3025                    
    3026                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/ymath
    3027                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x8e)
    3028                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x02)
    3029                    $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("_Dconst")
    3030                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$38)
    3031                            .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    3032                            .dwattr $C$DW$T$52, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/ymath
    3033                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x93)
    3034                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x04)
    3035                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3036                            .dwattr $C$DW$T$2, DW_AT_name("void")
    3037                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3038                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3039                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3040                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    3041                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3042                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    3043                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3044                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    3045                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3046                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3047                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3048                    $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    3049                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$5)
    3050                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    3051                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/stdin
    3052                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x2a)
    3053                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x1d)
    3054                    $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
    3055                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    3056                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    3057                            .dwattr $C$DW$T$79, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/stdin
    3058                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x37)
    3059                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x17)
    3060                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    3061                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3062                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3063                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3064                    $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("BYTE")
    3065                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$6)
    3066                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    3067                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:\ti\TivaWare\third_party\fatfs\src\integer.h")
    3068                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x16)
    3069                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x17)
    3070                    $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("DSTATUS")
    3071                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$23)
    3072                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v5.2.6 Thu Apr 28 10:43:48 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   58

    3073                            .dwattr $C$DW$T$80, DW_AT_decl_file("C:/ti/TivaWare/third_party/fatfs/src/diskio.h")
    3074                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x13)
    3075                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x0e)
    3076                    
    3077                    $C$DW$T$26      .dwtag  DW_TAG_array_type
    3078                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$23)
    3079                            .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    3080                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x200)
    3081                    $C$DW$238       .dwtag  DW_TAG_subrange_type
    3082                            .dwattr $C$DW$238, DW_AT_upper_bound(0x1ff)
    3083                            .dwendtag $C$DW$T$26
    3084                    
    3085                    $C$DW$T$30      .dwtag  DW_TAG_pointer_type
    3086                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$23)
    3087                            .dwattr $C$DW$T$30, DW_AT_address_class(0x20)
    3088                    $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("UCHAR")
    3089                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$6)
    3090                            .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    3091                            .dwattr $C$DW$T$81, DW_AT_decl_file("C:\ti\TivaWare\third_party\fatfs\src\integer.h")
    3092                            .dwattr $C$DW$T$81, DW_AT_decl_line(0x15)
    3093                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x17)
    3094                    $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    3095                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$6)
    3096                            .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    3097                            .dwattr $C$DW$T$57, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/stdin
    3098                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x2b)
    3099                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x1c)
    3100                    $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
    3101                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$57)
    3102                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    3103                            .dwattr $C$DW$T$88, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/stdin
    3104                            .dwattr $C$DW$T$88, DW_AT_decl_line(0x38)
    3105                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x16)
    3106                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    3107                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3108                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3109                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    3110                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    3111                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3112                            .dwattr $C$DW$T$8, DW_AT_name("short")
    3113                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    3114                    $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("SHORT")
    3115                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$8)
    3116                            .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    3117                            .dwattr $C$DW$T$89, DW_AT_decl_file("C:\ti\TivaWare\third_party\fatfs\src\integer.h")
    3118                            .dwattr $C$DW$T$89, DW_AT_decl_line(0x19)
    3119                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x11)
    3120                    $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
    3121                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$8)
    3122                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    3123                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/stdin
    3124                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x2c)
    3125                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x1d)
    3126                    $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
    3127                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
TI ARM Assembler PC v5.2.6 Thu Apr 28 10:43:48 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   59

    3128                            .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    3129                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/stdin
    3130                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x3a)
    3131                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x17)
    3132                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    3133                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3134                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3135                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    3136                    $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("USHORT")
    3137                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$9)
    3138                            .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    3139                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:\ti\TivaWare\third_party\fatfs\src\integer.h")
    3140                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x1a)
    3141                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x18)
    3142                    $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("WCHAR")
    3143                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$9)
    3144                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    3145                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:\ti\TivaWare\third_party\fatfs\src\integer.h")
    3146                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x1c)
    3147                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x18)
    3148                    $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("WORD")
    3149                            .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$9)
    3150                            .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    3151                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:\ti\TivaWare\third_party\fatfs\src\integer.h")
    3152                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x1b)
    3153                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x18)
    3154                    $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("_Wchart")
    3155                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$9)
    3156                            .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    3157                            .dwattr $C$DW$T$94, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/yvals
    3158                            .dwattr $C$DW$T$94, DW_AT_decl_line(0x1e5)
    3159                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x21)
    3160                    $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("_Wintt")
    3161                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$9)
    3162                            .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    3163                            .dwattr $C$DW$T$95, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/yvals
    3164                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x1e6)
    3165                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x21)
    3166                    
    3167                    $C$DW$T$36      .dwtag  DW_TAG_array_type
    3168                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$9)
    3169                            .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    3170                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x10)
    3171                    $C$DW$239       .dwtag  DW_TAG_subrange_type
    3172                            .dwattr $C$DW$239, DW_AT_upper_bound(0x07)
    3173                            .dwendtag $C$DW$T$36
    3174                    
    3175                    $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    3176                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$9)
    3177                            .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    3178                            .dwattr $C$DW$T$96, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/stdin
    3179                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x2d)
    3180                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x1c)
    3181                    $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
    3182                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
TI ARM Assembler PC v5.2.6 Thu Apr 28 10:43:48 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   60

    3183                            .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    3184                            .dwattr $C$DW$T$97, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/stdin
    3185                            .dwattr $C$DW$T$97, DW_AT_decl_line(0x3b)
    3186                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x16)
    3187                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    3188                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    3189                            .dwattr $C$DW$T$10, DW_AT_name("int")
    3190                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    3191                    $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("INT")
    3192                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$10)
    3193                            .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    3194                            .dwattr $C$DW$T$98, DW_AT_decl_file("C:\ti\TivaWare\third_party\fatfs\src\integer.h")
    3195                            .dwattr $C$DW$T$98, DW_AT_decl_line(0x10)
    3196                            .dwattr $C$DW$T$98, DW_AT_decl_column(0x10)
    3197                    $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("_Ptrdifft")
    3198                            .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$10)
    3199                            .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    3200                            .dwattr $C$DW$T$99, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/yvals
    3201                            .dwattr $C$DW$T$99, DW_AT_decl_line(0xa9)
    3202                            .dwattr $C$DW$T$99, DW_AT_decl_column(0x1e)
    3203                    $C$DW$T$101     .dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
    3204                            .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$10)
    3205                            .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    3206                            .dwattr $C$DW$T$101, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/stdi
    3207                            .dwattr $C$DW$T$101, DW_AT_decl_line(0x2e)
    3208                            .dwattr $C$DW$T$101, DW_AT_decl_column(0x1d)
    3209                    $C$DW$T$102     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast16_t")
    3210                            .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$101)
    3211                            .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    3212                            .dwattr $C$DW$T$102, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/stdi
    3213                            .dwattr $C$DW$T$102, DW_AT_decl_line(0x47)
    3214                            .dwattr $C$DW$T$102, DW_AT_decl_column(0x17)
    3215                    $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast32_t")
    3216                            .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$101)
    3217                            .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    3218                            .dwattr $C$DW$T$103, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/stdi
    3219                            .dwattr $C$DW$T$103, DW_AT_decl_line(0x4a)
    3220                            .dwattr $C$DW$T$103, DW_AT_decl_column(0x17)
    3221                    $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast8_t")
    3222                            .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$101)
    3223                            .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    3224                            .dwattr $C$DW$T$104, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/stdi
    3225                            .dwattr $C$DW$T$104, DW_AT_decl_line(0x45)
    3226                            .dwattr $C$DW$T$104, DW_AT_decl_column(0x17)
    3227                    $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("int_least32_t")
    3228                            .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$101)
    3229                            .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    3230                            .dwattr $C$DW$T$105, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/stdi
    3231                            .dwattr $C$DW$T$105, DW_AT_decl_line(0x3c)
    3232                            .dwattr $C$DW$T$105, DW_AT_decl_column(0x17)
    3233                    $C$DW$T$106     .dwtag  DW_TAG_typedef, DW_AT_name("intptr_t")
    3234                            .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$10)
    3235                            .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    3236                            .dwattr $C$DW$T$106, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/stdi
    3237                            .dwattr $C$DW$T$106, DW_AT_decl_line(0x52)
TI ARM Assembler PC v5.2.6 Thu Apr 28 10:43:48 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   61

    3238                            .dwattr $C$DW$T$106, DW_AT_decl_column(0x1a)
    3239                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    3240                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    3241                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    3242                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    3243                    $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("UINT")
    3244                            .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$11)
    3245                            .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    3246                            .dwattr $C$DW$T$107, DW_AT_decl_file("C:\ti\TivaWare\third_party\fatfs\src\integer.h")
    3247                            .dwattr $C$DW$T$107, DW_AT_decl_line(0x11)
    3248                            .dwattr $C$DW$T$107, DW_AT_decl_column(0x16)
    3249                    $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("_Sizet")
    3250                            .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$11)
    3251                            .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
    3252                            .dwattr $C$DW$T$108, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/yval
    3253                            .dwattr $C$DW$T$108, DW_AT_decl_line(0xab)
    3254                            .dwattr $C$DW$T$108, DW_AT_decl_column(0x1a)
    3255                    $C$DW$T$109     .dwtag  DW_TAG_typedef, DW_AT_name("_TI_uint32_t")
    3256                            .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$11)
    3257                            .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    3258                            .dwattr $C$DW$T$109, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/ymat
    3259                            .dwattr $C$DW$T$109, DW_AT_decl_line(0xb6)
    3260                            .dwattr $C$DW$T$109, DW_AT_decl_column(0x19)
    3261                    $C$DW$T$110     .dwtag  DW_TAG_typedef, DW_AT_name("clock_t")
    3262                            .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$11)
    3263                            .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    3264                            .dwattr $C$DW$T$110, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/time
    3265                            .dwattr $C$DW$T$110, DW_AT_decl_line(0x4f)
    3266                            .dwattr $C$DW$T$110, DW_AT_decl_column(0x16)
    3267                    $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    3268                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$11)
    3269                            .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    3270                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/strin
    3271                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x3d)
    3272                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x19)
    3273                    $C$DW$T$111     .dwtag  DW_TAG_typedef, DW_AT_name("time_t")
    3274                            .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$11)
    3275                            .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
    3276                            .dwattr $C$DW$T$111, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/time
    3277                            .dwattr $C$DW$T$111, DW_AT_decl_line(0x50)
    3278                            .dwattr $C$DW$T$111, DW_AT_decl_column(0x16)
    3279                    $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
    3280                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$11)
    3281                            .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    3282                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/stdin
    3283                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x2f)
    3284                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x1c)
    3285                    $C$DW$T$117     .dwtag  DW_TAG_volatile_type
    3286                            .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$56)
    3287                    $C$DW$T$118     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast16_t")
    3288                            .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$56)
    3289                            .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
    3290                            .dwattr $C$DW$T$118, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/stdi
    3291                            .dwattr $C$DW$T$118, DW_AT_decl_line(0x48)
    3292                            .dwattr $C$DW$T$118, DW_AT_decl_column(0x16)
TI ARM Assembler PC v5.2.6 Thu Apr 28 10:43:48 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   62

    3293                    $C$DW$T$119     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast32_t")
    3294                            .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$56)
    3295                            .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    3296                            .dwattr $C$DW$T$119, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/stdi
    3297                            .dwattr $C$DW$T$119, DW_AT_decl_line(0x4b)
    3298                            .dwattr $C$DW$T$119, DW_AT_decl_column(0x16)
    3299                    $C$DW$T$120     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast8_t")
    3300                            .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$56)
    3301                            .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    3302                            .dwattr $C$DW$T$120, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/stdi
    3303                            .dwattr $C$DW$T$120, DW_AT_decl_line(0x46)
    3304                            .dwattr $C$DW$T$120, DW_AT_decl_column(0x16)
    3305                    $C$DW$T$121     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least32_t")
    3306                            .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$56)
    3307                            .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    3308                            .dwattr $C$DW$T$121, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/stdi
    3309                            .dwattr $C$DW$T$121, DW_AT_decl_line(0x3d)
    3310                            .dwattr $C$DW$T$121, DW_AT_decl_column(0x16)
    3311                    $C$DW$T$122     .dwtag  DW_TAG_typedef, DW_AT_name("uintptr_t")
    3312                            .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$11)
    3313                            .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    3314                            .dwattr $C$DW$T$122, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/stdi
    3315                            .dwattr $C$DW$T$122, DW_AT_decl_line(0x53)
    3316                            .dwattr $C$DW$T$122, DW_AT_decl_column(0x1a)
    3317                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    3318                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    3319                            .dwattr $C$DW$T$12, DW_AT_name("long")
    3320                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    3321                    $C$DW$T$123     .dwtag  DW_TAG_typedef, DW_AT_name("LONG")
    3322                            .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$12)
    3323                            .dwattr $C$DW$T$123, DW_AT_language(DW_LANG_C)
    3324                            .dwattr $C$DW$T$123, DW_AT_decl_file("C:\ti\TivaWare\third_party\fatfs\src\integer.h")
    3325                            .dwattr $C$DW$T$123, DW_AT_decl_line(0x1f)
    3326                            .dwattr $C$DW$T$123, DW_AT_decl_column(0x10)
    3327                    $C$DW$T$124     .dwtag  DW_TAG_typedef, DW_AT_name("_Int32t")
    3328                            .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$12)
    3329                            .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
    3330                            .dwattr $C$DW$T$124, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/yval
    3331                            .dwattr $C$DW$T$124, DW_AT_decl_line(0xa6)
    3332                            .dwattr $C$DW$T$124, DW_AT_decl_column(0x0e)
    3333                    $C$DW$T$13      .dwtag  DW_TAG_base_type
    3334                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    3335                            .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    3336                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
    3337                    $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("DWORD")
    3338                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$13)
    3339                            .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    3340                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:\ti\TivaWare\third_party\fatfs\src\integer.h")
    3341                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x21)
    3342                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x17)
    3343                    $C$DW$T$125     .dwtag  DW_TAG_typedef, DW_AT_name("ULONG")
    3344                            .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$13)
    3345                            .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    3346                            .dwattr $C$DW$T$125, DW_AT_decl_file("C:\ti\TivaWare\third_party\fatfs\src\integer.h")
    3347                            .dwattr $C$DW$T$125, DW_AT_decl_line(0x20)
TI ARM Assembler PC v5.2.6 Thu Apr 28 10:43:48 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   63

    3348                            .dwattr $C$DW$T$125, DW_AT_decl_column(0x17)
    3349                    $C$DW$T$126     .dwtag  DW_TAG_typedef, DW_AT_name("_Uint32t")
    3350                            .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$13)
    3351                            .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
    3352                            .dwattr $C$DW$T$126, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/yval
    3353                            .dwattr $C$DW$T$126, DW_AT_decl_line(0xa7)
    3354                            .dwattr $C$DW$T$126, DW_AT_decl_column(0x17)
    3355                    $C$DW$T$14      .dwtag  DW_TAG_base_type
    3356                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    3357                            .dwattr $C$DW$T$14, DW_AT_name("long long")
    3358                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    3359                    $C$DW$T$127     .dwtag  DW_TAG_typedef, DW_AT_name("_Longlong")
    3360                            .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$14)
    3361                            .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    3362                            .dwattr $C$DW$T$127, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/yval
    3363                            .dwattr $C$DW$T$127, DW_AT_decl_line(0x1b5)
    3364                            .dwattr $C$DW$T$127, DW_AT_decl_column(0x13)
    3365                    $C$DW$T$128     .dwtag  DW_TAG_typedef, DW_AT_name("int64_t")
    3366                            .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$14)
    3367                            .dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
    3368                            .dwattr $C$DW$T$128, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.6/include/stdi
