TI ARM Assembler PC v5.2.5 Mon Nov 16 12:40:39 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                             PC v5.2.5 *
       3                    ;* Date/Time created: Mon Nov 16 12:40:39 2015                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --disab
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../timers.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.2.5 Copyright (c) 1996-2015 Te
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("E:\Dev\Ti\Code\GIT\LaunchpadRoomControl\LaunchpadRoomControl
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("GPIOPinWrite")

    1991                    $C$DW$142       .dwtag  DW_TAG_enumerator, DW_AT_name("FR_NOT_ENOUGH_CORE"), DW_AT_const_value(0x11)
    1992                            .dwattr $C$DW$142, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    1993                            .dwattr $C$DW$142, DW_AT_decl_line(0xc4)
    1994                            .dwattr $C$DW$142, DW_AT_decl_column(0x02)
    1995                    $C$DW$143       .dwtag  DW_TAG_enumerator, DW_AT_name("FR_TOO_MANY_OPEN_FILES"), DW_AT_const_value(0x1
    1996                            .dwattr $C$DW$143, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    1997                            .dwattr $C$DW$143, DW_AT_decl_line(0xc5)
    1998                            .dwattr $C$DW$143, DW_AT_decl_column(0x02)
    1999                    $C$DW$144       .dwtag  DW_TAG_enumerator, DW_AT_name("FR_INVALID_PARAMETER"), DW_AT_const_value(0x13)
    2000                            .dwattr $C$DW$144, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2001                            .dwattr $C$DW$144, DW_AT_decl_line(0xc6)
    2002                            .dwattr $C$DW$144, DW_AT_decl_column(0x02)
    2003                            .dwendtag $C$DW$T$40
    2004                    
    2005                            .dwattr $C$DW$T$40, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2006                            .dwattr $C$DW$T$40, DW_AT_decl_line(0xb2)
    2007                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x0e)
    2008                    $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("FRESULT")
    2009                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    2010                            .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    2011                            .dwattr $C$DW$T$41, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2012                            .dwattr $C$DW$T$41, DW_AT_decl_line(0xc7)
    2013                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x03)
    2014                    
    2015                    $C$DW$T$42      .dwtag  DW_TAG_enumeration_type
    2016                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    2017                    $C$DW$145       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_OK"), DW_AT_const_value(0x00)
    2018                            .dwattr $C$DW$145, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2019                            .dwattr $C$DW$145, DW_AT_decl_line(0x17)
    2020                            .dwattr $C$DW$145, DW_AT_decl_column(0x02)
    2021                    $C$DW$146       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_ERROR"), DW_AT_const_value(0x01)
    2022                            .dwattr $C$DW$146, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2023                            .dwattr $C$DW$146, DW_AT_decl_line(0x18)
TI ARM Assembler PC v5.2.5 Mon Nov 16 12:40:39 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   39

    2024                            .dwattr $C$DW$146, DW_AT_decl_column(0x02)
    2025                    $C$DW$147       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_WRPRT"), DW_AT_const_value(0x02)
    2026                            .dwattr $C$DW$147, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2027                            .dwattr $C$DW$147, DW_AT_decl_line(0x19)
    2028                            .dwattr $C$DW$147, DW_AT_decl_column(0x02)
    2029                    $C$DW$148       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_NOTRDY"), DW_AT_const_value(0x03)
    2030                            .dwattr $C$DW$148, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2031                            .dwattr $C$DW$148, DW_AT_decl_line(0x1a)
    2032                            .dwattr $C$DW$148, DW_AT_decl_column(0x02)
    2033                    $C$DW$149       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_PARERR"), DW_AT_const_value(0x04)
    2034                            .dwattr $C$DW$149, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2035                            .dwattr $C$DW$149, DW_AT_decl_line(0x1b)
    2036                            .dwattr $C$DW$149, DW_AT_decl_column(0x02)
    2037                            .dwendtag $C$DW$T$42
    2038                    
    2039                            .dwattr $C$DW$T$42, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2040                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x16)
    2041                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x0e)
    2042                    $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("DRESULT")
    2043                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    2044                            .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    2045                            .dwattr $C$DW$T$43, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2046                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x1c)
    2047                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x03)
    2048                    
    2049                    $C$DW$T$19      .dwtag  DW_TAG_structure_type
    2050                            .dwattr $C$DW$T$19, DW_AT_byte_size(0x48)
    2051                    $C$DW$150       .dwtag  DW_TAG_member
    2052                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$10)
    2053                            .dwattr $C$DW$150, DW_AT_name("_Ddig")
    2054                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("_Ddig")
    2055                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2056                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2057                            .dwattr $C$DW$150, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2058                            .dwattr $C$DW$150, DW_AT_decl_line(0x37)
    2059                            .dwattr $C$DW$150, DW_AT_decl_column(0x06)
    2060                    $C$DW$151       .dwtag  DW_TAG_member
    2061                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$10)
    2062                            .dwattr $C$DW$151, DW_AT_name("_Dmdig")
    2063                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("_Dmdig")
    2064                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2065                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2066                            .dwattr $C$DW$151, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2067                            .dwattr $C$DW$151, DW_AT_decl_line(0x37)
    2068                            .dwattr $C$DW$151, DW_AT_decl_column(0x0d)
    2069                    $C$DW$152       .dwtag  DW_TAG_member
    2070                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$10)
    2071                            .dwattr $C$DW$152, DW_AT_name("_Dmax10e")
    2072                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("_Dmax10e")
    2073                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2074                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2075                            .dwattr $C$DW$152, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2076                            .dwattr $C$DW$152, DW_AT_decl_line(0x37)
    2077                            .dwattr $C$DW$152, DW_AT_decl_column(0x15)
    2078                    $C$DW$153       .dwtag  DW_TAG_member
TI ARM Assembler PC v5.2.5 Mon Nov 16 12:40:39 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   40

    2079                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$10)
    2080                            .dwattr $C$DW$153, DW_AT_name("_Dmaxe")
    2081                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("_Dmaxe")
    2082                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2083                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2084                            .dwattr $C$DW$153, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2085                            .dwattr $C$DW$153, DW_AT_decl_line(0x37)
    2086                            .dwattr $C$DW$153, DW_AT_decl_column(0x1f)
    2087                    $C$DW$154       .dwtag  DW_TAG_member
    2088                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$10)
    2089                            .dwattr $C$DW$154, DW_AT_name("_Dmin10e")
    2090                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("_Dmin10e")
    2091                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2092                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2093                            .dwattr $C$DW$154, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2094                            .dwattr $C$DW$154, DW_AT_decl_line(0x37)
    2095                            .dwattr $C$DW$154, DW_AT_decl_column(0x27)
    2096                    $C$DW$155       .dwtag  DW_TAG_member
    2097                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$10)
    2098                            .dwattr $C$DW$155, DW_AT_name("_Dmine")
    2099                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("_Dmine")
    2100                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2101                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2102                            .dwattr $C$DW$155, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2103                            .dwattr $C$DW$155, DW_AT_decl_line(0x37)
    2104                            .dwattr $C$DW$155, DW_AT_decl_column(0x31)
    2105                    $C$DW$156       .dwtag  DW_TAG_member
    2106                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$35)
    2107                            .dwattr $C$DW$156, DW_AT_name("_Deps")
    2108                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("_Deps")
    2109                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2110                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2111                            .dwattr $C$DW$156, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2112                            .dwattr $C$DW$156, DW_AT_decl_line(0x3e)
    2113                            .dwattr $C$DW$156, DW_AT_decl_column(0x05)
    2114                    $C$DW$157       .dwtag  DW_TAG_member
    2115                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$35)
    2116                            .dwattr $C$DW$157, DW_AT_name("_Dmax")
    2117                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("_Dmax")
    2118                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2119                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2120                            .dwattr $C$DW$157, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2121                            .dwattr $C$DW$157, DW_AT_decl_line(0x3e)
    2122                            .dwattr $C$DW$157, DW_AT_decl_column(0x0c)
    2123                    $C$DW$158       .dwtag  DW_TAG_member
    2124                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$35)
    2125                            .dwattr $C$DW$158, DW_AT_name("_Dmin")
    2126                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("_Dmin")
    2127                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2128                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2129                            .dwattr $C$DW$158, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2130                            .dwattr $C$DW$158, DW_AT_decl_line(0x3e)
    2131                            .dwattr $C$DW$158, DW_AT_decl_column(0x13)
    2132                            .dwendtag $C$DW$T$19
    2133                    
TI ARM Assembler PC v5.2.5 Mon Nov 16 12:40:39 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   41

    2134                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float
    2135                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x36)
    2136                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x02)
    2137                    $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("_Dvals")
    2138                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$19)
    2139                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    2140                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float
    2141                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x3f)
    2142                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x04)
    2143                    
    2144                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2145                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x234)
    2146                    $C$DW$159       .dwtag  DW_TAG_member
    2147                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$20)
    2148                            .dwattr $C$DW$159, DW_AT_name("fs_type")
    2149                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("fs_type")
    2150                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2151                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2152                            .dwattr $C$DW$159, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2153                            .dwattr $C$DW$159, DW_AT_decl_line(0x4e)
    2154                            .dwattr $C$DW$159, DW_AT_decl_column(0x07)
    2155                    $C$DW$160       .dwtag  DW_TAG_member
    2156                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$20)
    2157                            .dwattr $C$DW$160, DW_AT_name("drv")
    2158                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("drv")
    2159                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2160                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2161                            .dwattr $C$DW$160, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2162                            .dwattr $C$DW$160, DW_AT_decl_line(0x4f)
    2163                            .dwattr $C$DW$160, DW_AT_decl_column(0x07)
    2164                    $C$DW$161       .dwtag  DW_TAG_member
    2165                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$20)
    2166                            .dwattr $C$DW$161, DW_AT_name("csize")
    2167                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("csize")
    2168                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2169                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2170                            .dwattr $C$DW$161, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2171                            .dwattr $C$DW$161, DW_AT_decl_line(0x50)
    2172                            .dwattr $C$DW$161, DW_AT_decl_column(0x07)
    2173                    $C$DW$162       .dwtag  DW_TAG_member
    2174                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    2175                            .dwattr $C$DW$162, DW_AT_name("n_fats")
    2176                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("n_fats")
    2177                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2178                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2179                            .dwattr $C$DW$162, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2180                            .dwattr $C$DW$162, DW_AT_decl_line(0x51)
    2181                            .dwattr $C$DW$162, DW_AT_decl_column(0x07)
    2182                    $C$DW$163       .dwtag  DW_TAG_member
    2183                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$20)
    2184                            .dwattr $C$DW$163, DW_AT_name("wflag")
    2185                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("wflag")
    2186                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2187                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2188                            .dwattr $C$DW$163, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
TI ARM Assembler PC v5.2.5 Mon Nov 16 12:40:39 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   42

    2189                            .dwattr $C$DW$163, DW_AT_decl_line(0x52)
    2190                            .dwattr $C$DW$163, DW_AT_decl_column(0x07)
    2191                    $C$DW$164       .dwtag  DW_TAG_member
    2192                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$20)
    2193                            .dwattr $C$DW$164, DW_AT_name("fsi_flag")
    2194                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("fsi_flag")
    2195                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2196                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2197                            .dwattr $C$DW$164, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2198                            .dwattr $C$DW$164, DW_AT_decl_line(0x53)
    2199                            .dwattr $C$DW$164, DW_AT_decl_column(0x07)
    2200                    $C$DW$165       .dwtag  DW_TAG_member
    2201                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$21)
    2202                            .dwattr $C$DW$165, DW_AT_name("id")
    2203                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("id")
    2204                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2205                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2206                            .dwattr $C$DW$165, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2207                            .dwattr $C$DW$165, DW_AT_decl_line(0x54)
    2208                            .dwattr $C$DW$165, DW_AT_decl_column(0x07)
    2209                    $C$DW$166       .dwtag  DW_TAG_member
    2210                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$21)
    2211                            .dwattr $C$DW$166, DW_AT_name("n_rootdir")
    2212                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("n_rootdir")
    2213                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2214                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2215                            .dwattr $C$DW$166, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2216                            .dwattr $C$DW$166, DW_AT_decl_line(0x55)
    2217                            .dwattr $C$DW$166, DW_AT_decl_column(0x07)
    2218                    $C$DW$167       .dwtag  DW_TAG_member
    2219                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$22)
    2220                            .dwattr $C$DW$167, DW_AT_name("last_clust")
    2221                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("last_clust")
    2222                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2223                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2224                            .dwattr $C$DW$167, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2225                            .dwattr $C$DW$167, DW_AT_decl_line(0x5d)
    2226                            .dwattr $C$DW$167, DW_AT_decl_column(0x08)
    2227                    $C$DW$168       .dwtag  DW_TAG_member
    2228                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$22)
    2229                            .dwattr $C$DW$168, DW_AT_name("free_clust")
    2230                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("free_clust")
    2231                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2232                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2233                            .dwattr $C$DW$168, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2234                            .dwattr $C$DW$168, DW_AT_decl_line(0x5e)
    2235                            .dwattr $C$DW$168, DW_AT_decl_column(0x08)
    2236                    $C$DW$169       .dwtag  DW_TAG_member
    2237                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$22)
    2238                            .dwattr $C$DW$169, DW_AT_name("fsi_sector")
    2239                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("fsi_sector")
    2240                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2241                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2242                            .dwattr $C$DW$169, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2243                            .dwattr $C$DW$169, DW_AT_decl_line(0x5f)
TI ARM Assembler PC v5.2.5 Mon Nov 16 12:40:39 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   43

    2244                            .dwattr $C$DW$169, DW_AT_decl_column(0x08)
    2245                    $C$DW$170       .dwtag  DW_TAG_member
    2246                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$22)
    2247                            .dwattr $C$DW$170, DW_AT_name("n_fatent")
    2248                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("n_fatent")
    2249                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2250                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2251                            .dwattr $C$DW$170, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2252                            .dwattr $C$DW$170, DW_AT_decl_line(0x64)
    2253                            .dwattr $C$DW$170, DW_AT_decl_column(0x08)
    2254                    $C$DW$171       .dwtag  DW_TAG_member
    2255                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$22)
    2256                            .dwattr $C$DW$171, DW_AT_name("fsize")
    2257                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("fsize")
    2258                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2259                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2260                            .dwattr $C$DW$171, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2261                            .dwattr $C$DW$171, DW_AT_decl_line(0x65)
    2262                            .dwattr $C$DW$171, DW_AT_decl_column(0x08)
    2263                    $C$DW$172       .dwtag  DW_TAG_member
    2264                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$22)
    2265                            .dwattr $C$DW$172, DW_AT_name("volbase")
    2266                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("volbase")
    2267                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2268                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2269                            .dwattr $C$DW$172, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2270                            .dwattr $C$DW$172, DW_AT_decl_line(0x66)
    2271                            .dwattr $C$DW$172, DW_AT_decl_column(0x08)
    2272                    $C$DW$173       .dwtag  DW_TAG_member
    2273                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$22)
    2274                            .dwattr $C$DW$173, DW_AT_name("fatbase")
    2275                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("fatbase")
    2276                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2277                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2278                            .dwattr $C$DW$173, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2279                            .dwattr $C$DW$173, DW_AT_decl_line(0x67)
    2280                            .dwattr $C$DW$173, DW_AT_decl_column(0x08)
    2281                    $C$DW$174       .dwtag  DW_TAG_member
    2282                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$22)
    2283                            .dwattr $C$DW$174, DW_AT_name("dirbase")
    2284                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("dirbase")
    2285                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2286                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2287                            .dwattr $C$DW$174, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2288                            .dwattr $C$DW$174, DW_AT_decl_line(0x68)
    2289                            .dwattr $C$DW$174, DW_AT_decl_column(0x08)
    2290                    $C$DW$175       .dwtag  DW_TAG_member
    2291                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$22)
    2292                            .dwattr $C$DW$175, DW_AT_name("database")
    2293                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("database")
    2294                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2295                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2296                            .dwattr $C$DW$175, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2297                            .dwattr $C$DW$175, DW_AT_decl_line(0x69)
    2298                            .dwattr $C$DW$175, DW_AT_decl_column(0x08)
TI ARM Assembler PC v5.2.5 Mon Nov 16 12:40:39 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   44

    2299                    $C$DW$176       .dwtag  DW_TAG_member
    2300                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$22)
    2301                            .dwattr $C$DW$176, DW_AT_name("winsect")
    2302                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("winsect")
    2303                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2304                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2305                            .dwattr $C$DW$176, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2306                            .dwattr $C$DW$176, DW_AT_decl_line(0x6a)
    2307                            .dwattr $C$DW$176, DW_AT_decl_column(0x08)
    2308                    $C$DW$177       .dwtag  DW_TAG_member
    2309                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$23)
    2310                            .dwattr $C$DW$177, DW_AT_name("win")
    2311                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("win")
    2312                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2313                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2314                            .dwattr $C$DW$177, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2315                            .dwattr $C$DW$177, DW_AT_decl_line(0x6b)
    2316                            .dwattr $C$DW$177, DW_AT_decl_column(0x07)
    2317                            .dwendtag $C$DW$T$24
    2318                    
    2319                            .dwattr $C$DW$T$24, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2320                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x4d)
    2321                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    2322                    $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("FATFS")
    2323                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    2324                            .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    2325                            .dwattr $C$DW$T$25, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2326                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x6c)
    2327                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x03)
    2328                    $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    2329                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    2330                            .dwattr $C$DW$T$26, DW_AT_address_class(0x20)
    2331                    
    2332                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2333                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x224)
    2334                    $C$DW$178       .dwtag  DW_TAG_member
    2335                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$26)
    2336                            .dwattr $C$DW$178, DW_AT_name("fs")
    2337                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("fs")
    2338                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2339                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2340                            .dwattr $C$DW$178, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2341                            .dwattr $C$DW$178, DW_AT_decl_line(0x73)
    2342                            .dwattr $C$DW$178, DW_AT_decl_column(0x09)
    2343                    $C$DW$179       .dwtag  DW_TAG_member
    2344                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$21)
    2345                            .dwattr $C$DW$179, DW_AT_name("id")
    2346                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("id")
    2347                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2348                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2349                            .dwattr $C$DW$179, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2350                            .dwattr $C$DW$179, DW_AT_decl_line(0x74)
    2351                            .dwattr $C$DW$179, DW_AT_decl_column(0x07)
    2352                    $C$DW$180       .dwtag  DW_TAG_member
    2353                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$20)
TI ARM Assembler PC v5.2.5 Mon Nov 16 12:40:39 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   45

    2354                            .dwattr $C$DW$180, DW_AT_name("flag")
    2355                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("flag")
    2356                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2357                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2358                            .dwattr $C$DW$180, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2359                            .dwattr $C$DW$180, DW_AT_decl_line(0x75)
    2360                            .dwattr $C$DW$180, DW_AT_decl_column(0x07)
    2361                    $C$DW$181       .dwtag  DW_TAG_member
    2362                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$20)
    2363                            .dwattr $C$DW$181, DW_AT_name("pad1")
    2364                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("pad1")
    2365                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2366                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2367                            .dwattr $C$DW$181, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2368                            .dwattr $C$DW$181, DW_AT_decl_line(0x76)
    2369                            .dwattr $C$DW$181, DW_AT_decl_column(0x07)
    2370                    $C$DW$182       .dwtag  DW_TAG_member
    2371                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$22)
    2372                            .dwattr $C$DW$182, DW_AT_name("fptr")
    2373                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("fptr")
    2374                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2375                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2376                            .dwattr $C$DW$182, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2377                            .dwattr $C$DW$182, DW_AT_decl_line(0x77)
    2378                            .dwattr $C$DW$182, DW_AT_decl_column(0x08)
    2379                    $C$DW$183       .dwtag  DW_TAG_member
    2380                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$22)
    2381                            .dwattr $C$DW$183, DW_AT_name("fsize")
    2382                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("fsize")
    2383                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2384                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2385                            .dwattr $C$DW$183, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2386                            .dwattr $C$DW$183, DW_AT_decl_line(0x78)
    2387                            .dwattr $C$DW$183, DW_AT_decl_column(0x08)
    2388                    $C$DW$184       .dwtag  DW_TAG_member
    2389                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$22)
    2390                            .dwattr $C$DW$184, DW_AT_name("sclust")
    2391                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("sclust")
    2392                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2393                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2394                            .dwattr $C$DW$184, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2395                            .dwattr $C$DW$184, DW_AT_decl_line(0x79)
    2396                            .dwattr $C$DW$184, DW_AT_decl_column(0x08)
    2397                    $C$DW$185       .dwtag  DW_TAG_member
    2398                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$22)
    2399                            .dwattr $C$DW$185, DW_AT_name("clust")
    2400                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("clust")
    2401                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2402                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2403                            .dwattr $C$DW$185, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2404                            .dwattr $C$DW$185, DW_AT_decl_line(0x7a)
    2405                            .dwattr $C$DW$185, DW_AT_decl_column(0x08)
    2406                    $C$DW$186       .dwtag  DW_TAG_member
    2407                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$22)
    2408                            .dwattr $C$DW$186, DW_AT_name("dsect")
TI ARM Assembler PC v5.2.5 Mon Nov 16 12:40:39 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   46

    2409                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("dsect")
    2410                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2411                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2412                            .dwattr $C$DW$186, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2413                            .dwattr $C$DW$186, DW_AT_decl_line(0x7b)
    2414                            .dwattr $C$DW$186, DW_AT_decl_column(0x08)
    2415                    $C$DW$187       .dwtag  DW_TAG_member
    2416                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$22)
    2417                            .dwattr $C$DW$187, DW_AT_name("dir_sect")
    2418                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("dir_sect")
    2419                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2420                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2421                            .dwattr $C$DW$187, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2422                            .dwattr $C$DW$187, DW_AT_decl_line(0x7d)
    2423                            .dwattr $C$DW$187, DW_AT_decl_column(0x08)
    2424                    $C$DW$188       .dwtag  DW_TAG_member
    2425                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$27)
    2426                            .dwattr $C$DW$188, DW_AT_name("dir_ptr")
    2427                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("dir_ptr")
    2428                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2429                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2430                            .dwattr $C$DW$188, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2431                            .dwattr $C$DW$188, DW_AT_decl_line(0x7e)
    2432                            .dwattr $C$DW$188, DW_AT_decl_column(0x08)
    2433                    $C$DW$189       .dwtag  DW_TAG_member
    2434                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$23)
    2435                            .dwattr $C$DW$189, DW_AT_name("buf")
    2436                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("buf")
    2437                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2438                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2439                            .dwattr $C$DW$189, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2440                            .dwattr $C$DW$189, DW_AT_decl_line(0x87)
    2441                            .dwattr $C$DW$189, DW_AT_decl_column(0x07)
    2442                            .dwendtag $C$DW$T$28
    2443                    
    2444                            .dwattr $C$DW$T$28, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2445                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x72)
    2446                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    2447                    $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("FIL")
    2448                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$28)
    2449                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    2450                            .dwattr $C$DW$T$45, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2451                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x89)
    2452                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x03)
    2453                    
    2454                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2455                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x1c)
    2456                    $C$DW$190       .dwtag  DW_TAG_member
    2457                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$26)
    2458                            .dwattr $C$DW$190, DW_AT_name("fs")
    2459                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("fs")
    2460                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2461                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2462                            .dwattr $C$DW$190, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2463                            .dwattr $C$DW$190, DW_AT_decl_line(0x90)
TI ARM Assembler PC v5.2.5 Mon Nov 16 12:40:39 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   47

    2464                            .dwattr $C$DW$190, DW_AT_decl_column(0x09)
    2465                    $C$DW$191       .dwtag  DW_TAG_member
    2466                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$21)
    2467                            .dwattr $C$DW$191, DW_AT_name("id")
    2468                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("id")
    2469                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2470                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2471                            .dwattr $C$DW$191, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2472                            .dwattr $C$DW$191, DW_AT_decl_line(0x91)
    2473                            .dwattr $C$DW$191, DW_AT_decl_column(0x07)
    2474                    $C$DW$192       .dwtag  DW_TAG_member
    2475                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$21)
    2476                            .dwattr $C$DW$192, DW_AT_name("index")
    2477                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("index")
    2478                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2479                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2480                            .dwattr $C$DW$192, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2481                            .dwattr $C$DW$192, DW_AT_decl_line(0x92)
    2482                            .dwattr $C$DW$192, DW_AT_decl_column(0x07)
    2483                    $C$DW$193       .dwtag  DW_TAG_member
    2484                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$22)
    2485                            .dwattr $C$DW$193, DW_AT_name("sclust")
    2486                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("sclust")
    2487                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2488                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2489                            .dwattr $C$DW$193, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2490                            .dwattr $C$DW$193, DW_AT_decl_line(0x93)
    2491                            .dwattr $C$DW$193, DW_AT_decl_column(0x08)
    2492                    $C$DW$194       .dwtag  DW_TAG_member
    2493                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$22)
    2494                            .dwattr $C$DW$194, DW_AT_name("clust")
    2495                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("clust")
    2496                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2497                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2498                            .dwattr $C$DW$194, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2499                            .dwattr $C$DW$194, DW_AT_decl_line(0x94)
    2500                            .dwattr $C$DW$194, DW_AT_decl_column(0x08)
    2501                    $C$DW$195       .dwtag  DW_TAG_member
    2502                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$22)
    2503                            .dwattr $C$DW$195, DW_AT_name("sect")
    2504                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("sect")
    2505                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2506                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2507                            .dwattr $C$DW$195, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2508                            .dwattr $C$DW$195, DW_AT_decl_line(0x95)
    2509                            .dwattr $C$DW$195, DW_AT_decl_column(0x08)
    2510                    $C$DW$196       .dwtag  DW_TAG_member
    2511                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$27)
    2512                            .dwattr $C$DW$196, DW_AT_name("dir")
    2513                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("dir")
    2514                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2515                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2516                            .dwattr $C$DW$196, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2517                            .dwattr $C$DW$196, DW_AT_decl_line(0x96)
    2518                            .dwattr $C$DW$196, DW_AT_decl_column(0x08)
TI ARM Assembler PC v5.2.5 Mon Nov 16 12:40:39 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   48

    2519                    $C$DW$197       .dwtag  DW_TAG_member
    2520                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$27)
    2521                            .dwattr $C$DW$197, DW_AT_name("fn")
    2522                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("fn")
    2523                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2524                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2525                            .dwattr $C$DW$197, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2526                            .dwattr $C$DW$197, DW_AT_decl_line(0x97)
    2527                            .dwattr $C$DW$197, DW_AT_decl_column(0x08)
    2528                            .dwendtag $C$DW$T$29
    2529                    
    2530                            .dwattr $C$DW$T$29, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2531                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x8f)
    2532                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    2533                    $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("DIR")
    2534                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$29)
    2535                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    2536                            .dwattr $C$DW$T$46, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2537                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x9c)
    2538                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x03)
    2539                    
    2540                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2541                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x18)
    2542                    $C$DW$198       .dwtag  DW_TAG_member
    2543                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$22)
    2544                            .dwattr $C$DW$198, DW_AT_name("fsize")
    2545                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("fsize")
    2546                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2547                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2548                            .dwattr $C$DW$198, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2549                            .dwattr $C$DW$198, DW_AT_decl_line(0xa3)
    2550                            .dwattr $C$DW$198, DW_AT_decl_column(0x08)
    2551                    $C$DW$199       .dwtag  DW_TAG_member
    2552                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$21)
    2553                            .dwattr $C$DW$199, DW_AT_name("fdate")
    2554                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("fdate")
    2555                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2556                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2557                            .dwattr $C$DW$199, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2558                            .dwattr $C$DW$199, DW_AT_decl_line(0xa4)
    2559                            .dwattr $C$DW$199, DW_AT_decl_column(0x07)
    2560                    $C$DW$200       .dwtag  DW_TAG_member
    2561                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$21)
    2562                            .dwattr $C$DW$200, DW_AT_name("ftime")
    2563                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("ftime")
    2564                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2565                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2566                            .dwattr $C$DW$200, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2567                            .dwattr $C$DW$200, DW_AT_decl_line(0xa5)
    2568                            .dwattr $C$DW$200, DW_AT_decl_column(0x07)
    2569                    $C$DW$201       .dwtag  DW_TAG_member
    2570                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$20)
    2571                            .dwattr $C$DW$201, DW_AT_name("fattrib")
    2572                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("fattrib")
    2573                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TI ARM Assembler PC v5.2.5 Mon Nov 16 12:40:39 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   49

    2574                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2575                            .dwattr $C$DW$201, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2576                            .dwattr $C$DW$201, DW_AT_decl_line(0xa6)
    2577                            .dwattr $C$DW$201, DW_AT_decl_column(0x07)
    2578                    $C$DW$202       .dwtag  DW_TAG_member
    2579                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$32)
    2580                            .dwattr $C$DW$202, DW_AT_name("fname")
    2581                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("fname")
    2582                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2583                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2584                            .dwattr $C$DW$202, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2585                            .dwattr $C$DW$202, DW_AT_decl_line(0xa7)
    2586                            .dwattr $C$DW$202, DW_AT_decl_column(0x08)
    2587                            .dwendtag $C$DW$T$33
    2588                    
    2589                            .dwattr $C$DW$T$33, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2590                            .dwattr $C$DW$T$33, DW_AT_decl_line(0xa2)
    2591                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    2592                    $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("FILINFO")
    2593                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$33)
    2594                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    2595                            .dwattr $C$DW$T$47, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2596                            .dwattr $C$DW$T$47, DW_AT_decl_line(0xac)
    2597                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x03)
    2598                    
    2599                    $C$DW$T$35      .dwtag  DW_TAG_union_type
    2600                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x10)
    2601                    $C$DW$203       .dwtag  DW_TAG_member
    2602                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$34)
    2603                            .dwattr $C$DW$203, DW_AT_name("_Us")
    2604                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("_Us")
    2605                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2606                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2607                            .dwattr $C$DW$203, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2608                            .dwattr $C$DW$203, DW_AT_decl_line(0x3a)
    2609                            .dwattr $C$DW$203, DW_AT_decl_column(0x12)
    2610                    $C$DW$204       .dwtag  DW_TAG_member
    2611                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$16)
    2612                            .dwattr $C$DW$204, DW_AT_name("_Float")
    2613                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("_Float")
    2614                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2615                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2616                            .dwattr $C$DW$204, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2617                            .dwattr $C$DW$204, DW_AT_decl_line(0x3b)
    2618                            .dwattr $C$DW$204, DW_AT_decl_column(0x09)
    2619                    $C$DW$205       .dwtag  DW_TAG_member
    2620                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$17)
    2621                            .dwattr $C$DW$205, DW_AT_name("_Double")
    2622                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("_Double")
    2623                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2624                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2625                            .dwattr $C$DW$205, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2626                            .dwattr $C$DW$205, DW_AT_decl_line(0x3c)
    2627                            .dwattr $C$DW$205, DW_AT_decl_column(0x0a)
    2628                    $C$DW$206       .dwtag  DW_TAG_member
TI ARM Assembler PC v5.2.5 Mon Nov 16 12:40:39 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   50

    2629                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$18)
    2630                            .dwattr $C$DW$206, DW_AT_name("_Long_double")
    2631                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("_Long_double")
    2632                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2633                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2634                            .dwattr $C$DW$206, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2635                            .dwattr $C$DW$206, DW_AT_decl_line(0x3d)
    2636                            .dwattr $C$DW$206, DW_AT_decl_column(0x0f)
    2637                            .dwendtag $C$DW$T$35
    2638                    
    2639                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float
    2640                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x39)
    2641                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x03)
    2642                    
    2643                    $C$DW$T$36      .dwtag  DW_TAG_union_type
    2644                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x10)
    2645                    $C$DW$207       .dwtag  DW_TAG_member
    2646                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$34)
    2647                            .dwattr $C$DW$207, DW_AT_name("_Word")
    2648                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("_Word")
    2649                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2650                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2651                            .dwattr $C$DW$207, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath.
    2652                            .dwattr $C$DW$207, DW_AT_decl_line(0x8f)
    2653                            .dwattr $C$DW$207, DW_AT_decl_column(0x11)
    2654                    $C$DW$208       .dwtag  DW_TAG_member
    2655                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$16)
    2656                            .dwattr $C$DW$208, DW_AT_name("_Float")
    2657                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("_Float")
    2658                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2659                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2660                            .dwattr $C$DW$208, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath.
    2661                            .dwattr $C$DW$208, DW_AT_decl_line(0x90)
    2662                            .dwattr $C$DW$208, DW_AT_decl_column(0x08)
    2663                    $C$DW$209       .dwtag  DW_TAG_member
    2664                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$17)
    2665                            .dwattr $C$DW$209, DW_AT_name("_Double")
    2666                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("_Double")
    2667                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2668                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2669                            .dwattr $C$DW$209, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath.
    2670                            .dwattr $C$DW$209, DW_AT_decl_line(0x91)
    2671                            .dwattr $C$DW$209, DW_AT_decl_column(0x09)
    2672                    $C$DW$210       .dwtag  DW_TAG_member
    2673                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$18)
    2674                            .dwattr $C$DW$210, DW_AT_name("_Long_double")
    2675                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("_Long_double")
    2676                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2677                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2678                            .dwattr $C$DW$210, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath.
    2679                            .dwattr $C$DW$210, DW_AT_decl_line(0x92)
    2680                            .dwattr $C$DW$210, DW_AT_decl_column(0x0e)
    2681                            .dwendtag $C$DW$T$36
    2682                    
    2683                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath
TI ARM Assembler PC v5.2.5 Mon Nov 16 12:40:39 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   51

    2684                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x8e)
    2685                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x02)
    2686                    $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("_Dconst")
    2687                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$36)
    2688                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    2689                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath
    2690                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x93)
    2691                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x04)
    2692                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2693                            .dwattr $C$DW$T$2, DW_AT_name("void")
    2694                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2695                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2696                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2697                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    2698                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2699                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    2700                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2701                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    2702                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2703                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2704                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2705                    $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    2706                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$5)
    2707                            .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    2708                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2709                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x2a)
    2710                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x1d)
    2711                    $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
    2712                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    2713                            .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    2714                            .dwattr $C$DW$T$72, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2715                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x37)
    2716                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x17)
    2717                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    2718                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2719                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2720                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2721                    $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("BYTE")
    2722                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$6)
    2723                            .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    2724                            .dwattr $C$DW$T$20, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2725                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x16)
    2726                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x17)
    2727                    $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("DSTATUS")
    2728                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$20)
    2729                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    2730                            .dwattr $C$DW$T$73, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2731                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x13)
    2732                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x0e)
    2733                    
    2734                    $C$DW$T$23      .dwtag  DW_TAG_array_type
    2735                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$20)
    2736                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    2737                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x200)
    2738                    $C$DW$211       .dwtag  DW_TAG_subrange_type
TI ARM Assembler PC v5.2.5 Mon Nov 16 12:40:39 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   52

    2739                            .dwattr $C$DW$211, DW_AT_upper_bound(0x1ff)
    2740                            .dwendtag $C$DW$T$23
    2741                    
    2742                    $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    2743                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$20)
    2744                            .dwattr $C$DW$T$27, DW_AT_address_class(0x20)
    2745                    $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("UCHAR")
    2746                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$6)
    2747                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    2748                            .dwattr $C$DW$T$74, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2749                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x15)
    2750                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x17)
    2751                    $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    2752                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$6)
    2753                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    2754                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2755                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x2b)
    2756                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x1c)
    2757                    $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
    2758                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$50)
    2759                            .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    2760                            .dwattr $C$DW$T$77, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2761                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x38)
    2762                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x16)
    2763                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    2764                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2765                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2766                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    2767                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    2768                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2769                            .dwattr $C$DW$T$8, DW_AT_name("short")
    2770                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    2771                    $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("SHORT")
    2772                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$8)
    2773                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    2774                            .dwattr $C$DW$T$78, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2775                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x19)
    2776                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x11)
    2777                    $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
    2778                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$8)
    2779                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    2780                            .dwattr $C$DW$T$79, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2781                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x2c)
    2782                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x1d)
    2783                    $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
    2784                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    2785                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    2786                            .dwattr $C$DW$T$80, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2787                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x3a)
    2788                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x17)
    2789                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    2790                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2791                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2792                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    2793                    $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("USHORT")
TI ARM Assembler PC v5.2.5 Mon Nov 16 12:40:39 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   53

    2794                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$9)
    2795                            .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    2796                            .dwattr $C$DW$T$81, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2797                            .dwattr $C$DW$T$81, DW_AT_decl_line(0x1a)
    2798                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x18)
    2799                    $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("WCHAR")
    2800                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$9)
    2801                            .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    2802                            .dwattr $C$DW$T$82, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2803                            .dwattr $C$DW$T$82, DW_AT_decl_line(0x1c)
    2804                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x18)
    2805                    $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("WORD")
    2806                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$9)
    2807                            .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    2808                            .dwattr $C$DW$T$21, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2809                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x1b)
    2810                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x18)
    2811                    $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("_Wchart")
    2812                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$9)
    2813                            .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    2814                            .dwattr $C$DW$T$83, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yvals
    2815                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x1e5)
    2816                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x21)
    2817                    $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("_Wintt")
    2818                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$9)
    2819                            .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    2820                            .dwattr $C$DW$T$84, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yvals
    2821                            .dwattr $C$DW$T$84, DW_AT_decl_line(0x1e6)
    2822                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x21)
    2823                    
    2824                    $C$DW$T$34      .dwtag  DW_TAG_array_type
    2825                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$9)
    2826                            .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    2827                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x10)
    2828                    $C$DW$212       .dwtag  DW_TAG_subrange_type
    2829                            .dwattr $C$DW$212, DW_AT_upper_bound(0x07)
    2830                            .dwendtag $C$DW$T$34
    2831                    
    2832                    $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    2833                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$9)
    2834                            .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    2835                            .dwattr $C$DW$T$85, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2836                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x2d)
    2837                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x1c)
    2838                    $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
    2839                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    2840                            .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    2841                            .dwattr $C$DW$T$86, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2842                            .dwattr $C$DW$T$86, DW_AT_decl_line(0x3b)
    2843                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x16)
    2844                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    2845                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2846                            .dwattr $C$DW$T$10, DW_AT_name("int")
    2847                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    2848                    $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("INT")
TI ARM Assembler PC v5.2.5 Mon Nov 16 12:40:39 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   54

    2849                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$10)
    2850                            .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    2851                            .dwattr $C$DW$T$87, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2852                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x10)
    2853                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x10)
    2854                    $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("_Ptrdifft")
    2855                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$10)
    2856                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    2857                            .dwattr $C$DW$T$88, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yvals
    2858                            .dwattr $C$DW$T$88, DW_AT_decl_line(0xa9)
    2859                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x1e)
    2860                    $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
    2861                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$10)
    2862                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    2863                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2864                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x2e)
    2865                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x1d)
    2866                    $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast16_t")
    2867                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    2868                            .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    2869                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2870                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x47)
    2871                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x17)
    2872                    $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast32_t")
    2873                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$90)
    2874                            .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    2875                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2876                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x4a)
    2877                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x17)
    2878                    $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast8_t")
    2879                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$90)
    2880                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    2881                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2882                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x45)
    2883                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x17)
    2884                    $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("int_least32_t")
    2885                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$90)
    2886                            .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    2887                            .dwattr $C$DW$T$94, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2888                            .dwattr $C$DW$T$94, DW_AT_decl_line(0x3c)
    2889                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x17)
    2890                    $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("intptr_t")
    2891                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$10)
    2892                            .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    2893                            .dwattr $C$DW$T$95, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2894                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x52)
    2895                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x1a)
    2896                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    2897                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2898                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    2899                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    2900                    $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("UINT")
    2901                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$11)
    2902                            .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    2903                            .dwattr $C$DW$T$96, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
TI ARM Assembler PC v5.2.5 Mon Nov 16 12:40:39 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   55

    2904                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x11)
    2905                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x16)
    2906                    $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("_Sizet")
    2907                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$11)
    2908                            .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    2909                            .dwattr $C$DW$T$97, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yvals
    2910                            .dwattr $C$DW$T$97, DW_AT_decl_line(0xab)
    2911                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x1a)
    2912                    $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("_TI_uint32_t")
    2913                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$11)
    2914                            .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    2915                            .dwattr $C$DW$T$98, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath
    2916                            .dwattr $C$DW$T$98, DW_AT_decl_line(0xb6)
    2917                            .dwattr $C$DW$T$98, DW_AT_decl_column(0x19)
    2918                    $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
    2919                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$11)
    2920                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    2921                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2922                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x2f)
    2923                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x1c)
    2924                    $C$DW$T$104     .dwtag  DW_TAG_volatile_type
    2925                            .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$49)
    2926                    $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast16_t")
    2927                            .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$49)
    2928                            .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    2929                            .dwattr $C$DW$T$105, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    2930                            .dwattr $C$DW$T$105, DW_AT_decl_line(0x48)
    2931                            .dwattr $C$DW$T$105, DW_AT_decl_column(0x16)
    2932                    $C$DW$T$106     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast32_t")
    2933                            .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$49)
    2934                            .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    2935                            .dwattr $C$DW$T$106, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    2936                            .dwattr $C$DW$T$106, DW_AT_decl_line(0x4b)
    2937                            .dwattr $C$DW$T$106, DW_AT_decl_column(0x16)
    2938                    $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast8_t")
    2939                            .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$49)
    2940                            .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    2941                            .dwattr $C$DW$T$107, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    2942                            .dwattr $C$DW$T$107, DW_AT_decl_line(0x46)
    2943                            .dwattr $C$DW$T$107, DW_AT_decl_column(0x16)
    2944                    $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least32_t")
    2945                            .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$49)
    2946                            .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
    2947                            .dwattr $C$DW$T$108, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    2948                            .dwattr $C$DW$T$108, DW_AT_decl_line(0x3d)
    2949                            .dwattr $C$DW$T$108, DW_AT_decl_column(0x16)
    2950                    $C$DW$T$109     .dwtag  DW_TAG_typedef, DW_AT_name("uintptr_t")
    2951                            .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$11)
    2952                            .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    2953                            .dwattr $C$DW$T$109, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    2954                            .dwattr $C$DW$T$109, DW_AT_decl_line(0x53)
    2955                            .dwattr $C$DW$T$109, DW_AT_decl_column(0x1a)
    2956                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    2957                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    2958                            .dwattr $C$DW$T$12, DW_AT_name("long")
TI ARM Assembler PC v5.2.5 Mon Nov 16 12:40:39 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   56

    2959                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    2960                    $C$DW$T$110     .dwtag  DW_TAG_typedef, DW_AT_name("LONG")
    2961                            .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$12)
    2962                            .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    2963                            .dwattr $C$DW$T$110, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2964                            .dwattr $C$DW$T$110, DW_AT_decl_line(0x1f)
    2965                            .dwattr $C$DW$T$110, DW_AT_decl_column(0x10)
    2966                    $C$DW$T$111     .dwtag  DW_TAG_typedef, DW_AT_name("_Int32t")
    2967                            .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$12)
    2968                            .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
    2969                            .dwattr $C$DW$T$111, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yval
    2970                            .dwattr $C$DW$T$111, DW_AT_decl_line(0xa6)
    2971                            .dwattr $C$DW$T$111, DW_AT_decl_column(0x0e)
    2972                    $C$DW$T$13      .dwtag  DW_TAG_base_type
    2973                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    2974                            .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    2975                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
    2976                    $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("DWORD")
    2977                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$13)
    2978                            .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    2979                            .dwattr $C$DW$T$22, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2980                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x21)
    2981                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x17)
    2982                    $C$DW$T$112     .dwtag  DW_TAG_typedef, DW_AT_name("ULONG")
    2983                            .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$13)
    2984                            .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    2985                            .dwattr $C$DW$T$112, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2986                            .dwattr $C$DW$T$112, DW_AT_decl_line(0x20)
    2987                            .dwattr $C$DW$T$112, DW_AT_decl_column(0x17)
    2988                    $C$DW$T$113     .dwtag  DW_TAG_typedef, DW_AT_name("_Uint32t")
    2989                            .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$13)
    2990                            .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    2991                            .dwattr $C$DW$T$113, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yval
    2992                            .dwattr $C$DW$T$113, DW_AT_decl_line(0xa7)
    2993                            .dwattr $C$DW$T$113, DW_AT_decl_column(0x17)
    2994                    $C$DW$T$14      .dwtag  DW_TAG_base_type
    2995                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    2996                            .dwattr $C$DW$T$14, DW_AT_name("long long")
    2997                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    2998                    $C$DW$T$114     .dwtag  DW_TAG_typedef, DW_AT_name("_Longlong")
    2999                            .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$14)
    3000                            .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    3001                            .dwattr $C$DW$T$114, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yval
    3002                            .dwattr $C$DW$T$114, DW_AT_decl_line(0x1b5)
    3003                            .dwattr $C$DW$T$114, DW_AT_decl_column(0x13)
    3004                    $C$DW$T$115     .dwtag  DW_TAG_typedef, DW_AT_name("int64_t")
    3005                            .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$14)
    3006                            .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
    3007                            .dwattr $C$DW$T$115, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3008                            .dwattr $C$DW$T$115, DW_AT_decl_line(0x32)
    3009                            .dwattr $C$DW$T$115, DW_AT_decl_column(0x21)
    3010                    $C$DW$T$116     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast64_t")
    3011                            .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$115)
    3012                            .dwattr $C$DW$T$116, DW_AT_language(DW_LANG_C)
    3013                            .dwattr $C$DW$T$116, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
TI ARM Assembler PC v5.2.5 Mon Nov 16 12:40:39 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   57

    3014                            .dwattr $C$DW$T$116, DW_AT_decl_line(0x4e)
    3015                            .dwattr $C$DW$T$116, DW_AT_decl_column(0x17)
    3016                    $C$DW$T$117     .dwtag  DW_TAG_typedef, DW_AT_name("int_least64_t")
    3017                            .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$115)
    3018                            .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
    3019                            .dwattr $C$DW$T$117, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3020                            .dwattr $C$DW$T$117, DW_AT_decl_line(0x40)
    3021                            .dwattr $C$DW$T$117, DW_AT_decl_column(0x17)
    3022                    $C$DW$T$118     .dwtag  DW_TAG_typedef, DW_AT_name("intmax_t")
    3023                            .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$14)
    3024                            .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
    3025                            .dwattr $C$DW$T$118, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3026                            .dwattr $C$DW$T$118, DW_AT_decl_line(0x56)
    3027                            .dwattr $C$DW$T$118, DW_AT_decl_column(0x20)
    3028                    $C$DW$T$15      .dwtag  DW_TAG_base_type
    3029                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    3030                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    3031                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    3032                    $C$DW$T$119     .dwtag  DW_TAG_typedef, DW_AT_name("_TI_uint64_t")
    3033                            .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$15)
    3034                            .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    3035                            .dwattr $C$DW$T$119, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymat
    3036                            .dwattr $C$DW$T$119, DW_AT_decl_line(0xbc)
    3037                            .dwattr $C$DW$T$119, DW_AT_decl_column(0x1c)
    3038                    $C$DW$T$120     .dwtag  DW_TAG_typedef, DW_AT_name("_ULonglong")
    3039                            .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$15)
    3040                            .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    3041                            .dwattr $C$DW$T$120, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yval
    3042                            .dwattr $C$DW$T$120, DW_AT_decl_line(0x1b6)
    3043                            .dwattr $C$DW$T$120, DW_AT_decl_column(0x14)
    3044                    $C$DW$T$121     .dwtag  DW_TAG_typedef, DW_AT_name("uint64_t")
    3045                            .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$15)
    3046                            .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    3047                            .dwattr $C$DW$T$121, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3048                            .dwattr $C$DW$T$121, DW_AT_decl_line(0x33)
    3049                            .dwattr $C$DW$T$121, DW_AT_decl_column(0x20)
    3050                    $C$DW$T$122     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast64_t")
    3051                            .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$121)
    3052                            .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    3053                            .dwattr $C$DW$T$122, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3054                            .dwattr $C$DW$T$122, DW_AT_decl_line(0x4f)
    3055                            .dwattr $C$DW$T$122, DW_AT_decl_column(0x16)
    3056                    $C$DW$T$123     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least64_t")
    3057                            .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$121)
    3058                            .dwattr $C$DW$T$123, DW_AT_language(DW_LANG_C)
    3059                            .dwattr $C$DW$T$123, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3060                            .dwattr $C$DW$T$123, DW_AT_decl_line(0x41)
    3061                            .dwattr $C$DW$T$123, DW_AT_decl_column(0x16)
    3062                    $C$DW$T$124     .dwtag  DW_TAG_typedef, DW_AT_name("uintmax_t")
    3063                            .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$15)
    3064                            .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
    3065                            .dwattr $C$DW$T$124, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3066                            .dwattr $C$DW$T$124, DW_AT_decl_line(0x57)
    3067                            .dwattr $C$DW$T$124, DW_AT_decl_column(0x20)
    3068                    $C$DW$T$16      .dwtag  DW_TAG_base_type
TI ARM Assembler PC v5.2.5 Mon Nov 16 12:40:39 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   58

    3069                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    3070                            .dwattr $C$DW$T$16, DW_AT_name("float")
    3071                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
