TI ARM Assembler PC v5.2.5 Tue Oct 27 17:18:45 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                             PC v5.2.5 *
       3                    ;* Date/Time created: Tue Oct 27 17:18:44 2015                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --disab
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../timers.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.2.5 Copyright (c) 1996-2015 Te
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("E:\Dev\Ti\Code\GIT\LaunchpadRoomControl\LaunchpadRoomControl
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("GPIOPinWrite")

    2080                    $C$DW$145       .dwtag  DW_TAG_enumerator, DW_AT_name("FR_NOT_ENOUGH_CORE"), DW_AT_const_value(0x11)
    2081                            .dwattr $C$DW$145, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2082                            .dwattr $C$DW$145, DW_AT_decl_line(0xc4)
    2083                            .dwattr $C$DW$145, DW_AT_decl_column(0x02)
    2084                    $C$DW$146       .dwtag  DW_TAG_enumerator, DW_AT_name("FR_TOO_MANY_OPEN_FILES"), DW_AT_const_value(0x1
    2085                            .dwattr $C$DW$146, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2086                            .dwattr $C$DW$146, DW_AT_decl_line(0xc5)
    2087                            .dwattr $C$DW$146, DW_AT_decl_column(0x02)
    2088                    $C$DW$147       .dwtag  DW_TAG_enumerator, DW_AT_name("FR_INVALID_PARAMETER"), DW_AT_const_value(0x13)
    2089                            .dwattr $C$DW$147, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2090                            .dwattr $C$DW$147, DW_AT_decl_line(0xc6)
    2091                            .dwattr $C$DW$147, DW_AT_decl_column(0x02)
    2092                            .dwendtag $C$DW$T$40
    2093                    
    2094                            .dwattr $C$DW$T$40, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2095                            .dwattr $C$DW$T$40, DW_AT_decl_line(0xb2)
    2096                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x0e)
    2097                    $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("FRESULT")
    2098                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    2099                            .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    2100                            .dwattr $C$DW$T$41, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2101                            .dwattr $C$DW$T$41, DW_AT_decl_line(0xc7)
    2102                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x03)
    2103                    
TI ARM Assembler PC v5.2.5 Tue Oct 27 17:18:45 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   40

    2104                    $C$DW$T$42      .dwtag  DW_TAG_enumeration_type
    2105                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    2106                    $C$DW$148       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_OK"), DW_AT_const_value(0x00)
    2107                            .dwattr $C$DW$148, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2108                            .dwattr $C$DW$148, DW_AT_decl_line(0x17)
    2109                            .dwattr $C$DW$148, DW_AT_decl_column(0x02)
    2110                    $C$DW$149       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_ERROR"), DW_AT_const_value(0x01)
    2111                            .dwattr $C$DW$149, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2112                            .dwattr $C$DW$149, DW_AT_decl_line(0x18)
    2113                            .dwattr $C$DW$149, DW_AT_decl_column(0x02)
    2114                    $C$DW$150       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_WRPRT"), DW_AT_const_value(0x02)
    2115                            .dwattr $C$DW$150, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2116                            .dwattr $C$DW$150, DW_AT_decl_line(0x19)
    2117                            .dwattr $C$DW$150, DW_AT_decl_column(0x02)
    2118                    $C$DW$151       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_NOTRDY"), DW_AT_const_value(0x03)
    2119                            .dwattr $C$DW$151, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2120                            .dwattr $C$DW$151, DW_AT_decl_line(0x1a)
    2121                            .dwattr $C$DW$151, DW_AT_decl_column(0x02)
    2122                    $C$DW$152       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_PARERR"), DW_AT_const_value(0x04)
    2123                            .dwattr $C$DW$152, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2124                            .dwattr $C$DW$152, DW_AT_decl_line(0x1b)
    2125                            .dwattr $C$DW$152, DW_AT_decl_column(0x02)
    2126                            .dwendtag $C$DW$T$42
    2127                    
    2128                            .dwattr $C$DW$T$42, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2129                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x16)
    2130                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x0e)
    2131                    $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("DRESULT")
    2132                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    2133                            .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    2134                            .dwattr $C$DW$T$43, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2135                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x1c)
    2136                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x03)
    2137                    
    2138                    $C$DW$T$19      .dwtag  DW_TAG_structure_type
    2139                            .dwattr $C$DW$T$19, DW_AT_byte_size(0x48)
    2140                    $C$DW$153       .dwtag  DW_TAG_member
    2141                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$10)
    2142                            .dwattr $C$DW$153, DW_AT_name("_Ddig")
    2143                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("_Ddig")
    2144                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2145                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2146                            .dwattr $C$DW$153, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2147                            .dwattr $C$DW$153, DW_AT_decl_line(0x37)
    2148                            .dwattr $C$DW$153, DW_AT_decl_column(0x06)
    2149                    $C$DW$154       .dwtag  DW_TAG_member
    2150                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$10)
    2151                            .dwattr $C$DW$154, DW_AT_name("_Dmdig")
    2152                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("_Dmdig")
    2153                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2154                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2155                            .dwattr $C$DW$154, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2156                            .dwattr $C$DW$154, DW_AT_decl_line(0x37)
    2157                            .dwattr $C$DW$154, DW_AT_decl_column(0x0d)
    2158                    $C$DW$155       .dwtag  DW_TAG_member
TI ARM Assembler PC v5.2.5 Tue Oct 27 17:18:45 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   41

    2159                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$10)
    2160                            .dwattr $C$DW$155, DW_AT_name("_Dmax10e")
    2161                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("_Dmax10e")
    2162                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2163                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2164                            .dwattr $C$DW$155, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2165                            .dwattr $C$DW$155, DW_AT_decl_line(0x37)
    2166                            .dwattr $C$DW$155, DW_AT_decl_column(0x15)
    2167                    $C$DW$156       .dwtag  DW_TAG_member
    2168                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$10)
    2169                            .dwattr $C$DW$156, DW_AT_name("_Dmaxe")
    2170                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("_Dmaxe")
    2171                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2172                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2173                            .dwattr $C$DW$156, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2174                            .dwattr $C$DW$156, DW_AT_decl_line(0x37)
    2175                            .dwattr $C$DW$156, DW_AT_decl_column(0x1f)
    2176                    $C$DW$157       .dwtag  DW_TAG_member
    2177                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$10)
    2178                            .dwattr $C$DW$157, DW_AT_name("_Dmin10e")
    2179                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("_Dmin10e")
    2180                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2181                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2182                            .dwattr $C$DW$157, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2183                            .dwattr $C$DW$157, DW_AT_decl_line(0x37)
    2184                            .dwattr $C$DW$157, DW_AT_decl_column(0x27)
    2185                    $C$DW$158       .dwtag  DW_TAG_member
    2186                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$10)
    2187                            .dwattr $C$DW$158, DW_AT_name("_Dmine")
    2188                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("_Dmine")
    2189                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2190                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2191                            .dwattr $C$DW$158, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2192                            .dwattr $C$DW$158, DW_AT_decl_line(0x37)
    2193                            .dwattr $C$DW$158, DW_AT_decl_column(0x31)
    2194                    $C$DW$159       .dwtag  DW_TAG_member
    2195                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$35)
    2196                            .dwattr $C$DW$159, DW_AT_name("_Deps")
    2197                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("_Deps")
    2198                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2199                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2200                            .dwattr $C$DW$159, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2201                            .dwattr $C$DW$159, DW_AT_decl_line(0x3e)
    2202                            .dwattr $C$DW$159, DW_AT_decl_column(0x05)
    2203                    $C$DW$160       .dwtag  DW_TAG_member
    2204                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$35)
    2205                            .dwattr $C$DW$160, DW_AT_name("_Dmax")
    2206                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("_Dmax")
    2207                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2208                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2209                            .dwattr $C$DW$160, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2210                            .dwattr $C$DW$160, DW_AT_decl_line(0x3e)
    2211                            .dwattr $C$DW$160, DW_AT_decl_column(0x0c)
    2212                    $C$DW$161       .dwtag  DW_TAG_member
    2213                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$35)
TI ARM Assembler PC v5.2.5 Tue Oct 27 17:18:45 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   42

    2214                            .dwattr $C$DW$161, DW_AT_name("_Dmin")
    2215                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("_Dmin")
    2216                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2217                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2218                            .dwattr $C$DW$161, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2219                            .dwattr $C$DW$161, DW_AT_decl_line(0x3e)
    2220                            .dwattr $C$DW$161, DW_AT_decl_column(0x13)
    2221                            .dwendtag $C$DW$T$19
    2222                    
    2223                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float
    2224                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x36)
    2225                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x02)
    2226                    $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("_Dvals")
    2227                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$19)
    2228                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    2229                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float
    2230                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x3f)
    2231                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x04)
    2232                    
    2233                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2234                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x234)
    2235                    $C$DW$162       .dwtag  DW_TAG_member
    2236                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    2237                            .dwattr $C$DW$162, DW_AT_name("fs_type")
    2238                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("fs_type")
    2239                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2240                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2241                            .dwattr $C$DW$162, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2242                            .dwattr $C$DW$162, DW_AT_decl_line(0x4e)
    2243                            .dwattr $C$DW$162, DW_AT_decl_column(0x07)
    2244                    $C$DW$163       .dwtag  DW_TAG_member
    2245                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$20)
    2246                            .dwattr $C$DW$163, DW_AT_name("drv")
    2247                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("drv")
    2248                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2249                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2250                            .dwattr $C$DW$163, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2251                            .dwattr $C$DW$163, DW_AT_decl_line(0x4f)
    2252                            .dwattr $C$DW$163, DW_AT_decl_column(0x07)
    2253                    $C$DW$164       .dwtag  DW_TAG_member
    2254                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$20)
    2255                            .dwattr $C$DW$164, DW_AT_name("csize")
    2256                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("csize")
    2257                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2258                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2259                            .dwattr $C$DW$164, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2260                            .dwattr $C$DW$164, DW_AT_decl_line(0x50)
    2261                            .dwattr $C$DW$164, DW_AT_decl_column(0x07)
    2262                    $C$DW$165       .dwtag  DW_TAG_member
    2263                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$20)
    2264                            .dwattr $C$DW$165, DW_AT_name("n_fats")
    2265                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("n_fats")
    2266                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2267                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2268                            .dwattr $C$DW$165, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
TI ARM Assembler PC v5.2.5 Tue Oct 27 17:18:45 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   43

    2269                            .dwattr $C$DW$165, DW_AT_decl_line(0x51)
    2270                            .dwattr $C$DW$165, DW_AT_decl_column(0x07)
    2271                    $C$DW$166       .dwtag  DW_TAG_member
    2272                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$20)
    2273                            .dwattr $C$DW$166, DW_AT_name("wflag")
    2274                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("wflag")
    2275                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2276                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2277                            .dwattr $C$DW$166, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2278                            .dwattr $C$DW$166, DW_AT_decl_line(0x52)
    2279                            .dwattr $C$DW$166, DW_AT_decl_column(0x07)
    2280                    $C$DW$167       .dwtag  DW_TAG_member
    2281                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$20)
    2282                            .dwattr $C$DW$167, DW_AT_name("fsi_flag")
    2283                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("fsi_flag")
    2284                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2285                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2286                            .dwattr $C$DW$167, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2287                            .dwattr $C$DW$167, DW_AT_decl_line(0x53)
    2288                            .dwattr $C$DW$167, DW_AT_decl_column(0x07)
    2289                    $C$DW$168       .dwtag  DW_TAG_member
    2290                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$21)
    2291                            .dwattr $C$DW$168, DW_AT_name("id")
    2292                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("id")
    2293                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2294                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2295                            .dwattr $C$DW$168, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2296                            .dwattr $C$DW$168, DW_AT_decl_line(0x54)
    2297                            .dwattr $C$DW$168, DW_AT_decl_column(0x07)
    2298                    $C$DW$169       .dwtag  DW_TAG_member
    2299                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$21)
    2300                            .dwattr $C$DW$169, DW_AT_name("n_rootdir")
    2301                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("n_rootdir")
    2302                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2303                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2304                            .dwattr $C$DW$169, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2305                            .dwattr $C$DW$169, DW_AT_decl_line(0x55)
    2306                            .dwattr $C$DW$169, DW_AT_decl_column(0x07)
    2307                    $C$DW$170       .dwtag  DW_TAG_member
    2308                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$22)
    2309                            .dwattr $C$DW$170, DW_AT_name("last_clust")
    2310                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("last_clust")
    2311                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2312                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2313                            .dwattr $C$DW$170, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2314                            .dwattr $C$DW$170, DW_AT_decl_line(0x5d)
    2315                            .dwattr $C$DW$170, DW_AT_decl_column(0x08)
    2316                    $C$DW$171       .dwtag  DW_TAG_member
    2317                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$22)
    2318                            .dwattr $C$DW$171, DW_AT_name("free_clust")
    2319                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("free_clust")
    2320                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2321                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2322                            .dwattr $C$DW$171, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2323                            .dwattr $C$DW$171, DW_AT_decl_line(0x5e)
TI ARM Assembler PC v5.2.5 Tue Oct 27 17:18:45 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   44

    2324                            .dwattr $C$DW$171, DW_AT_decl_column(0x08)
    2325                    $C$DW$172       .dwtag  DW_TAG_member
    2326                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$22)
    2327                            .dwattr $C$DW$172, DW_AT_name("fsi_sector")
    2328                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("fsi_sector")
    2329                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2330                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2331                            .dwattr $C$DW$172, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2332                            .dwattr $C$DW$172, DW_AT_decl_line(0x5f)
    2333                            .dwattr $C$DW$172, DW_AT_decl_column(0x08)
    2334                    $C$DW$173       .dwtag  DW_TAG_member
    2335                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$22)
    2336                            .dwattr $C$DW$173, DW_AT_name("n_fatent")
    2337                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("n_fatent")
    2338                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2339                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2340                            .dwattr $C$DW$173, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2341                            .dwattr $C$DW$173, DW_AT_decl_line(0x64)
    2342                            .dwattr $C$DW$173, DW_AT_decl_column(0x08)
    2343                    $C$DW$174       .dwtag  DW_TAG_member
    2344                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$22)
    2345                            .dwattr $C$DW$174, DW_AT_name("fsize")
    2346                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("fsize")
    2347                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2348                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2349                            .dwattr $C$DW$174, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2350                            .dwattr $C$DW$174, DW_AT_decl_line(0x65)
    2351                            .dwattr $C$DW$174, DW_AT_decl_column(0x08)
    2352                    $C$DW$175       .dwtag  DW_TAG_member
    2353                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$22)
    2354                            .dwattr $C$DW$175, DW_AT_name("volbase")
    2355                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("volbase")
    2356                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2357                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2358                            .dwattr $C$DW$175, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2359                            .dwattr $C$DW$175, DW_AT_decl_line(0x66)
    2360                            .dwattr $C$DW$175, DW_AT_decl_column(0x08)
    2361                    $C$DW$176       .dwtag  DW_TAG_member
    2362                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$22)
    2363                            .dwattr $C$DW$176, DW_AT_name("fatbase")
    2364                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("fatbase")
    2365                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2366                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2367                            .dwattr $C$DW$176, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2368                            .dwattr $C$DW$176, DW_AT_decl_line(0x67)
    2369                            .dwattr $C$DW$176, DW_AT_decl_column(0x08)
    2370                    $C$DW$177       .dwtag  DW_TAG_member
    2371                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$22)
    2372                            .dwattr $C$DW$177, DW_AT_name("dirbase")
    2373                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("dirbase")
    2374                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2375                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2376                            .dwattr $C$DW$177, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2377                            .dwattr $C$DW$177, DW_AT_decl_line(0x68)
    2378                            .dwattr $C$DW$177, DW_AT_decl_column(0x08)
TI ARM Assembler PC v5.2.5 Tue Oct 27 17:18:45 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   45

    2379                    $C$DW$178       .dwtag  DW_TAG_member
    2380                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$22)
    2381                            .dwattr $C$DW$178, DW_AT_name("database")
    2382                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("database")
    2383                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2384                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2385                            .dwattr $C$DW$178, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2386                            .dwattr $C$DW$178, DW_AT_decl_line(0x69)
    2387                            .dwattr $C$DW$178, DW_AT_decl_column(0x08)
    2388                    $C$DW$179       .dwtag  DW_TAG_member
    2389                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$22)
    2390                            .dwattr $C$DW$179, DW_AT_name("winsect")
    2391                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("winsect")
    2392                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2393                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2394                            .dwattr $C$DW$179, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2395                            .dwattr $C$DW$179, DW_AT_decl_line(0x6a)
    2396                            .dwattr $C$DW$179, DW_AT_decl_column(0x08)
    2397                    $C$DW$180       .dwtag  DW_TAG_member
    2398                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$23)
    2399                            .dwattr $C$DW$180, DW_AT_name("win")
    2400                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("win")
    2401                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2402                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2403                            .dwattr $C$DW$180, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2404                            .dwattr $C$DW$180, DW_AT_decl_line(0x6b)
    2405                            .dwattr $C$DW$180, DW_AT_decl_column(0x07)
    2406                            .dwendtag $C$DW$T$24
    2407                    
    2408                            .dwattr $C$DW$T$24, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2409                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x4d)
    2410                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    2411                    $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("FATFS")
    2412                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    2413                            .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    2414                            .dwattr $C$DW$T$25, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2415                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x6c)
    2416                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x03)
    2417                    $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    2418                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    2419                            .dwattr $C$DW$T$26, DW_AT_address_class(0x20)
    2420                    
    2421                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2422                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x224)
    2423                    $C$DW$181       .dwtag  DW_TAG_member
    2424                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$26)
    2425                            .dwattr $C$DW$181, DW_AT_name("fs")
    2426                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("fs")
    2427                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2428                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2429                            .dwattr $C$DW$181, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2430                            .dwattr $C$DW$181, DW_AT_decl_line(0x73)
    2431                            .dwattr $C$DW$181, DW_AT_decl_column(0x09)
    2432                    $C$DW$182       .dwtag  DW_TAG_member
    2433                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$21)
TI ARM Assembler PC v5.2.5 Tue Oct 27 17:18:45 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   46

    2434                            .dwattr $C$DW$182, DW_AT_name("id")
    2435                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("id")
    2436                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2437                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2438                            .dwattr $C$DW$182, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2439                            .dwattr $C$DW$182, DW_AT_decl_line(0x74)
    2440                            .dwattr $C$DW$182, DW_AT_decl_column(0x07)
    2441                    $C$DW$183       .dwtag  DW_TAG_member
    2442                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$20)
    2443                            .dwattr $C$DW$183, DW_AT_name("flag")
    2444                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("flag")
    2445                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2446                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2447                            .dwattr $C$DW$183, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2448                            .dwattr $C$DW$183, DW_AT_decl_line(0x75)
    2449                            .dwattr $C$DW$183, DW_AT_decl_column(0x07)
    2450                    $C$DW$184       .dwtag  DW_TAG_member
    2451                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$20)
    2452                            .dwattr $C$DW$184, DW_AT_name("pad1")
    2453                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("pad1")
    2454                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2455                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2456                            .dwattr $C$DW$184, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2457                            .dwattr $C$DW$184, DW_AT_decl_line(0x76)
    2458                            .dwattr $C$DW$184, DW_AT_decl_column(0x07)
    2459                    $C$DW$185       .dwtag  DW_TAG_member
    2460                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$22)
    2461                            .dwattr $C$DW$185, DW_AT_name("fptr")
    2462                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("fptr")
    2463                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2464                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2465                            .dwattr $C$DW$185, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2466                            .dwattr $C$DW$185, DW_AT_decl_line(0x77)
    2467                            .dwattr $C$DW$185, DW_AT_decl_column(0x08)
    2468                    $C$DW$186       .dwtag  DW_TAG_member
    2469                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$22)
    2470                            .dwattr $C$DW$186, DW_AT_name("fsize")
    2471                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("fsize")
    2472                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2473                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2474                            .dwattr $C$DW$186, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2475                            .dwattr $C$DW$186, DW_AT_decl_line(0x78)
    2476                            .dwattr $C$DW$186, DW_AT_decl_column(0x08)
    2477                    $C$DW$187       .dwtag  DW_TAG_member
    2478                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$22)
    2479                            .dwattr $C$DW$187, DW_AT_name("sclust")
    2480                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("sclust")
    2481                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2482                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2483                            .dwattr $C$DW$187, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2484                            .dwattr $C$DW$187, DW_AT_decl_line(0x79)
    2485                            .dwattr $C$DW$187, DW_AT_decl_column(0x08)
    2486                    $C$DW$188       .dwtag  DW_TAG_member
    2487                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$22)
    2488                            .dwattr $C$DW$188, DW_AT_name("clust")
TI ARM Assembler PC v5.2.5 Tue Oct 27 17:18:45 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   47

    2489                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("clust")
    2490                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2491                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2492                            .dwattr $C$DW$188, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2493                            .dwattr $C$DW$188, DW_AT_decl_line(0x7a)
    2494                            .dwattr $C$DW$188, DW_AT_decl_column(0x08)
    2495                    $C$DW$189       .dwtag  DW_TAG_member
    2496                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$22)
    2497                            .dwattr $C$DW$189, DW_AT_name("dsect")
    2498                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("dsect")
    2499                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2500                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2501                            .dwattr $C$DW$189, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2502                            .dwattr $C$DW$189, DW_AT_decl_line(0x7b)
    2503                            .dwattr $C$DW$189, DW_AT_decl_column(0x08)
    2504                    $C$DW$190       .dwtag  DW_TAG_member
    2505                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$22)
    2506                            .dwattr $C$DW$190, DW_AT_name("dir_sect")
    2507                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("dir_sect")
    2508                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2509                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2510                            .dwattr $C$DW$190, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2511                            .dwattr $C$DW$190, DW_AT_decl_line(0x7d)
    2512                            .dwattr $C$DW$190, DW_AT_decl_column(0x08)
    2513                    $C$DW$191       .dwtag  DW_TAG_member
    2514                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$27)
    2515                            .dwattr $C$DW$191, DW_AT_name("dir_ptr")
    2516                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("dir_ptr")
    2517                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2518                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2519                            .dwattr $C$DW$191, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2520                            .dwattr $C$DW$191, DW_AT_decl_line(0x7e)
    2521                            .dwattr $C$DW$191, DW_AT_decl_column(0x08)
    2522                    $C$DW$192       .dwtag  DW_TAG_member
    2523                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$23)
    2524                            .dwattr $C$DW$192, DW_AT_name("buf")
    2525                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("buf")
    2526                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2527                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2528                            .dwattr $C$DW$192, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2529                            .dwattr $C$DW$192, DW_AT_decl_line(0x87)
    2530                            .dwattr $C$DW$192, DW_AT_decl_column(0x07)
    2531                            .dwendtag $C$DW$T$28
    2532                    
    2533                            .dwattr $C$DW$T$28, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2534                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x72)
    2535                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    2536                    $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("FIL")
    2537                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$28)
    2538                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    2539                            .dwattr $C$DW$T$45, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2540                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x89)
    2541                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x03)
    2542                    
    2543                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v5.2.5 Tue Oct 27 17:18:45 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   48

    2544                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x1c)
    2545                    $C$DW$193       .dwtag  DW_TAG_member
    2546                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$26)
    2547                            .dwattr $C$DW$193, DW_AT_name("fs")
    2548                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("fs")
    2549                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2550                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2551                            .dwattr $C$DW$193, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2552                            .dwattr $C$DW$193, DW_AT_decl_line(0x90)
    2553                            .dwattr $C$DW$193, DW_AT_decl_column(0x09)
    2554                    $C$DW$194       .dwtag  DW_TAG_member
    2555                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$21)
    2556                            .dwattr $C$DW$194, DW_AT_name("id")
    2557                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("id")
    2558                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2559                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2560                            .dwattr $C$DW$194, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2561                            .dwattr $C$DW$194, DW_AT_decl_line(0x91)
    2562                            .dwattr $C$DW$194, DW_AT_decl_column(0x07)
    2563                    $C$DW$195       .dwtag  DW_TAG_member
    2564                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$21)
    2565                            .dwattr $C$DW$195, DW_AT_name("index")
    2566                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("index")
    2567                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2568                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2569                            .dwattr $C$DW$195, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2570                            .dwattr $C$DW$195, DW_AT_decl_line(0x92)
    2571                            .dwattr $C$DW$195, DW_AT_decl_column(0x07)
    2572                    $C$DW$196       .dwtag  DW_TAG_member
    2573                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$22)
    2574                            .dwattr $C$DW$196, DW_AT_name("sclust")
    2575                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("sclust")
    2576                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2577                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2578                            .dwattr $C$DW$196, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2579                            .dwattr $C$DW$196, DW_AT_decl_line(0x93)
    2580                            .dwattr $C$DW$196, DW_AT_decl_column(0x08)
    2581                    $C$DW$197       .dwtag  DW_TAG_member
    2582                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$22)
    2583                            .dwattr $C$DW$197, DW_AT_name("clust")
    2584                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("clust")
    2585                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2586                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2587                            .dwattr $C$DW$197, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2588                            .dwattr $C$DW$197, DW_AT_decl_line(0x94)
    2589                            .dwattr $C$DW$197, DW_AT_decl_column(0x08)
    2590                    $C$DW$198       .dwtag  DW_TAG_member
    2591                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$22)
    2592                            .dwattr $C$DW$198, DW_AT_name("sect")
    2593                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("sect")
    2594                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2595                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2596                            .dwattr $C$DW$198, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2597                            .dwattr $C$DW$198, DW_AT_decl_line(0x95)
    2598                            .dwattr $C$DW$198, DW_AT_decl_column(0x08)
TI ARM Assembler PC v5.2.5 Tue Oct 27 17:18:45 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   49

    2599                    $C$DW$199       .dwtag  DW_TAG_member
    2600                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$27)
    2601                            .dwattr $C$DW$199, DW_AT_name("dir")
    2602                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("dir")
    2603                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2604                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2605                            .dwattr $C$DW$199, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2606                            .dwattr $C$DW$199, DW_AT_decl_line(0x96)
    2607                            .dwattr $C$DW$199, DW_AT_decl_column(0x08)
    2608                    $C$DW$200       .dwtag  DW_TAG_member
    2609                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$27)
    2610                            .dwattr $C$DW$200, DW_AT_name("fn")
    2611                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("fn")
    2612                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2613                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2614                            .dwattr $C$DW$200, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2615                            .dwattr $C$DW$200, DW_AT_decl_line(0x97)
    2616                            .dwattr $C$DW$200, DW_AT_decl_column(0x08)
    2617                            .dwendtag $C$DW$T$29
    2618                    
    2619                            .dwattr $C$DW$T$29, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2620                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x8f)
    2621                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    2622                    $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("DIR")
    2623                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$29)
    2624                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    2625                            .dwattr $C$DW$T$46, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2626                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x9c)
    2627                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x03)
    2628                    
    2629                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2630                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x18)
    2631                    $C$DW$201       .dwtag  DW_TAG_member
    2632                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$22)
    2633                            .dwattr $C$DW$201, DW_AT_name("fsize")
    2634                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("fsize")
    2635                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2636                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2637                            .dwattr $C$DW$201, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2638                            .dwattr $C$DW$201, DW_AT_decl_line(0xa3)
    2639                            .dwattr $C$DW$201, DW_AT_decl_column(0x08)
    2640                    $C$DW$202       .dwtag  DW_TAG_member
    2641                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$21)
    2642                            .dwattr $C$DW$202, DW_AT_name("fdate")
    2643                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("fdate")
    2644                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2645                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2646                            .dwattr $C$DW$202, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2647                            .dwattr $C$DW$202, DW_AT_decl_line(0xa4)
    2648                            .dwattr $C$DW$202, DW_AT_decl_column(0x07)
    2649                    $C$DW$203       .dwtag  DW_TAG_member
    2650                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$21)
    2651                            .dwattr $C$DW$203, DW_AT_name("ftime")
    2652                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("ftime")
    2653                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TI ARM Assembler PC v5.2.5 Tue Oct 27 17:18:45 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   50

    2654                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2655                            .dwattr $C$DW$203, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2656                            .dwattr $C$DW$203, DW_AT_decl_line(0xa5)
    2657                            .dwattr $C$DW$203, DW_AT_decl_column(0x07)
    2658                    $C$DW$204       .dwtag  DW_TAG_member
    2659                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$20)
    2660                            .dwattr $C$DW$204, DW_AT_name("fattrib")
    2661                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("fattrib")
    2662                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2663                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2664                            .dwattr $C$DW$204, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2665                            .dwattr $C$DW$204, DW_AT_decl_line(0xa6)
    2666                            .dwattr $C$DW$204, DW_AT_decl_column(0x07)
    2667                    $C$DW$205       .dwtag  DW_TAG_member
    2668                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$32)
    2669                            .dwattr $C$DW$205, DW_AT_name("fname")
    2670                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("fname")
    2671                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2672                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2673                            .dwattr $C$DW$205, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2674                            .dwattr $C$DW$205, DW_AT_decl_line(0xa7)
    2675                            .dwattr $C$DW$205, DW_AT_decl_column(0x08)
    2676                            .dwendtag $C$DW$T$33
    2677                    
    2678                            .dwattr $C$DW$T$33, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2679                            .dwattr $C$DW$T$33, DW_AT_decl_line(0xa2)
    2680                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    2681                    $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("FILINFO")
    2682                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$33)
    2683                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    2684                            .dwattr $C$DW$T$47, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2685                            .dwattr $C$DW$T$47, DW_AT_decl_line(0xac)
    2686                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x03)
    2687                    
    2688                    $C$DW$T$35      .dwtag  DW_TAG_union_type
    2689                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x10)
    2690                    $C$DW$206       .dwtag  DW_TAG_member
    2691                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$34)
    2692                            .dwattr $C$DW$206, DW_AT_name("_Us")
    2693                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("_Us")
    2694                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2695                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2696                            .dwattr $C$DW$206, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2697                            .dwattr $C$DW$206, DW_AT_decl_line(0x3a)
    2698                            .dwattr $C$DW$206, DW_AT_decl_column(0x12)
    2699                    $C$DW$207       .dwtag  DW_TAG_member
    2700                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$16)
    2701                            .dwattr $C$DW$207, DW_AT_name("_Float")
    2702                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("_Float")
    2703                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2704                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2705                            .dwattr $C$DW$207, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2706                            .dwattr $C$DW$207, DW_AT_decl_line(0x3b)
    2707                            .dwattr $C$DW$207, DW_AT_decl_column(0x09)
    2708                    $C$DW$208       .dwtag  DW_TAG_member
TI ARM Assembler PC v5.2.5 Tue Oct 27 17:18:45 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   51

    2709                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$17)
    2710                            .dwattr $C$DW$208, DW_AT_name("_Double")
    2711                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("_Double")
    2712                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2713                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2714                            .dwattr $C$DW$208, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2715                            .dwattr $C$DW$208, DW_AT_decl_line(0x3c)
    2716                            .dwattr $C$DW$208, DW_AT_decl_column(0x0a)
    2717                    $C$DW$209       .dwtag  DW_TAG_member
    2718                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$18)
    2719                            .dwattr $C$DW$209, DW_AT_name("_Long_double")
    2720                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("_Long_double")
    2721                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2722                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2723                            .dwattr $C$DW$209, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2724                            .dwattr $C$DW$209, DW_AT_decl_line(0x3d)
    2725                            .dwattr $C$DW$209, DW_AT_decl_column(0x0f)
    2726                            .dwendtag $C$DW$T$35
    2727                    
    2728                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float
    2729                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x39)
    2730                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x03)
    2731                    
    2732                    $C$DW$T$36      .dwtag  DW_TAG_union_type
    2733                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x10)
    2734                    $C$DW$210       .dwtag  DW_TAG_member
    2735                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$34)
    2736                            .dwattr $C$DW$210, DW_AT_name("_Word")
    2737                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("_Word")
    2738                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2739                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2740                            .dwattr $C$DW$210, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath.
    2741                            .dwattr $C$DW$210, DW_AT_decl_line(0x8f)
    2742                            .dwattr $C$DW$210, DW_AT_decl_column(0x11)
    2743                    $C$DW$211       .dwtag  DW_TAG_member
    2744                            .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$16)
    2745                            .dwattr $C$DW$211, DW_AT_name("_Float")
    2746                            .dwattr $C$DW$211, DW_AT_TI_symbol_name("_Float")
    2747                            .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2748                            .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2749                            .dwattr $C$DW$211, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath.
    2750                            .dwattr $C$DW$211, DW_AT_decl_line(0x90)
    2751                            .dwattr $C$DW$211, DW_AT_decl_column(0x08)
    2752                    $C$DW$212       .dwtag  DW_TAG_member
    2753                            .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$17)
    2754                            .dwattr $C$DW$212, DW_AT_name("_Double")
    2755                            .dwattr $C$DW$212, DW_AT_TI_symbol_name("_Double")
    2756                            .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2757                            .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2758                            .dwattr $C$DW$212, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath.
    2759                            .dwattr $C$DW$212, DW_AT_decl_line(0x91)
    2760                            .dwattr $C$DW$212, DW_AT_decl_column(0x09)
    2761                    $C$DW$213       .dwtag  DW_TAG_member
    2762                            .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$18)
    2763                            .dwattr $C$DW$213, DW_AT_name("_Long_double")
TI ARM Assembler PC v5.2.5 Tue Oct 27 17:18:45 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   52

    2764                            .dwattr $C$DW$213, DW_AT_TI_symbol_name("_Long_double")
    2765                            .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2766                            .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2767                            .dwattr $C$DW$213, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath.
    2768                            .dwattr $C$DW$213, DW_AT_decl_line(0x92)
    2769                            .dwattr $C$DW$213, DW_AT_decl_column(0x0e)
    2770                            .dwendtag $C$DW$T$36
    2771                    
    2772                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath
    2773                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x8e)
    2774                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x02)
    2775                    $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("_Dconst")
    2776                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$36)
    2777                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    2778                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath
    2779                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x93)
    2780                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x04)
    2781                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2782                            .dwattr $C$DW$T$2, DW_AT_name("void")
    2783                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2784                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2785                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2786                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    2787                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2788                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    2789                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2790                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    2791                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2792                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2793                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2794                    $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    2795                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$5)
    2796                            .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    2797                            .dwattr $C$DW$T$67, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2798                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x2a)
    2799                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x1d)
    2800                    $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
    2801                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    2802                            .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    2803                            .dwattr $C$DW$T$68, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2804                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x37)
    2805                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x17)
    2806                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    2807                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2808                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2809                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2810                    $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("BYTE")
    2811                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$6)
    2812                            .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    2813                            .dwattr $C$DW$T$20, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2814                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x16)
    2815                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x17)
    2816                    $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("DSTATUS")
    2817                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$20)
    2818                            .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v5.2.5 Tue Oct 27 17:18:45 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   53

    2819                            .dwattr $C$DW$T$69, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2820                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x13)
    2821                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x0e)
    2822                    
    2823                    $C$DW$T$23      .dwtag  DW_TAG_array_type
    2824                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$20)
    2825                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    2826                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x200)
    2827                    $C$DW$214       .dwtag  DW_TAG_subrange_type
    2828                            .dwattr $C$DW$214, DW_AT_upper_bound(0x1ff)
    2829                            .dwendtag $C$DW$T$23
    2830                    
    2831                    $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    2832                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$20)
    2833                            .dwattr $C$DW$T$27, DW_AT_address_class(0x20)
    2834                    $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("UCHAR")
    2835                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$6)
    2836                            .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    2837                            .dwattr $C$DW$T$70, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2838                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x15)
    2839                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x17)
    2840                    $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    2841                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$6)
    2842                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    2843                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2844                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x2b)
    2845                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x1c)
    2846                    $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
    2847                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$50)
    2848                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    2849                            .dwattr $C$DW$T$73, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2850                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x38)
    2851                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x16)
    2852                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    2853                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2854                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2855                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    2856                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    2857                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2858                            .dwattr $C$DW$T$8, DW_AT_name("short")
    2859                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    2860                    $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("SHORT")
    2861                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$8)
    2862                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    2863                            .dwattr $C$DW$T$74, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2864                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x19)
    2865                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x11)
    2866                    $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
    2867                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$8)
    2868                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2869                            .dwattr $C$DW$T$75, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2870                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x2c)
    2871                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x1d)
    2872                    $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
    2873                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
TI ARM Assembler PC v5.2.5 Tue Oct 27 17:18:45 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   54

    2874                            .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    2875                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2876                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x3a)
    2877                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x17)
    2878                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    2879                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2880                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2881                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    2882                    $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("USHORT")
    2883                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$9)
    2884                            .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    2885                            .dwattr $C$DW$T$77, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2886                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x1a)
    2887                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x18)
    2888                    $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("WCHAR")
    2889                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$9)
    2890                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    2891                            .dwattr $C$DW$T$78, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2892                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x1c)
    2893                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x18)
    2894                    $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("WORD")
    2895                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$9)
    2896                            .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    2897                            .dwattr $C$DW$T$21, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2898                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x1b)
    2899                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x18)
    2900                    $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("_Wchart")
    2901                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$9)
    2902                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    2903                            .dwattr $C$DW$T$79, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yvals
    2904                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x1e5)
    2905                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x21)
    2906                    $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("_Wintt")
    2907                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$9)
    2908                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    2909                            .dwattr $C$DW$T$80, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yvals
    2910                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x1e6)
    2911                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x21)
    2912                    
    2913                    $C$DW$T$34      .dwtag  DW_TAG_array_type
    2914                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$9)
    2915                            .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    2916                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x10)
    2917                    $C$DW$215       .dwtag  DW_TAG_subrange_type
    2918                            .dwattr $C$DW$215, DW_AT_upper_bound(0x07)
    2919                            .dwendtag $C$DW$T$34
    2920                    
    2921                    $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    2922                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$9)
    2923                            .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    2924                            .dwattr $C$DW$T$81, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2925                            .dwattr $C$DW$T$81, DW_AT_decl_line(0x2d)
    2926                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x1c)
    2927                    $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
    2928                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
TI ARM Assembler PC v5.2.5 Tue Oct 27 17:18:45 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   55

    2929                            .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    2930                            .dwattr $C$DW$T$82, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2931                            .dwattr $C$DW$T$82, DW_AT_decl_line(0x3b)
    2932                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x16)
    2933                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    2934                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2935                            .dwattr $C$DW$T$10, DW_AT_name("int")
    2936                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    2937                    $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("INT")
    2938                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$10)
    2939                            .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    2940                            .dwattr $C$DW$T$83, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2941                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x10)
    2942                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x10)
    2943                    $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("_Ptrdifft")
    2944                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$10)
    2945                            .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    2946                            .dwattr $C$DW$T$84, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yvals
    2947                            .dwattr $C$DW$T$84, DW_AT_decl_line(0xa9)
    2948                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x1e)
    2949                    $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
    2950                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$10)
    2951                            .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    2952                            .dwattr $C$DW$T$86, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2953                            .dwattr $C$DW$T$86, DW_AT_decl_line(0x2e)
    2954                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x1d)
    2955                    $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast16_t")
    2956                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    2957                            .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    2958                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2959                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x47)
    2960                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x17)
    2961                    $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast32_t")
    2962                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$86)
    2963                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    2964                            .dwattr $C$DW$T$88, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2965                            .dwattr $C$DW$T$88, DW_AT_decl_line(0x4a)
    2966                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x17)
    2967                    $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast8_t")
    2968                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$86)
    2969                            .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    2970                            .dwattr $C$DW$T$89, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2971                            .dwattr $C$DW$T$89, DW_AT_decl_line(0x45)
    2972                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x17)
    2973                    $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("int_least32_t")
    2974                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$86)
    2975                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    2976                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2977                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x3c)
    2978                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x17)
    2979                    $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("intptr_t")
    2980                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$10)
    2981                            .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    2982                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2983                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x52)
TI ARM Assembler PC v5.2.5 Tue Oct 27 17:18:45 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   56

    2984                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x1a)
    2985                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    2986                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2987                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    2988                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    2989                    $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("UINT")
    2990                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$11)
    2991                            .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    2992                            .dwattr $C$DW$T$92, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2993                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x11)
    2994                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x16)
    2995                    $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("_Sizet")
    2996                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$11)
    2997                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    2998                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yvals
    2999                            .dwattr $C$DW$T$93, DW_AT_decl_line(0xab)
    3000                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x1a)
    3001                    $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("_TI_uint32_t")
    3002                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$11)
    3003                            .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    3004                            .dwattr $C$DW$T$94, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath
    3005                            .dwattr $C$DW$T$94, DW_AT_decl_line(0xb6)
    3006                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x19)
    3007                    $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
    3008                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$11)
    3009                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    3010                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    3011                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x2f)
    3012                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x1c)
    3013                    $C$DW$T$100     .dwtag  DW_TAG_volatile_type
    3014                            .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$49)
    3015                    $C$DW$T$101     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast16_t")
    3016                            .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$49)
    3017                            .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    3018                            .dwattr $C$DW$T$101, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3019                            .dwattr $C$DW$T$101, DW_AT_decl_line(0x48)
    3020                            .dwattr $C$DW$T$101, DW_AT_decl_column(0x16)
    3021                    $C$DW$T$102     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast32_t")
    3022                            .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$49)
    3023                            .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    3024                            .dwattr $C$DW$T$102, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3025                            .dwattr $C$DW$T$102, DW_AT_decl_line(0x4b)
    3026                            .dwattr $C$DW$T$102, DW_AT_decl_column(0x16)
    3027                    $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast8_t")
    3028                            .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$49)
    3029                            .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    3030                            .dwattr $C$DW$T$103, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3031                            .dwattr $C$DW$T$103, DW_AT_decl_line(0x46)
    3032                            .dwattr $C$DW$T$103, DW_AT_decl_column(0x16)
    3033                    $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least32_t")
    3034                            .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$49)
    3035                            .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    3036                            .dwattr $C$DW$T$104, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3037                            .dwattr $C$DW$T$104, DW_AT_decl_line(0x3d)
    3038                            .dwattr $C$DW$T$104, DW_AT_decl_column(0x16)
TI ARM Assembler PC v5.2.5 Tue Oct 27 17:18:45 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   57

    3039                    $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("uintptr_t")
    3040                            .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$11)
    3041                            .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    3042                            .dwattr $C$DW$T$105, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3043                            .dwattr $C$DW$T$105, DW_AT_decl_line(0x53)
    3044                            .dwattr $C$DW$T$105, DW_AT_decl_column(0x1a)
    3045                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    3046                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    3047                            .dwattr $C$DW$T$12, DW_AT_name("long")
    3048                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    3049                    $C$DW$T$106     .dwtag  DW_TAG_typedef, DW_AT_name("LONG")
    3050                            .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$12)
    3051                            .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    3052                            .dwattr $C$DW$T$106, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    3053                            .dwattr $C$DW$T$106, DW_AT_decl_line(0x1f)
    3054                            .dwattr $C$DW$T$106, DW_AT_decl_column(0x10)
    3055                    $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("_Int32t")
    3056                            .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$12)
    3057                            .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    3058                            .dwattr $C$DW$T$107, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yval
    3059                            .dwattr $C$DW$T$107, DW_AT_decl_line(0xa6)
    3060                            .dwattr $C$DW$T$107, DW_AT_decl_column(0x0e)
    3061                    $C$DW$T$13      .dwtag  DW_TAG_base_type
    3062                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    3063                            .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    3064                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
    3065                    $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("DWORD")
    3066                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$13)
    3067                            .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    3068                            .dwattr $C$DW$T$22, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    3069                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x21)
    3070                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x17)
    3071                    $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("ULONG")
    3072                            .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$13)
    3073                            .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
    3074                            .dwattr $C$DW$T$108, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    3075                            .dwattr $C$DW$T$108, DW_AT_decl_line(0x20)
    3076                            .dwattr $C$DW$T$108, DW_AT_decl_column(0x17)
    3077                    $C$DW$T$109     .dwtag  DW_TAG_typedef, DW_AT_name("_Uint32t")
    3078                            .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$13)
    3079                            .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    3080                            .dwattr $C$DW$T$109, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yval
    3081                            .dwattr $C$DW$T$109, DW_AT_decl_line(0xa7)
    3082                            .dwattr $C$DW$T$109, DW_AT_decl_column(0x17)
    3083                    $C$DW$T$14      .dwtag  DW_TAG_base_type
    3084                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    3085                            .dwattr $C$DW$T$14, DW_AT_name("long long")
    3086                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    3087                    $C$DW$T$110     .dwtag  DW_TAG_typedef, DW_AT_name("_Longlong")
    3088                            .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$14)
    3089                            .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    3090                            .dwattr $C$DW$T$110, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yval
    3091                            .dwattr $C$DW$T$110, DW_AT_decl_line(0x1b5)
    3092                            .dwattr $C$DW$T$110, DW_AT_decl_column(0x13)
    3093                    $C$DW$T$111     .dwtag  DW_TAG_typedef, DW_AT_name("int64_t")
TI ARM Assembler PC v5.2.5 Tue Oct 27 17:18:45 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   58

    3094                            .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$14)
    3095                            .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
    3096                            .dwattr $C$DW$T$111, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3097                            .dwattr $C$DW$T$111, DW_AT_decl_line(0x32)
    3098                            .dwattr $C$DW$T$111, DW_AT_decl_column(0x21)
    3099                    $C$DW$T$112     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast64_t")
    3100                            .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$111)
    3101                            .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    3102                            .dwattr $C$DW$T$112, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3103                            .dwattr $C$DW$T$112, DW_AT_decl_line(0x4e)
    3104                            .dwattr $C$DW$T$112, DW_AT_decl_column(0x17)
    3105                    $C$DW$T$113     .dwtag  DW_TAG_typedef, DW_AT_name("int_least64_t")
    3106                            .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$111)
    3107                            .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    3108                            .dwattr $C$DW$T$113, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3109                            .dwattr $C$DW$T$113, DW_AT_decl_line(0x40)
    3110                            .dwattr $C$DW$T$113, DW_AT_decl_column(0x17)
    3111                    $C$DW$T$114     .dwtag  DW_TAG_typedef, DW_AT_name("intmax_t")
    3112                            .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$14)
    3113                            .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    3114                            .dwattr $C$DW$T$114, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3115                            .dwattr $C$DW$T$114, DW_AT_decl_line(0x56)
    3116                            .dwattr $C$DW$T$114, DW_AT_decl_column(0x20)
    3117                    $C$DW$T$15      .dwtag  DW_TAG_base_type
    3118                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    3119                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    3120                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    3121                    $C$DW$T$115     .dwtag  DW_TAG_typedef, DW_AT_name("_TI_uint64_t")
    3122                            .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$15)
    3123                            .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
    3124                            .dwattr $C$DW$T$115, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymat
    3125                            .dwattr $C$DW$T$115, DW_AT_decl_line(0xbc)
    3126                            .dwattr $C$DW$T$115, DW_AT_decl_column(0x1c)
    3127                    $C$DW$T$116     .dwtag  DW_TAG_typedef, DW_AT_name("_ULonglong")
    3128                            .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$15)
    3129                            .dwattr $C$DW$T$116, DW_AT_language(DW_LANG_C)
    3130                            .dwattr $C$DW$T$116, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yval
    3131                            .dwattr $C$DW$T$116, DW_AT_decl_line(0x1b6)
    3132                            .dwattr $C$DW$T$116, DW_AT_decl_column(0x14)
    3133                    $C$DW$T$117     .dwtag  DW_TAG_typedef, DW_AT_name("uint64_t")
    3134                            .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$15)
    3135                            .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
    3136                            .dwattr $C$DW$T$117, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3137                            .dwattr $C$DW$T$117, DW_AT_decl_line(0x33)
    3138                            .dwattr $C$DW$T$117, DW_AT_decl_column(0x20)
    3139                    $C$DW$T$118     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast64_t")
    3140                            .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$117)
    3141                            .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
    3142                            .dwattr $C$DW$T$118, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3143                            .dwattr $C$DW$T$118, DW_AT_decl_line(0x4f)
    3144                            .dwattr $C$DW$T$118, DW_AT_decl_column(0x16)
    3145                    $C$DW$T$119     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least64_t")
    3146                            .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$117)
    3147                            .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    3148                            .dwattr $C$DW$T$119, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
TI ARM Assembler PC v5.2.5 Tue Oct 27 17:18:45 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   59

    3149                            .dwattr $C$DW$T$119, DW_AT_decl_line(0x41)
    3150                            .dwattr $C$DW$T$119, DW_AT_decl_column(0x16)
    3151                    $C$DW$T$120     .dwtag  DW_TAG_typedef, DW_AT_name("uintmax_t")
    3152                            .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$15)
    3153                            .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    3154                            .dwattr $C$DW$T$120, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3155                            .dwattr $C$DW$T$120, DW_AT_decl_line(0x57)
    3156                            .dwattr $C$DW$T$120, DW_AT_decl_column(0x20)
    3157                    $C$DW$T$16      .dwtag  DW_TAG_base_type
    3158                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    3159                            .dwattr $C$DW$T$16, DW_AT_name("float")
    3160                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
