TI ARM Assembler PC v5.2.5 Sun Oct 18 09:39:50 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                             PC v5.2.5 *
       3                    ;* Date/Time created: Sun Oct 18 09:39:50 2015                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --disab
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../timers.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.2.5 Copyright (c) 1996-2015 Te
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("E:\Dev\Ti\Code\GIT\LaunchpadRoomControl\LaunchpadRoomControl
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("GPIOPinWrite")

    1999                    $C$DW$137       .dwtag  DW_TAG_enumerator, DW_AT_name("FR_NOT_ENOUGH_CORE"), DW_AT_const_value(0x11)
    2000                            .dwattr $C$DW$137, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2001                            .dwattr $C$DW$137, DW_AT_decl_line(0xc4)
    2002                            .dwattr $C$DW$137, DW_AT_decl_column(0x02)
    2003                    $C$DW$138       .dwtag  DW_TAG_enumerator, DW_AT_name("FR_TOO_MANY_OPEN_FILES"), DW_AT_const_value(0x1
    2004                            .dwattr $C$DW$138, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2005                            .dwattr $C$DW$138, DW_AT_decl_line(0xc5)
    2006                            .dwattr $C$DW$138, DW_AT_decl_column(0x02)
    2007                    $C$DW$139       .dwtag  DW_TAG_enumerator, DW_AT_name("FR_INVALID_PARAMETER"), DW_AT_const_value(0x13)
    2008                            .dwattr $C$DW$139, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2009                            .dwattr $C$DW$139, DW_AT_decl_line(0xc6)
    2010                            .dwattr $C$DW$139, DW_AT_decl_column(0x02)
    2011                            .dwendtag $C$DW$T$40
    2012                    
    2013                            .dwattr $C$DW$T$40, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2014                            .dwattr $C$DW$T$40, DW_AT_decl_line(0xb2)
    2015                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x0e)
    2016                    $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("FRESULT")
    2017                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    2018                            .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    2019                            .dwattr $C$DW$T$41, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2020                            .dwattr $C$DW$T$41, DW_AT_decl_line(0xc7)
    2021                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x03)
    2022                    
    2023                    $C$DW$T$42      .dwtag  DW_TAG_enumeration_type
    2024                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
TI ARM Assembler PC v5.2.5 Sun Oct 18 09:39:50 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   38

    2025                    $C$DW$140       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_OK"), DW_AT_const_value(0x00)
    2026                            .dwattr $C$DW$140, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2027                            .dwattr $C$DW$140, DW_AT_decl_line(0x17)
    2028                            .dwattr $C$DW$140, DW_AT_decl_column(0x02)
    2029                    $C$DW$141       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_ERROR"), DW_AT_const_value(0x01)
    2030                            .dwattr $C$DW$141, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2031                            .dwattr $C$DW$141, DW_AT_decl_line(0x18)
    2032                            .dwattr $C$DW$141, DW_AT_decl_column(0x02)
    2033                    $C$DW$142       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_WRPRT"), DW_AT_const_value(0x02)
    2034                            .dwattr $C$DW$142, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2035                            .dwattr $C$DW$142, DW_AT_decl_line(0x19)
    2036                            .dwattr $C$DW$142, DW_AT_decl_column(0x02)
    2037                    $C$DW$143       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_NOTRDY"), DW_AT_const_value(0x03)
    2038                            .dwattr $C$DW$143, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2039                            .dwattr $C$DW$143, DW_AT_decl_line(0x1a)
    2040                            .dwattr $C$DW$143, DW_AT_decl_column(0x02)
    2041                    $C$DW$144       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_PARERR"), DW_AT_const_value(0x04)
    2042                            .dwattr $C$DW$144, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2043                            .dwattr $C$DW$144, DW_AT_decl_line(0x1b)
    2044                            .dwattr $C$DW$144, DW_AT_decl_column(0x02)
    2045                            .dwendtag $C$DW$T$42
    2046                    
    2047                            .dwattr $C$DW$T$42, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2048                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x16)
    2049                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x0e)
    2050                    $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("DRESULT")
    2051                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    2052                            .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    2053                            .dwattr $C$DW$T$43, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2054                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x1c)
    2055                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x03)
    2056                    
    2057                    $C$DW$T$19      .dwtag  DW_TAG_structure_type
    2058                            .dwattr $C$DW$T$19, DW_AT_byte_size(0x48)
    2059                    $C$DW$145       .dwtag  DW_TAG_member
    2060                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$10)
    2061                            .dwattr $C$DW$145, DW_AT_name("_Ddig")
    2062                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("_Ddig")
    2063                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2064                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2065                            .dwattr $C$DW$145, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2066                            .dwattr $C$DW$145, DW_AT_decl_line(0x37)
    2067                            .dwattr $C$DW$145, DW_AT_decl_column(0x06)
    2068                    $C$DW$146       .dwtag  DW_TAG_member
    2069                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$10)
    2070                            .dwattr $C$DW$146, DW_AT_name("_Dmdig")
    2071                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("_Dmdig")
    2072                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2073                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2074                            .dwattr $C$DW$146, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2075                            .dwattr $C$DW$146, DW_AT_decl_line(0x37)
    2076                            .dwattr $C$DW$146, DW_AT_decl_column(0x0d)
    2077                    $C$DW$147       .dwtag  DW_TAG_member
    2078                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$10)
    2079                            .dwattr $C$DW$147, DW_AT_name("_Dmax10e")
TI ARM Assembler PC v5.2.5 Sun Oct 18 09:39:50 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   39

    2080                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("_Dmax10e")
    2081                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2082                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2083                            .dwattr $C$DW$147, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2084                            .dwattr $C$DW$147, DW_AT_decl_line(0x37)
    2085                            .dwattr $C$DW$147, DW_AT_decl_column(0x15)
    2086                    $C$DW$148       .dwtag  DW_TAG_member
    2087                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$10)
    2088                            .dwattr $C$DW$148, DW_AT_name("_Dmaxe")
    2089                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("_Dmaxe")
    2090                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2091                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2092                            .dwattr $C$DW$148, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2093                            .dwattr $C$DW$148, DW_AT_decl_line(0x37)
    2094                            .dwattr $C$DW$148, DW_AT_decl_column(0x1f)
    2095                    $C$DW$149       .dwtag  DW_TAG_member
    2096                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$10)
    2097                            .dwattr $C$DW$149, DW_AT_name("_Dmin10e")
    2098                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("_Dmin10e")
    2099                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2100                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2101                            .dwattr $C$DW$149, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2102                            .dwattr $C$DW$149, DW_AT_decl_line(0x37)
    2103                            .dwattr $C$DW$149, DW_AT_decl_column(0x27)
    2104                    $C$DW$150       .dwtag  DW_TAG_member
    2105                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$10)
    2106                            .dwattr $C$DW$150, DW_AT_name("_Dmine")
    2107                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("_Dmine")
    2108                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2109                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2110                            .dwattr $C$DW$150, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2111                            .dwattr $C$DW$150, DW_AT_decl_line(0x37)
    2112                            .dwattr $C$DW$150, DW_AT_decl_column(0x31)
    2113                    $C$DW$151       .dwtag  DW_TAG_member
    2114                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$35)
    2115                            .dwattr $C$DW$151, DW_AT_name("_Deps")
    2116                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("_Deps")
    2117                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2118                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2119                            .dwattr $C$DW$151, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2120                            .dwattr $C$DW$151, DW_AT_decl_line(0x3e)
    2121                            .dwattr $C$DW$151, DW_AT_decl_column(0x05)
    2122                    $C$DW$152       .dwtag  DW_TAG_member
    2123                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$35)
    2124                            .dwattr $C$DW$152, DW_AT_name("_Dmax")
    2125                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("_Dmax")
    2126                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2127                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2128                            .dwattr $C$DW$152, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2129                            .dwattr $C$DW$152, DW_AT_decl_line(0x3e)
    2130                            .dwattr $C$DW$152, DW_AT_decl_column(0x0c)
    2131                    $C$DW$153       .dwtag  DW_TAG_member
    2132                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$35)
    2133                            .dwattr $C$DW$153, DW_AT_name("_Dmin")
    2134                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("_Dmin")
TI ARM Assembler PC v5.2.5 Sun Oct 18 09:39:50 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   40

    2135                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2136                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2137                            .dwattr $C$DW$153, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2138                            .dwattr $C$DW$153, DW_AT_decl_line(0x3e)
    2139                            .dwattr $C$DW$153, DW_AT_decl_column(0x13)
    2140                            .dwendtag $C$DW$T$19
    2141                    
    2142                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float
    2143                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x36)
    2144                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x02)
    2145                    $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("_Dvals")
    2146                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$19)
    2147                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    2148                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float
    2149                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x3f)
    2150                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x04)
    2151                    
    2152                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2153                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x234)
    2154                    $C$DW$154       .dwtag  DW_TAG_member
    2155                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$20)
    2156                            .dwattr $C$DW$154, DW_AT_name("fs_type")
    2157                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("fs_type")
    2158                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2159                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2160                            .dwattr $C$DW$154, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2161                            .dwattr $C$DW$154, DW_AT_decl_line(0x4e)
    2162                            .dwattr $C$DW$154, DW_AT_decl_column(0x07)
    2163                    $C$DW$155       .dwtag  DW_TAG_member
    2164                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$20)
    2165                            .dwattr $C$DW$155, DW_AT_name("drv")
    2166                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("drv")
    2167                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2168                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2169                            .dwattr $C$DW$155, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2170                            .dwattr $C$DW$155, DW_AT_decl_line(0x4f)
    2171                            .dwattr $C$DW$155, DW_AT_decl_column(0x07)
    2172                    $C$DW$156       .dwtag  DW_TAG_member
    2173                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$20)
    2174                            .dwattr $C$DW$156, DW_AT_name("csize")
    2175                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("csize")
    2176                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2177                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2178                            .dwattr $C$DW$156, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2179                            .dwattr $C$DW$156, DW_AT_decl_line(0x50)
    2180                            .dwattr $C$DW$156, DW_AT_decl_column(0x07)
    2181                    $C$DW$157       .dwtag  DW_TAG_member
    2182                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$20)
    2183                            .dwattr $C$DW$157, DW_AT_name("n_fats")
    2184                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("n_fats")
    2185                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2186                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2187                            .dwattr $C$DW$157, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2188                            .dwattr $C$DW$157, DW_AT_decl_line(0x51)
    2189                            .dwattr $C$DW$157, DW_AT_decl_column(0x07)
TI ARM Assembler PC v5.2.5 Sun Oct 18 09:39:50 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   41

    2190                    $C$DW$158       .dwtag  DW_TAG_member
    2191                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$20)
    2192                            .dwattr $C$DW$158, DW_AT_name("wflag")
    2193                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("wflag")
    2194                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2195                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2196                            .dwattr $C$DW$158, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2197                            .dwattr $C$DW$158, DW_AT_decl_line(0x52)
    2198                            .dwattr $C$DW$158, DW_AT_decl_column(0x07)
    2199                    $C$DW$159       .dwtag  DW_TAG_member
    2200                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$20)
    2201                            .dwattr $C$DW$159, DW_AT_name("fsi_flag")
    2202                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("fsi_flag")
    2203                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2204                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2205                            .dwattr $C$DW$159, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2206                            .dwattr $C$DW$159, DW_AT_decl_line(0x53)
    2207                            .dwattr $C$DW$159, DW_AT_decl_column(0x07)
    2208                    $C$DW$160       .dwtag  DW_TAG_member
    2209                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$21)
    2210                            .dwattr $C$DW$160, DW_AT_name("id")
    2211                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("id")
    2212                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2213                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2214                            .dwattr $C$DW$160, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2215                            .dwattr $C$DW$160, DW_AT_decl_line(0x54)
    2216                            .dwattr $C$DW$160, DW_AT_decl_column(0x07)
    2217                    $C$DW$161       .dwtag  DW_TAG_member
    2218                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$21)
    2219                            .dwattr $C$DW$161, DW_AT_name("n_rootdir")
    2220                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("n_rootdir")
    2221                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2222                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2223                            .dwattr $C$DW$161, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2224                            .dwattr $C$DW$161, DW_AT_decl_line(0x55)
    2225                            .dwattr $C$DW$161, DW_AT_decl_column(0x07)
    2226                    $C$DW$162       .dwtag  DW_TAG_member
    2227                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$22)
    2228                            .dwattr $C$DW$162, DW_AT_name("last_clust")
    2229                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("last_clust")
    2230                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2231                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2232                            .dwattr $C$DW$162, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2233                            .dwattr $C$DW$162, DW_AT_decl_line(0x5d)
    2234                            .dwattr $C$DW$162, DW_AT_decl_column(0x08)
    2235                    $C$DW$163       .dwtag  DW_TAG_member
    2236                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$22)
    2237                            .dwattr $C$DW$163, DW_AT_name("free_clust")
    2238                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("free_clust")
    2239                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2240                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2241                            .dwattr $C$DW$163, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2242                            .dwattr $C$DW$163, DW_AT_decl_line(0x5e)
    2243                            .dwattr $C$DW$163, DW_AT_decl_column(0x08)
    2244                    $C$DW$164       .dwtag  DW_TAG_member
TI ARM Assembler PC v5.2.5 Sun Oct 18 09:39:50 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   42

    2245                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$22)
    2246                            .dwattr $C$DW$164, DW_AT_name("fsi_sector")
    2247                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("fsi_sector")
    2248                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2249                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2250                            .dwattr $C$DW$164, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2251                            .dwattr $C$DW$164, DW_AT_decl_line(0x5f)
    2252                            .dwattr $C$DW$164, DW_AT_decl_column(0x08)
    2253                    $C$DW$165       .dwtag  DW_TAG_member
    2254                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$22)
    2255                            .dwattr $C$DW$165, DW_AT_name("n_fatent")
    2256                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("n_fatent")
    2257                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2258                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2259                            .dwattr $C$DW$165, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2260                            .dwattr $C$DW$165, DW_AT_decl_line(0x64)
    2261                            .dwattr $C$DW$165, DW_AT_decl_column(0x08)
    2262                    $C$DW$166       .dwtag  DW_TAG_member
    2263                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$22)
    2264                            .dwattr $C$DW$166, DW_AT_name("fsize")
    2265                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("fsize")
    2266                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2267                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2268                            .dwattr $C$DW$166, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2269                            .dwattr $C$DW$166, DW_AT_decl_line(0x65)
    2270                            .dwattr $C$DW$166, DW_AT_decl_column(0x08)
    2271                    $C$DW$167       .dwtag  DW_TAG_member
    2272                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$22)
    2273                            .dwattr $C$DW$167, DW_AT_name("volbase")
    2274                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("volbase")
    2275                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2276                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2277                            .dwattr $C$DW$167, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2278                            .dwattr $C$DW$167, DW_AT_decl_line(0x66)
    2279                            .dwattr $C$DW$167, DW_AT_decl_column(0x08)
    2280                    $C$DW$168       .dwtag  DW_TAG_member
    2281                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$22)
    2282                            .dwattr $C$DW$168, DW_AT_name("fatbase")
    2283                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("fatbase")
    2284                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2285                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2286                            .dwattr $C$DW$168, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2287                            .dwattr $C$DW$168, DW_AT_decl_line(0x67)
    2288                            .dwattr $C$DW$168, DW_AT_decl_column(0x08)
    2289                    $C$DW$169       .dwtag  DW_TAG_member
    2290                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$22)
    2291                            .dwattr $C$DW$169, DW_AT_name("dirbase")
    2292                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("dirbase")
    2293                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2294                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2295                            .dwattr $C$DW$169, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2296                            .dwattr $C$DW$169, DW_AT_decl_line(0x68)
    2297                            .dwattr $C$DW$169, DW_AT_decl_column(0x08)
    2298                    $C$DW$170       .dwtag  DW_TAG_member
    2299                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$22)
TI ARM Assembler PC v5.2.5 Sun Oct 18 09:39:50 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   43

    2300                            .dwattr $C$DW$170, DW_AT_name("database")
    2301                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("database")
    2302                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2303                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2304                            .dwattr $C$DW$170, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2305                            .dwattr $C$DW$170, DW_AT_decl_line(0x69)
    2306                            .dwattr $C$DW$170, DW_AT_decl_column(0x08)
    2307                    $C$DW$171       .dwtag  DW_TAG_member
    2308                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$22)
    2309                            .dwattr $C$DW$171, DW_AT_name("winsect")
    2310                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("winsect")
    2311                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2312                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2313                            .dwattr $C$DW$171, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2314                            .dwattr $C$DW$171, DW_AT_decl_line(0x6a)
    2315                            .dwattr $C$DW$171, DW_AT_decl_column(0x08)
    2316                    $C$DW$172       .dwtag  DW_TAG_member
    2317                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$23)
    2318                            .dwattr $C$DW$172, DW_AT_name("win")
    2319                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("win")
    2320                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2321                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2322                            .dwattr $C$DW$172, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2323                            .dwattr $C$DW$172, DW_AT_decl_line(0x6b)
    2324                            .dwattr $C$DW$172, DW_AT_decl_column(0x07)
    2325                            .dwendtag $C$DW$T$24
    2326                    
    2327                            .dwattr $C$DW$T$24, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2328                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x4d)
    2329                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    2330                    $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("FATFS")
    2331                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    2332                            .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    2333                            .dwattr $C$DW$T$25, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2334                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x6c)
    2335                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x03)
    2336                    $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    2337                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    2338                            .dwattr $C$DW$T$26, DW_AT_address_class(0x20)
    2339                    
    2340                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2341                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x224)
    2342                    $C$DW$173       .dwtag  DW_TAG_member
    2343                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$26)
    2344                            .dwattr $C$DW$173, DW_AT_name("fs")
    2345                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("fs")
    2346                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2347                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2348                            .dwattr $C$DW$173, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2349                            .dwattr $C$DW$173, DW_AT_decl_line(0x73)
    2350                            .dwattr $C$DW$173, DW_AT_decl_column(0x09)
    2351                    $C$DW$174       .dwtag  DW_TAG_member
    2352                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$21)
    2353                            .dwattr $C$DW$174, DW_AT_name("id")
    2354                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("id")
TI ARM Assembler PC v5.2.5 Sun Oct 18 09:39:50 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   44

    2355                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2356                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2357                            .dwattr $C$DW$174, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2358                            .dwattr $C$DW$174, DW_AT_decl_line(0x74)
    2359                            .dwattr $C$DW$174, DW_AT_decl_column(0x07)
    2360                    $C$DW$175       .dwtag  DW_TAG_member
    2361                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$20)
    2362                            .dwattr $C$DW$175, DW_AT_name("flag")
    2363                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("flag")
    2364                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2365                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2366                            .dwattr $C$DW$175, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2367                            .dwattr $C$DW$175, DW_AT_decl_line(0x75)
    2368                            .dwattr $C$DW$175, DW_AT_decl_column(0x07)
    2369                    $C$DW$176       .dwtag  DW_TAG_member
    2370                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$20)
    2371                            .dwattr $C$DW$176, DW_AT_name("pad1")
    2372                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("pad1")
    2373                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2374                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2375                            .dwattr $C$DW$176, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2376                            .dwattr $C$DW$176, DW_AT_decl_line(0x76)
    2377                            .dwattr $C$DW$176, DW_AT_decl_column(0x07)
    2378                    $C$DW$177       .dwtag  DW_TAG_member
    2379                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$22)
    2380                            .dwattr $C$DW$177, DW_AT_name("fptr")
    2381                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("fptr")
    2382                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2383                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2384                            .dwattr $C$DW$177, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2385                            .dwattr $C$DW$177, DW_AT_decl_line(0x77)
    2386                            .dwattr $C$DW$177, DW_AT_decl_column(0x08)
    2387                    $C$DW$178       .dwtag  DW_TAG_member
    2388                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$22)
    2389                            .dwattr $C$DW$178, DW_AT_name("fsize")
    2390                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("fsize")
    2391                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2392                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2393                            .dwattr $C$DW$178, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2394                            .dwattr $C$DW$178, DW_AT_decl_line(0x78)
    2395                            .dwattr $C$DW$178, DW_AT_decl_column(0x08)
    2396                    $C$DW$179       .dwtag  DW_TAG_member
    2397                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$22)
    2398                            .dwattr $C$DW$179, DW_AT_name("sclust")
    2399                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("sclust")
    2400                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2401                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2402                            .dwattr $C$DW$179, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2403                            .dwattr $C$DW$179, DW_AT_decl_line(0x79)
    2404                            .dwattr $C$DW$179, DW_AT_decl_column(0x08)
    2405                    $C$DW$180       .dwtag  DW_TAG_member
    2406                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$22)
    2407                            .dwattr $C$DW$180, DW_AT_name("clust")
    2408                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("clust")
    2409                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
TI ARM Assembler PC v5.2.5 Sun Oct 18 09:39:50 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   45

    2410                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2411                            .dwattr $C$DW$180, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2412                            .dwattr $C$DW$180, DW_AT_decl_line(0x7a)
    2413                            .dwattr $C$DW$180, DW_AT_decl_column(0x08)
    2414                    $C$DW$181       .dwtag  DW_TAG_member
    2415                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$22)
    2416                            .dwattr $C$DW$181, DW_AT_name("dsect")
    2417                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("dsect")
    2418                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2419                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2420                            .dwattr $C$DW$181, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2421                            .dwattr $C$DW$181, DW_AT_decl_line(0x7b)
    2422                            .dwattr $C$DW$181, DW_AT_decl_column(0x08)
    2423                    $C$DW$182       .dwtag  DW_TAG_member
    2424                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$22)
    2425                            .dwattr $C$DW$182, DW_AT_name("dir_sect")
    2426                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("dir_sect")
    2427                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2428                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2429                            .dwattr $C$DW$182, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2430                            .dwattr $C$DW$182, DW_AT_decl_line(0x7d)
    2431                            .dwattr $C$DW$182, DW_AT_decl_column(0x08)
    2432                    $C$DW$183       .dwtag  DW_TAG_member
    2433                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$27)
    2434                            .dwattr $C$DW$183, DW_AT_name("dir_ptr")
    2435                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("dir_ptr")
    2436                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2437                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2438                            .dwattr $C$DW$183, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2439                            .dwattr $C$DW$183, DW_AT_decl_line(0x7e)
    2440                            .dwattr $C$DW$183, DW_AT_decl_column(0x08)
    2441                    $C$DW$184       .dwtag  DW_TAG_member
    2442                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$23)
    2443                            .dwattr $C$DW$184, DW_AT_name("buf")
    2444                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("buf")
    2445                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2446                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2447                            .dwattr $C$DW$184, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2448                            .dwattr $C$DW$184, DW_AT_decl_line(0x87)
    2449                            .dwattr $C$DW$184, DW_AT_decl_column(0x07)
    2450                            .dwendtag $C$DW$T$28
    2451                    
    2452                            .dwattr $C$DW$T$28, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2453                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x72)
    2454                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    2455                    $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("FIL")
    2456                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$28)
    2457                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    2458                            .dwattr $C$DW$T$45, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2459                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x89)
    2460                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x03)
    2461                    
    2462                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2463                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x1c)
    2464                    $C$DW$185       .dwtag  DW_TAG_member
TI ARM Assembler PC v5.2.5 Sun Oct 18 09:39:50 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   46

    2465                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$26)
    2466                            .dwattr $C$DW$185, DW_AT_name("fs")
    2467                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("fs")
    2468                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2469                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2470                            .dwattr $C$DW$185, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2471                            .dwattr $C$DW$185, DW_AT_decl_line(0x90)
    2472                            .dwattr $C$DW$185, DW_AT_decl_column(0x09)
    2473                    $C$DW$186       .dwtag  DW_TAG_member
    2474                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$21)
    2475                            .dwattr $C$DW$186, DW_AT_name("id")
    2476                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("id")
    2477                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2478                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2479                            .dwattr $C$DW$186, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2480                            .dwattr $C$DW$186, DW_AT_decl_line(0x91)
    2481                            .dwattr $C$DW$186, DW_AT_decl_column(0x07)
    2482                    $C$DW$187       .dwtag  DW_TAG_member
    2483                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$21)
    2484                            .dwattr $C$DW$187, DW_AT_name("index")
    2485                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("index")
    2486                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2487                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2488                            .dwattr $C$DW$187, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2489                            .dwattr $C$DW$187, DW_AT_decl_line(0x92)
    2490                            .dwattr $C$DW$187, DW_AT_decl_column(0x07)
    2491                    $C$DW$188       .dwtag  DW_TAG_member
    2492                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$22)
    2493                            .dwattr $C$DW$188, DW_AT_name("sclust")
    2494                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("sclust")
    2495                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2496                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2497                            .dwattr $C$DW$188, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2498                            .dwattr $C$DW$188, DW_AT_decl_line(0x93)
    2499                            .dwattr $C$DW$188, DW_AT_decl_column(0x08)
    2500                    $C$DW$189       .dwtag  DW_TAG_member
    2501                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$22)
    2502                            .dwattr $C$DW$189, DW_AT_name("clust")
    2503                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("clust")
    2504                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2505                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2506                            .dwattr $C$DW$189, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2507                            .dwattr $C$DW$189, DW_AT_decl_line(0x94)
    2508                            .dwattr $C$DW$189, DW_AT_decl_column(0x08)
    2509                    $C$DW$190       .dwtag  DW_TAG_member
    2510                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$22)
    2511                            .dwattr $C$DW$190, DW_AT_name("sect")
    2512                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("sect")
    2513                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2514                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2515                            .dwattr $C$DW$190, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2516                            .dwattr $C$DW$190, DW_AT_decl_line(0x95)
    2517                            .dwattr $C$DW$190, DW_AT_decl_column(0x08)
    2518                    $C$DW$191       .dwtag  DW_TAG_member
    2519                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$27)
TI ARM Assembler PC v5.2.5 Sun Oct 18 09:39:50 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   47

    2520                            .dwattr $C$DW$191, DW_AT_name("dir")
    2521                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("dir")
    2522                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2523                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2524                            .dwattr $C$DW$191, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2525                            .dwattr $C$DW$191, DW_AT_decl_line(0x96)
    2526                            .dwattr $C$DW$191, DW_AT_decl_column(0x08)
    2527                    $C$DW$192       .dwtag  DW_TAG_member
    2528                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$27)
    2529                            .dwattr $C$DW$192, DW_AT_name("fn")
    2530                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("fn")
    2531                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2532                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2533                            .dwattr $C$DW$192, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2534                            .dwattr $C$DW$192, DW_AT_decl_line(0x97)
    2535                            .dwattr $C$DW$192, DW_AT_decl_column(0x08)
    2536                            .dwendtag $C$DW$T$29
    2537                    
    2538                            .dwattr $C$DW$T$29, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2539                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x8f)
    2540                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    2541                    $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("DIR")
    2542                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$29)
    2543                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    2544                            .dwattr $C$DW$T$46, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2545                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x9c)
    2546                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x03)
    2547                    
    2548                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2549                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x18)
    2550                    $C$DW$193       .dwtag  DW_TAG_member
    2551                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$22)
    2552                            .dwattr $C$DW$193, DW_AT_name("fsize")
    2553                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("fsize")
    2554                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2555                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2556                            .dwattr $C$DW$193, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2557                            .dwattr $C$DW$193, DW_AT_decl_line(0xa3)
    2558                            .dwattr $C$DW$193, DW_AT_decl_column(0x08)
    2559                    $C$DW$194       .dwtag  DW_TAG_member
    2560                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$21)
    2561                            .dwattr $C$DW$194, DW_AT_name("fdate")
    2562                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("fdate")
    2563                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2564                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2565                            .dwattr $C$DW$194, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2566                            .dwattr $C$DW$194, DW_AT_decl_line(0xa4)
    2567                            .dwattr $C$DW$194, DW_AT_decl_column(0x07)
    2568                    $C$DW$195       .dwtag  DW_TAG_member
    2569                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$21)
    2570                            .dwattr $C$DW$195, DW_AT_name("ftime")
    2571                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("ftime")
    2572                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2573                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2574                            .dwattr $C$DW$195, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
TI ARM Assembler PC v5.2.5 Sun Oct 18 09:39:50 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   48

    2575                            .dwattr $C$DW$195, DW_AT_decl_line(0xa5)
    2576                            .dwattr $C$DW$195, DW_AT_decl_column(0x07)
    2577                    $C$DW$196       .dwtag  DW_TAG_member
    2578                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$20)
    2579                            .dwattr $C$DW$196, DW_AT_name("fattrib")
    2580                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("fattrib")
    2581                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2582                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2583                            .dwattr $C$DW$196, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2584                            .dwattr $C$DW$196, DW_AT_decl_line(0xa6)
    2585                            .dwattr $C$DW$196, DW_AT_decl_column(0x07)
    2586                    $C$DW$197       .dwtag  DW_TAG_member
    2587                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$32)
    2588                            .dwattr $C$DW$197, DW_AT_name("fname")
    2589                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("fname")
    2590                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2591                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2592                            .dwattr $C$DW$197, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2593                            .dwattr $C$DW$197, DW_AT_decl_line(0xa7)
    2594                            .dwattr $C$DW$197, DW_AT_decl_column(0x08)
    2595                            .dwendtag $C$DW$T$33
    2596                    
    2597                            .dwattr $C$DW$T$33, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2598                            .dwattr $C$DW$T$33, DW_AT_decl_line(0xa2)
    2599                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    2600                    $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("FILINFO")
    2601                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$33)
    2602                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    2603                            .dwattr $C$DW$T$47, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2604                            .dwattr $C$DW$T$47, DW_AT_decl_line(0xac)
    2605                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x03)
    2606                    
    2607                    $C$DW$T$35      .dwtag  DW_TAG_union_type
    2608                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x10)
    2609                    $C$DW$198       .dwtag  DW_TAG_member
    2610                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$34)
    2611                            .dwattr $C$DW$198, DW_AT_name("_Us")
    2612                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("_Us")
    2613                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2614                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2615                            .dwattr $C$DW$198, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2616                            .dwattr $C$DW$198, DW_AT_decl_line(0x3a)
    2617                            .dwattr $C$DW$198, DW_AT_decl_column(0x12)
    2618                    $C$DW$199       .dwtag  DW_TAG_member
    2619                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$16)
    2620                            .dwattr $C$DW$199, DW_AT_name("_Float")
    2621                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("_Float")
    2622                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2623                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2624                            .dwattr $C$DW$199, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2625                            .dwattr $C$DW$199, DW_AT_decl_line(0x3b)
    2626                            .dwattr $C$DW$199, DW_AT_decl_column(0x09)
    2627                    $C$DW$200       .dwtag  DW_TAG_member
    2628                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$17)
    2629                            .dwattr $C$DW$200, DW_AT_name("_Double")
TI ARM Assembler PC v5.2.5 Sun Oct 18 09:39:50 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   49

    2630                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("_Double")
    2631                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2632                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2633                            .dwattr $C$DW$200, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2634                            .dwattr $C$DW$200, DW_AT_decl_line(0x3c)
    2635                            .dwattr $C$DW$200, DW_AT_decl_column(0x0a)
    2636                    $C$DW$201       .dwtag  DW_TAG_member
    2637                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$18)
    2638                            .dwattr $C$DW$201, DW_AT_name("_Long_double")
    2639                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("_Long_double")
    2640                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2641                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2642                            .dwattr $C$DW$201, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2643                            .dwattr $C$DW$201, DW_AT_decl_line(0x3d)
    2644                            .dwattr $C$DW$201, DW_AT_decl_column(0x0f)
    2645                            .dwendtag $C$DW$T$35
    2646                    
    2647                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float
    2648                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x39)
    2649                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x03)
    2650                    
    2651                    $C$DW$T$36      .dwtag  DW_TAG_union_type
    2652                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x10)
    2653                    $C$DW$202       .dwtag  DW_TAG_member
    2654                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$34)
    2655                            .dwattr $C$DW$202, DW_AT_name("_Word")
    2656                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("_Word")
    2657                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2658                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2659                            .dwattr $C$DW$202, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath.
    2660                            .dwattr $C$DW$202, DW_AT_decl_line(0x8f)
    2661                            .dwattr $C$DW$202, DW_AT_decl_column(0x11)
    2662                    $C$DW$203       .dwtag  DW_TAG_member
    2663                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$16)
    2664                            .dwattr $C$DW$203, DW_AT_name("_Float")
    2665                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("_Float")
    2666                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2667                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2668                            .dwattr $C$DW$203, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath.
    2669                            .dwattr $C$DW$203, DW_AT_decl_line(0x90)
    2670                            .dwattr $C$DW$203, DW_AT_decl_column(0x08)
    2671                    $C$DW$204       .dwtag  DW_TAG_member
    2672                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$17)
    2673                            .dwattr $C$DW$204, DW_AT_name("_Double")
    2674                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("_Double")
    2675                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2676                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2677                            .dwattr $C$DW$204, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath.
    2678                            .dwattr $C$DW$204, DW_AT_decl_line(0x91)
    2679                            .dwattr $C$DW$204, DW_AT_decl_column(0x09)
    2680                    $C$DW$205       .dwtag  DW_TAG_member
    2681                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$18)
    2682                            .dwattr $C$DW$205, DW_AT_name("_Long_double")
    2683                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("_Long_double")
    2684                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v5.2.5 Sun Oct 18 09:39:50 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   50

    2685                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2686                            .dwattr $C$DW$205, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath.
    2687                            .dwattr $C$DW$205, DW_AT_decl_line(0x92)
    2688                            .dwattr $C$DW$205, DW_AT_decl_column(0x0e)
    2689                            .dwendtag $C$DW$T$36
    2690                    
    2691                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath
    2692                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x8e)
    2693                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x02)
    2694                    $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("_Dconst")
    2695                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$36)
    2696                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    2697                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath
    2698                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x93)
    2699                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x04)
    2700                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2701                            .dwattr $C$DW$T$2, DW_AT_name("void")
    2702                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2703                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2704                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2705                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    2706                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2707                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    2708                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2709                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    2710                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2711                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2712                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2713                    $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    2714                            .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$5)
    2715                            .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    2716                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2717                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x2a)
    2718                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x1d)
    2719                    $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
    2720                            .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    2721                            .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    2722                            .dwattr $C$DW$T$66, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2723                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x37)
    2724                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x17)
    2725                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    2726                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2727                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2728                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2729                    $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("BYTE")
    2730                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$6)
    2731                            .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    2732                            .dwattr $C$DW$T$20, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2733                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x16)
    2734                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x17)
    2735                    $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("DSTATUS")
    2736                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$20)
    2737                            .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    2738                            .dwattr $C$DW$T$67, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2739                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x13)
TI ARM Assembler PC v5.2.5 Sun Oct 18 09:39:50 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   51

    2740                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x0e)
    2741                    
    2742                    $C$DW$T$23      .dwtag  DW_TAG_array_type
    2743                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$20)
    2744                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    2745                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x200)
    2746                    $C$DW$206       .dwtag  DW_TAG_subrange_type
    2747                            .dwattr $C$DW$206, DW_AT_upper_bound(0x1ff)
    2748                            .dwendtag $C$DW$T$23
    2749                    
    2750                    $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    2751                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$20)
    2752                            .dwattr $C$DW$T$27, DW_AT_address_class(0x20)
    2753                    $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("UCHAR")
    2754                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$6)
    2755                            .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    2756                            .dwattr $C$DW$T$68, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2757                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x15)
    2758                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x17)
    2759                    $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    2760                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$6)
    2761                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    2762                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2763                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x2b)
    2764                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x1c)
    2765                    $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
    2766                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$50)
    2767                            .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    2768                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2769                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x38)
    2770                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x16)
    2771                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    2772                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2773                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2774                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    2775                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    2776                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2777                            .dwattr $C$DW$T$8, DW_AT_name("short")
    2778                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    2779                    $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("SHORT")
    2780                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$8)
    2781                            .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    2782                            .dwattr $C$DW$T$72, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2783                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x19)
    2784                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x11)
    2785                    $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
    2786                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$8)
    2787                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    2788                            .dwattr $C$DW$T$73, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2789                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x2c)
    2790                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x1d)
    2791                    $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
    2792                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    2793                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    2794                            .dwattr $C$DW$T$74, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
TI ARM Assembler PC v5.2.5 Sun Oct 18 09:39:50 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   52

    2795                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x3a)
    2796                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x17)
    2797                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    2798                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2799                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2800                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    2801                    $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("USHORT")
    2802                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$9)
    2803                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2804                            .dwattr $C$DW$T$75, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2805                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x1a)
    2806                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x18)
    2807                    $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("WCHAR")
    2808                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$9)
    2809                            .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    2810                            .dwattr $C$DW$T$76, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2811                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x1c)
    2812                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x18)
    2813                    $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("WORD")
    2814                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$9)
    2815                            .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    2816                            .dwattr $C$DW$T$21, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2817                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x1b)
    2818                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x18)
    2819                    $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("_Wchart")
    2820                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$9)
    2821                            .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    2822                            .dwattr $C$DW$T$77, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yvals
    2823                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x1e5)
    2824                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x21)
    2825                    $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("_Wintt")
    2826                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$9)
    2827                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    2828                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yvals
    2829                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x1e6)
    2830                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x21)
    2831                    
    2832                    $C$DW$T$34      .dwtag  DW_TAG_array_type
    2833                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$9)
    2834                            .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    2835                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x10)
    2836                    $C$DW$207       .dwtag  DW_TAG_subrange_type
    2837                            .dwattr $C$DW$207, DW_AT_upper_bound(0x07)
    2838                            .dwendtag $C$DW$T$34
    2839                    
    2840                    $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    2841                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$9)
    2842                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    2843                            .dwattr $C$DW$T$79, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2844                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x2d)
    2845                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x1c)
    2846                    $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
    2847                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    2848                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    2849                            .dwattr $C$DW$T$80, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
TI ARM Assembler PC v5.2.5 Sun Oct 18 09:39:50 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   53

    2850                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x3b)
    2851                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x16)
    2852                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    2853                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2854                            .dwattr $C$DW$T$10, DW_AT_name("int")
    2855                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    2856                    $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("INT")
    2857                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$10)
    2858                            .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    2859                            .dwattr $C$DW$T$81, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2860                            .dwattr $C$DW$T$81, DW_AT_decl_line(0x10)
    2861                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x10)
    2862                    $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("_Ptrdifft")
    2863                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$10)
    2864                            .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    2865                            .dwattr $C$DW$T$82, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yvals
    2866                            .dwattr $C$DW$T$82, DW_AT_decl_line(0xa9)
    2867                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x1e)
    2868                    $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
    2869                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$10)
    2870                            .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    2871                            .dwattr $C$DW$T$84, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2872                            .dwattr $C$DW$T$84, DW_AT_decl_line(0x2e)
    2873                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x1d)
    2874                    $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast16_t")
    2875                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    2876                            .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    2877                            .dwattr $C$DW$T$85, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2878                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x47)
    2879                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x17)
    2880                    $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast32_t")
    2881                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$84)
    2882                            .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    2883                            .dwattr $C$DW$T$86, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2884                            .dwattr $C$DW$T$86, DW_AT_decl_line(0x4a)
    2885                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x17)
    2886                    $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast8_t")
    2887                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$84)
    2888                            .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    2889                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2890                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x45)
    2891                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x17)
    2892                    $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("int_least32_t")
    2893                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$84)
    2894                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    2895                            .dwattr $C$DW$T$88, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2896                            .dwattr $C$DW$T$88, DW_AT_decl_line(0x3c)
    2897                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x17)
    2898                    $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("intptr_t")
    2899                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$10)
    2900                            .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    2901                            .dwattr $C$DW$T$89, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2902                            .dwattr $C$DW$T$89, DW_AT_decl_line(0x52)
    2903                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x1a)
    2904                    $C$DW$T$11      .dwtag  DW_TAG_base_type
TI ARM Assembler PC v5.2.5 Sun Oct 18 09:39:50 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   54

    2905                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2906                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    2907                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    2908                    $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("UINT")
    2909                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$11)
    2910                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    2911                            .dwattr $C$DW$T$90, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2912                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x11)
    2913                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x16)
    2914                    $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("_Sizet")
    2915                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$11)
    2916                            .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    2917                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yvals
    2918                            .dwattr $C$DW$T$91, DW_AT_decl_line(0xab)
    2919                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x1a)
    2920                    $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("_TI_uint32_t")
    2921                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$11)
    2922                            .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    2923                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath
    2924                            .dwattr $C$DW$T$92, DW_AT_decl_line(0xb6)
    2925                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x19)
    2926                    $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
    2927                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$11)
    2928                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    2929                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2930                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x2f)
    2931                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x1c)
    2932                    $C$DW$T$98      .dwtag  DW_TAG_volatile_type
    2933                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$49)
    2934                    $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast16_t")
    2935                            .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$49)
    2936                            .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    2937                            .dwattr $C$DW$T$99, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2938                            .dwattr $C$DW$T$99, DW_AT_decl_line(0x48)
    2939                            .dwattr $C$DW$T$99, DW_AT_decl_column(0x16)
    2940                    $C$DW$T$100     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast32_t")
    2941                            .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$49)
    2942                            .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    2943                            .dwattr $C$DW$T$100, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    2944                            .dwattr $C$DW$T$100, DW_AT_decl_line(0x4b)
    2945                            .dwattr $C$DW$T$100, DW_AT_decl_column(0x16)
    2946                    $C$DW$T$101     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast8_t")
    2947                            .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$49)
    2948                            .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    2949                            .dwattr $C$DW$T$101, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    2950                            .dwattr $C$DW$T$101, DW_AT_decl_line(0x46)
    2951                            .dwattr $C$DW$T$101, DW_AT_decl_column(0x16)
    2952                    $C$DW$T$102     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least32_t")
    2953                            .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$49)
    2954                            .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    2955                            .dwattr $C$DW$T$102, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    2956                            .dwattr $C$DW$T$102, DW_AT_decl_line(0x3d)
    2957                            .dwattr $C$DW$T$102, DW_AT_decl_column(0x16)
    2958                    $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("uintptr_t")
    2959                            .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$11)
TI ARM Assembler PC v5.2.5 Sun Oct 18 09:39:50 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   55

    2960                            .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    2961                            .dwattr $C$DW$T$103, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    2962                            .dwattr $C$DW$T$103, DW_AT_decl_line(0x53)
    2963                            .dwattr $C$DW$T$103, DW_AT_decl_column(0x1a)
    2964                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    2965                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    2966                            .dwattr $C$DW$T$12, DW_AT_name("long")
    2967                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    2968                    $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("LONG")
    2969                            .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$12)
    2970                            .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    2971                            .dwattr $C$DW$T$104, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2972                            .dwattr $C$DW$T$104, DW_AT_decl_line(0x1f)
    2973                            .dwattr $C$DW$T$104, DW_AT_decl_column(0x10)
    2974                    $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("_Int32t")
    2975                            .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$12)
    2976                            .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    2977                            .dwattr $C$DW$T$105, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yval
    2978                            .dwattr $C$DW$T$105, DW_AT_decl_line(0xa6)
    2979                            .dwattr $C$DW$T$105, DW_AT_decl_column(0x0e)
    2980                    $C$DW$T$13      .dwtag  DW_TAG_base_type
    2981                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    2982                            .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    2983                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
    2984                    $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("DWORD")
    2985                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$13)
    2986                            .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    2987                            .dwattr $C$DW$T$22, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2988                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x21)
    2989                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x17)
    2990                    $C$DW$T$106     .dwtag  DW_TAG_typedef, DW_AT_name("ULONG")
    2991                            .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$13)
    2992                            .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    2993                            .dwattr $C$DW$T$106, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2994                            .dwattr $C$DW$T$106, DW_AT_decl_line(0x20)
    2995                            .dwattr $C$DW$T$106, DW_AT_decl_column(0x17)
    2996                    $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("_Uint32t")
    2997                            .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$13)
    2998                            .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    2999                            .dwattr $C$DW$T$107, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yval
    3000                            .dwattr $C$DW$T$107, DW_AT_decl_line(0xa7)
    3001                            .dwattr $C$DW$T$107, DW_AT_decl_column(0x17)
    3002                    $C$DW$T$14      .dwtag  DW_TAG_base_type
    3003                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    3004                            .dwattr $C$DW$T$14, DW_AT_name("long long")
    3005                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    3006                    $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("_Longlong")
    3007                            .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$14)
    3008                            .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
    3009                            .dwattr $C$DW$T$108, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yval
    3010                            .dwattr $C$DW$T$108, DW_AT_decl_line(0x1b5)
    3011                            .dwattr $C$DW$T$108, DW_AT_decl_column(0x13)
    3012                    $C$DW$T$109     .dwtag  DW_TAG_typedef, DW_AT_name("int64_t")
    3013                            .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$14)
    3014                            .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v5.2.5 Sun Oct 18 09:39:50 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   56

    3015                            .dwattr $C$DW$T$109, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3016                            .dwattr $C$DW$T$109, DW_AT_decl_line(0x32)
    3017                            .dwattr $C$DW$T$109, DW_AT_decl_column(0x21)
    3018                    $C$DW$T$110     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast64_t")
    3019                            .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$109)
    3020                            .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    3021                            .dwattr $C$DW$T$110, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3022                            .dwattr $C$DW$T$110, DW_AT_decl_line(0x4e)
    3023                            .dwattr $C$DW$T$110, DW_AT_decl_column(0x17)
    3024                    $C$DW$T$111     .dwtag  DW_TAG_typedef, DW_AT_name("int_least64_t")
    3025                            .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$109)
    3026                            .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
    3027                            .dwattr $C$DW$T$111, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3028                            .dwattr $C$DW$T$111, DW_AT_decl_line(0x40)
    3029                            .dwattr $C$DW$T$111, DW_AT_decl_column(0x17)
    3030                    $C$DW$T$112     .dwtag  DW_TAG_typedef, DW_AT_name("intmax_t")
    3031                            .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$14)
    3032                            .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    3033                            .dwattr $C$DW$T$112, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3034                            .dwattr $C$DW$T$112, DW_AT_decl_line(0x56)
    3035                            .dwattr $C$DW$T$112, DW_AT_decl_column(0x20)
    3036                    $C$DW$T$15      .dwtag  DW_TAG_base_type
    3037                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    3038                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    3039                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    3040                    $C$DW$T$113     .dwtag  DW_TAG_typedef, DW_AT_name("_TI_uint64_t")
    3041                            .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$15)
    3042                            .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    3043                            .dwattr $C$DW$T$113, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymat
    3044                            .dwattr $C$DW$T$113, DW_AT_decl_line(0xbc)
    3045                            .dwattr $C$DW$T$113, DW_AT_decl_column(0x1c)
    3046                    $C$DW$T$114     .dwtag  DW_TAG_typedef, DW_AT_name("_ULonglong")
    3047                            .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$15)
    3048                            .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    3049                            .dwattr $C$DW$T$114, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yval
    3050                            .dwattr $C$DW$T$114, DW_AT_decl_line(0x1b6)
    3051                            .dwattr $C$DW$T$114, DW_AT_decl_column(0x14)
    3052                    $C$DW$T$115     .dwtag  DW_TAG_typedef, DW_AT_name("uint64_t")
    3053                            .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$15)
    3054                            .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
    3055                            .dwattr $C$DW$T$115, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3056                            .dwattr $C$DW$T$115, DW_AT_decl_line(0x33)
    3057                            .dwattr $C$DW$T$115, DW_AT_decl_column(0x20)
    3058                    $C$DW$T$116     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast64_t")
    3059                            .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$115)
    3060                            .dwattr $C$DW$T$116, DW_AT_language(DW_LANG_C)
    3061                            .dwattr $C$DW$T$116, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3062                            .dwattr $C$DW$T$116, DW_AT_decl_line(0x4f)
    3063                            .dwattr $C$DW$T$116, DW_AT_decl_column(0x16)
    3064                    $C$DW$T$117     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least64_t")
    3065                            .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$115)
    3066                            .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
    3067                            .dwattr $C$DW$T$117, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3068                            .dwattr $C$DW$T$117, DW_AT_decl_line(0x41)
    3069                            .dwattr $C$DW$T$117, DW_AT_decl_column(0x16)
TI ARM Assembler PC v5.2.5 Sun Oct 18 09:39:50 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   57

    3070                    $C$DW$T$118     .dwtag  DW_TAG_typedef, DW_AT_name("uintmax_t")
    3071                            .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$15)
    3072                            .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
    3073                            .dwattr $C$DW$T$118, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3074                            .dwattr $C$DW$T$118, DW_AT_decl_line(0x57)
    3075                            .dwattr $C$DW$T$118, DW_AT_decl_column(0x20)
    3076                    $C$DW$T$16      .dwtag  DW_TAG_base_type
    3077                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    3078                            .dwattr $C$DW$T$16, DW_AT_name("float")
    3079                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
