TI ARM Assembler PC v5.2.5 Thu Oct 22 12:50:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                             PC v5.2.5 *
       3                    ;* Date/Time created: Thu Oct 22 12:50:14 2015                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --disab
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../timers.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.2.5 Copyright (c) 1996-2015 Te
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("E:\Dev\Ti\Code\GIT\LaunchpadRoomControl\LaunchpadRoomControl
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("GPIOPinWrite")

    2060                    $C$DW$143       .dwtag  DW_TAG_enumerator, DW_AT_name("FR_NOT_ENOUGH_CORE"), DW_AT_const_value(0x11)
    2061                            .dwattr $C$DW$143, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2062                            .dwattr $C$DW$143, DW_AT_decl_line(0xc4)
    2063                            .dwattr $C$DW$143, DW_AT_decl_column(0x02)
    2064                    $C$DW$144       .dwtag  DW_TAG_enumerator, DW_AT_name("FR_TOO_MANY_OPEN_FILES"), DW_AT_const_value(0x1
    2065                            .dwattr $C$DW$144, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2066                            .dwattr $C$DW$144, DW_AT_decl_line(0xc5)
    2067                            .dwattr $C$DW$144, DW_AT_decl_column(0x02)
    2068                    $C$DW$145       .dwtag  DW_TAG_enumerator, DW_AT_name("FR_INVALID_PARAMETER"), DW_AT_const_value(0x13)
    2069                            .dwattr $C$DW$145, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2070                            .dwattr $C$DW$145, DW_AT_decl_line(0xc6)
    2071                            .dwattr $C$DW$145, DW_AT_decl_column(0x02)
    2072                            .dwendtag $C$DW$T$40
    2073                    
    2074                            .dwattr $C$DW$T$40, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2075                            .dwattr $C$DW$T$40, DW_AT_decl_line(0xb2)
    2076                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x0e)
    2077                    $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("FRESULT")
    2078                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    2079                            .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    2080                            .dwattr $C$DW$T$41, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2081                            .dwattr $C$DW$T$41, DW_AT_decl_line(0xc7)
    2082                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x03)
    2083                    
    2084                    $C$DW$T$42      .dwtag  DW_TAG_enumeration_type
    2085                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    2086                    $C$DW$146       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_OK"), DW_AT_const_value(0x00)
    2087                            .dwattr $C$DW$146, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2088                            .dwattr $C$DW$146, DW_AT_decl_line(0x17)
    2089                            .dwattr $C$DW$146, DW_AT_decl_column(0x02)
    2090                    $C$DW$147       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_ERROR"), DW_AT_const_value(0x01)
    2091                            .dwattr $C$DW$147, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2092                            .dwattr $C$DW$147, DW_AT_decl_line(0x18)
    2093                            .dwattr $C$DW$147, DW_AT_decl_column(0x02)
    2094                    $C$DW$148       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_WRPRT"), DW_AT_const_value(0x02)
    2095                            .dwattr $C$DW$148, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2096                            .dwattr $C$DW$148, DW_AT_decl_line(0x19)
    2097                            .dwattr $C$DW$148, DW_AT_decl_column(0x02)
    2098                    $C$DW$149       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_NOTRDY"), DW_AT_const_value(0x03)
    2099                            .dwattr $C$DW$149, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2100                            .dwattr $C$DW$149, DW_AT_decl_line(0x1a)
    2101                            .dwattr $C$DW$149, DW_AT_decl_column(0x02)
    2102                    $C$DW$150       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_PARERR"), DW_AT_const_value(0x04)
    2103                            .dwattr $C$DW$150, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
TI ARM Assembler PC v5.2.5 Thu Oct 22 12:50:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   40

    2104                            .dwattr $C$DW$150, DW_AT_decl_line(0x1b)
    2105                            .dwattr $C$DW$150, DW_AT_decl_column(0x02)
    2106                            .dwendtag $C$DW$T$42
    2107                    
    2108                            .dwattr $C$DW$T$42, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2109                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x16)
    2110                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x0e)
    2111                    $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("DRESULT")
    2112                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    2113                            .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    2114                            .dwattr $C$DW$T$43, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2115                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x1c)
    2116                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x03)
    2117                    
    2118                    $C$DW$T$19      .dwtag  DW_TAG_structure_type
    2119                            .dwattr $C$DW$T$19, DW_AT_byte_size(0x48)
    2120                    $C$DW$151       .dwtag  DW_TAG_member
    2121                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$10)
    2122                            .dwattr $C$DW$151, DW_AT_name("_Ddig")
    2123                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("_Ddig")
    2124                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2125                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2126                            .dwattr $C$DW$151, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2127                            .dwattr $C$DW$151, DW_AT_decl_line(0x37)
    2128                            .dwattr $C$DW$151, DW_AT_decl_column(0x06)
    2129                    $C$DW$152       .dwtag  DW_TAG_member
    2130                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$10)
    2131                            .dwattr $C$DW$152, DW_AT_name("_Dmdig")
    2132                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("_Dmdig")
    2133                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2134                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2135                            .dwattr $C$DW$152, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2136                            .dwattr $C$DW$152, DW_AT_decl_line(0x37)
    2137                            .dwattr $C$DW$152, DW_AT_decl_column(0x0d)
    2138                    $C$DW$153       .dwtag  DW_TAG_member
    2139                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$10)
    2140                            .dwattr $C$DW$153, DW_AT_name("_Dmax10e")
    2141                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("_Dmax10e")
    2142                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2143                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2144                            .dwattr $C$DW$153, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2145                            .dwattr $C$DW$153, DW_AT_decl_line(0x37)
    2146                            .dwattr $C$DW$153, DW_AT_decl_column(0x15)
    2147                    $C$DW$154       .dwtag  DW_TAG_member
    2148                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$10)
    2149                            .dwattr $C$DW$154, DW_AT_name("_Dmaxe")
    2150                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("_Dmaxe")
    2151                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2152                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2153                            .dwattr $C$DW$154, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2154                            .dwattr $C$DW$154, DW_AT_decl_line(0x37)
    2155                            .dwattr $C$DW$154, DW_AT_decl_column(0x1f)
    2156                    $C$DW$155       .dwtag  DW_TAG_member
    2157                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$10)
    2158                            .dwattr $C$DW$155, DW_AT_name("_Dmin10e")
TI ARM Assembler PC v5.2.5 Thu Oct 22 12:50:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   41

    2159                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("_Dmin10e")
    2160                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2161                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2162                            .dwattr $C$DW$155, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2163                            .dwattr $C$DW$155, DW_AT_decl_line(0x37)
    2164                            .dwattr $C$DW$155, DW_AT_decl_column(0x27)
    2165                    $C$DW$156       .dwtag  DW_TAG_member
    2166                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$10)
    2167                            .dwattr $C$DW$156, DW_AT_name("_Dmine")
    2168                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("_Dmine")
    2169                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2170                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2171                            .dwattr $C$DW$156, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2172                            .dwattr $C$DW$156, DW_AT_decl_line(0x37)
    2173                            .dwattr $C$DW$156, DW_AT_decl_column(0x31)
    2174                    $C$DW$157       .dwtag  DW_TAG_member
    2175                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$35)
    2176                            .dwattr $C$DW$157, DW_AT_name("_Deps")
    2177                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("_Deps")
    2178                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2179                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2180                            .dwattr $C$DW$157, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2181                            .dwattr $C$DW$157, DW_AT_decl_line(0x3e)
    2182                            .dwattr $C$DW$157, DW_AT_decl_column(0x05)
    2183                    $C$DW$158       .dwtag  DW_TAG_member
    2184                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$35)
    2185                            .dwattr $C$DW$158, DW_AT_name("_Dmax")
    2186                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("_Dmax")
    2187                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2188                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2189                            .dwattr $C$DW$158, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2190                            .dwattr $C$DW$158, DW_AT_decl_line(0x3e)
    2191                            .dwattr $C$DW$158, DW_AT_decl_column(0x0c)
    2192                    $C$DW$159       .dwtag  DW_TAG_member
    2193                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$35)
    2194                            .dwattr $C$DW$159, DW_AT_name("_Dmin")
    2195                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("_Dmin")
    2196                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2197                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2198                            .dwattr $C$DW$159, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2199                            .dwattr $C$DW$159, DW_AT_decl_line(0x3e)
    2200                            .dwattr $C$DW$159, DW_AT_decl_column(0x13)
    2201                            .dwendtag $C$DW$T$19
    2202                    
    2203                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float
    2204                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x36)
    2205                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x02)
    2206                    $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("_Dvals")
    2207                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$19)
    2208                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    2209                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float
    2210                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x3f)
    2211                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x04)
    2212                    
    2213                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v5.2.5 Thu Oct 22 12:50:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   42

    2214                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x234)
    2215                    $C$DW$160       .dwtag  DW_TAG_member
    2216                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$20)
    2217                            .dwattr $C$DW$160, DW_AT_name("fs_type")
    2218                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("fs_type")
    2219                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2220                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2221                            .dwattr $C$DW$160, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2222                            .dwattr $C$DW$160, DW_AT_decl_line(0x4e)
    2223                            .dwattr $C$DW$160, DW_AT_decl_column(0x07)
    2224                    $C$DW$161       .dwtag  DW_TAG_member
    2225                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$20)
    2226                            .dwattr $C$DW$161, DW_AT_name("drv")
    2227                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("drv")
    2228                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2229                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2230                            .dwattr $C$DW$161, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2231                            .dwattr $C$DW$161, DW_AT_decl_line(0x4f)
    2232                            .dwattr $C$DW$161, DW_AT_decl_column(0x07)
    2233                    $C$DW$162       .dwtag  DW_TAG_member
    2234                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    2235                            .dwattr $C$DW$162, DW_AT_name("csize")
    2236                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("csize")
    2237                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2238                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2239                            .dwattr $C$DW$162, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2240                            .dwattr $C$DW$162, DW_AT_decl_line(0x50)
    2241                            .dwattr $C$DW$162, DW_AT_decl_column(0x07)
    2242                    $C$DW$163       .dwtag  DW_TAG_member
    2243                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$20)
    2244                            .dwattr $C$DW$163, DW_AT_name("n_fats")
    2245                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("n_fats")
    2246                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2247                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2248                            .dwattr $C$DW$163, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2249                            .dwattr $C$DW$163, DW_AT_decl_line(0x51)
    2250                            .dwattr $C$DW$163, DW_AT_decl_column(0x07)
    2251                    $C$DW$164       .dwtag  DW_TAG_member
    2252                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$20)
    2253                            .dwattr $C$DW$164, DW_AT_name("wflag")
    2254                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("wflag")
    2255                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2256                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2257                            .dwattr $C$DW$164, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2258                            .dwattr $C$DW$164, DW_AT_decl_line(0x52)
    2259                            .dwattr $C$DW$164, DW_AT_decl_column(0x07)
    2260                    $C$DW$165       .dwtag  DW_TAG_member
    2261                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$20)
    2262                            .dwattr $C$DW$165, DW_AT_name("fsi_flag")
    2263                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("fsi_flag")
    2264                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2265                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2266                            .dwattr $C$DW$165, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2267                            .dwattr $C$DW$165, DW_AT_decl_line(0x53)
    2268                            .dwattr $C$DW$165, DW_AT_decl_column(0x07)
TI ARM Assembler PC v5.2.5 Thu Oct 22 12:50:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   43

    2269                    $C$DW$166       .dwtag  DW_TAG_member
    2270                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$21)
    2271                            .dwattr $C$DW$166, DW_AT_name("id")
    2272                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("id")
    2273                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2274                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2275                            .dwattr $C$DW$166, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2276                            .dwattr $C$DW$166, DW_AT_decl_line(0x54)
    2277                            .dwattr $C$DW$166, DW_AT_decl_column(0x07)
    2278                    $C$DW$167       .dwtag  DW_TAG_member
    2279                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$21)
    2280                            .dwattr $C$DW$167, DW_AT_name("n_rootdir")
    2281                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("n_rootdir")
    2282                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2283                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2284                            .dwattr $C$DW$167, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2285                            .dwattr $C$DW$167, DW_AT_decl_line(0x55)
    2286                            .dwattr $C$DW$167, DW_AT_decl_column(0x07)
    2287                    $C$DW$168       .dwtag  DW_TAG_member
    2288                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$22)
    2289                            .dwattr $C$DW$168, DW_AT_name("last_clust")
    2290                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("last_clust")
    2291                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2292                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2293                            .dwattr $C$DW$168, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2294                            .dwattr $C$DW$168, DW_AT_decl_line(0x5d)
    2295                            .dwattr $C$DW$168, DW_AT_decl_column(0x08)
    2296                    $C$DW$169       .dwtag  DW_TAG_member
    2297                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$22)
    2298                            .dwattr $C$DW$169, DW_AT_name("free_clust")
    2299                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("free_clust")
    2300                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2301                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2302                            .dwattr $C$DW$169, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2303                            .dwattr $C$DW$169, DW_AT_decl_line(0x5e)
    2304                            .dwattr $C$DW$169, DW_AT_decl_column(0x08)
    2305                    $C$DW$170       .dwtag  DW_TAG_member
    2306                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$22)
    2307                            .dwattr $C$DW$170, DW_AT_name("fsi_sector")
    2308                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("fsi_sector")
    2309                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2310                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2311                            .dwattr $C$DW$170, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2312                            .dwattr $C$DW$170, DW_AT_decl_line(0x5f)
    2313                            .dwattr $C$DW$170, DW_AT_decl_column(0x08)
    2314                    $C$DW$171       .dwtag  DW_TAG_member
    2315                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$22)
    2316                            .dwattr $C$DW$171, DW_AT_name("n_fatent")
    2317                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("n_fatent")
    2318                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2319                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2320                            .dwattr $C$DW$171, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2321                            .dwattr $C$DW$171, DW_AT_decl_line(0x64)
    2322                            .dwattr $C$DW$171, DW_AT_decl_column(0x08)
    2323                    $C$DW$172       .dwtag  DW_TAG_member
TI ARM Assembler PC v5.2.5 Thu Oct 22 12:50:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   44

    2324                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$22)
    2325                            .dwattr $C$DW$172, DW_AT_name("fsize")
    2326                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("fsize")
    2327                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2328                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2329                            .dwattr $C$DW$172, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2330                            .dwattr $C$DW$172, DW_AT_decl_line(0x65)
    2331                            .dwattr $C$DW$172, DW_AT_decl_column(0x08)
    2332                    $C$DW$173       .dwtag  DW_TAG_member
    2333                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$22)
    2334                            .dwattr $C$DW$173, DW_AT_name("volbase")
    2335                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("volbase")
    2336                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2337                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2338                            .dwattr $C$DW$173, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2339                            .dwattr $C$DW$173, DW_AT_decl_line(0x66)
    2340                            .dwattr $C$DW$173, DW_AT_decl_column(0x08)
    2341                    $C$DW$174       .dwtag  DW_TAG_member
    2342                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$22)
    2343                            .dwattr $C$DW$174, DW_AT_name("fatbase")
    2344                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("fatbase")
    2345                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2346                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2347                            .dwattr $C$DW$174, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2348                            .dwattr $C$DW$174, DW_AT_decl_line(0x67)
    2349                            .dwattr $C$DW$174, DW_AT_decl_column(0x08)
    2350                    $C$DW$175       .dwtag  DW_TAG_member
    2351                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$22)
    2352                            .dwattr $C$DW$175, DW_AT_name("dirbase")
    2353                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("dirbase")
    2354                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2355                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2356                            .dwattr $C$DW$175, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2357                            .dwattr $C$DW$175, DW_AT_decl_line(0x68)
    2358                            .dwattr $C$DW$175, DW_AT_decl_column(0x08)
    2359                    $C$DW$176       .dwtag  DW_TAG_member
    2360                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$22)
    2361                            .dwattr $C$DW$176, DW_AT_name("database")
    2362                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("database")
    2363                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2364                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2365                            .dwattr $C$DW$176, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2366                            .dwattr $C$DW$176, DW_AT_decl_line(0x69)
    2367                            .dwattr $C$DW$176, DW_AT_decl_column(0x08)
    2368                    $C$DW$177       .dwtag  DW_TAG_member
    2369                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$22)
    2370                            .dwattr $C$DW$177, DW_AT_name("winsect")
    2371                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("winsect")
    2372                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2373                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2374                            .dwattr $C$DW$177, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2375                            .dwattr $C$DW$177, DW_AT_decl_line(0x6a)
    2376                            .dwattr $C$DW$177, DW_AT_decl_column(0x08)
    2377                    $C$DW$178       .dwtag  DW_TAG_member
    2378                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$23)
TI ARM Assembler PC v5.2.5 Thu Oct 22 12:50:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   45

    2379                            .dwattr $C$DW$178, DW_AT_name("win")
    2380                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("win")
    2381                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2382                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2383                            .dwattr $C$DW$178, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2384                            .dwattr $C$DW$178, DW_AT_decl_line(0x6b)
    2385                            .dwattr $C$DW$178, DW_AT_decl_column(0x07)
    2386                            .dwendtag $C$DW$T$24
    2387                    
    2388                            .dwattr $C$DW$T$24, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2389                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x4d)
    2390                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    2391                    $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("FATFS")
    2392                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    2393                            .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    2394                            .dwattr $C$DW$T$25, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2395                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x6c)
    2396                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x03)
    2397                    $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    2398                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    2399                            .dwattr $C$DW$T$26, DW_AT_address_class(0x20)
    2400                    
    2401                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2402                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x224)
    2403                    $C$DW$179       .dwtag  DW_TAG_member
    2404                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$26)
    2405                            .dwattr $C$DW$179, DW_AT_name("fs")
    2406                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("fs")
    2407                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2408                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2409                            .dwattr $C$DW$179, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2410                            .dwattr $C$DW$179, DW_AT_decl_line(0x73)
    2411                            .dwattr $C$DW$179, DW_AT_decl_column(0x09)
    2412                    $C$DW$180       .dwtag  DW_TAG_member
    2413                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$21)
    2414                            .dwattr $C$DW$180, DW_AT_name("id")
    2415                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("id")
    2416                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2417                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2418                            .dwattr $C$DW$180, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2419                            .dwattr $C$DW$180, DW_AT_decl_line(0x74)
    2420                            .dwattr $C$DW$180, DW_AT_decl_column(0x07)
    2421                    $C$DW$181       .dwtag  DW_TAG_member
    2422                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$20)
    2423                            .dwattr $C$DW$181, DW_AT_name("flag")
    2424                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("flag")
    2425                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2426                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2427                            .dwattr $C$DW$181, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2428                            .dwattr $C$DW$181, DW_AT_decl_line(0x75)
    2429                            .dwattr $C$DW$181, DW_AT_decl_column(0x07)
    2430                    $C$DW$182       .dwtag  DW_TAG_member
    2431                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$20)
    2432                            .dwattr $C$DW$182, DW_AT_name("pad1")
    2433                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("pad1")
TI ARM Assembler PC v5.2.5 Thu Oct 22 12:50:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   46

    2434                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2435                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2436                            .dwattr $C$DW$182, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2437                            .dwattr $C$DW$182, DW_AT_decl_line(0x76)
    2438                            .dwattr $C$DW$182, DW_AT_decl_column(0x07)
    2439                    $C$DW$183       .dwtag  DW_TAG_member
    2440                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$22)
    2441                            .dwattr $C$DW$183, DW_AT_name("fptr")
    2442                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("fptr")
    2443                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2444                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2445                            .dwattr $C$DW$183, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2446                            .dwattr $C$DW$183, DW_AT_decl_line(0x77)
    2447                            .dwattr $C$DW$183, DW_AT_decl_column(0x08)
    2448                    $C$DW$184       .dwtag  DW_TAG_member
    2449                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$22)
    2450                            .dwattr $C$DW$184, DW_AT_name("fsize")
    2451                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("fsize")
    2452                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2453                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2454                            .dwattr $C$DW$184, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2455                            .dwattr $C$DW$184, DW_AT_decl_line(0x78)
    2456                            .dwattr $C$DW$184, DW_AT_decl_column(0x08)
    2457                    $C$DW$185       .dwtag  DW_TAG_member
    2458                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$22)
    2459                            .dwattr $C$DW$185, DW_AT_name("sclust")
    2460                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("sclust")
    2461                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2462                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2463                            .dwattr $C$DW$185, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2464                            .dwattr $C$DW$185, DW_AT_decl_line(0x79)
    2465                            .dwattr $C$DW$185, DW_AT_decl_column(0x08)
    2466                    $C$DW$186       .dwtag  DW_TAG_member
    2467                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$22)
    2468                            .dwattr $C$DW$186, DW_AT_name("clust")
    2469                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("clust")
    2470                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2471                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2472                            .dwattr $C$DW$186, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2473                            .dwattr $C$DW$186, DW_AT_decl_line(0x7a)
    2474                            .dwattr $C$DW$186, DW_AT_decl_column(0x08)
    2475                    $C$DW$187       .dwtag  DW_TAG_member
    2476                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$22)
    2477                            .dwattr $C$DW$187, DW_AT_name("dsect")
    2478                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("dsect")
    2479                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2480                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2481                            .dwattr $C$DW$187, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2482                            .dwattr $C$DW$187, DW_AT_decl_line(0x7b)
    2483                            .dwattr $C$DW$187, DW_AT_decl_column(0x08)
    2484                    $C$DW$188       .dwtag  DW_TAG_member
    2485                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$22)
    2486                            .dwattr $C$DW$188, DW_AT_name("dir_sect")
    2487                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("dir_sect")
    2488                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
TI ARM Assembler PC v5.2.5 Thu Oct 22 12:50:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   47

    2489                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2490                            .dwattr $C$DW$188, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2491                            .dwattr $C$DW$188, DW_AT_decl_line(0x7d)
    2492                            .dwattr $C$DW$188, DW_AT_decl_column(0x08)
    2493                    $C$DW$189       .dwtag  DW_TAG_member
    2494                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$27)
    2495                            .dwattr $C$DW$189, DW_AT_name("dir_ptr")
    2496                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("dir_ptr")
    2497                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2498                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2499                            .dwattr $C$DW$189, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2500                            .dwattr $C$DW$189, DW_AT_decl_line(0x7e)
    2501                            .dwattr $C$DW$189, DW_AT_decl_column(0x08)
    2502                    $C$DW$190       .dwtag  DW_TAG_member
    2503                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$23)
    2504                            .dwattr $C$DW$190, DW_AT_name("buf")
    2505                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("buf")
    2506                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2507                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2508                            .dwattr $C$DW$190, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2509                            .dwattr $C$DW$190, DW_AT_decl_line(0x87)
    2510                            .dwattr $C$DW$190, DW_AT_decl_column(0x07)
    2511                            .dwendtag $C$DW$T$28
    2512                    
    2513                            .dwattr $C$DW$T$28, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2514                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x72)
    2515                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    2516                    $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("FIL")
    2517                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$28)
    2518                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    2519                            .dwattr $C$DW$T$45, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2520                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x89)
    2521                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x03)
    2522                    
    2523                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2524                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x1c)
    2525                    $C$DW$191       .dwtag  DW_TAG_member
    2526                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$26)
    2527                            .dwattr $C$DW$191, DW_AT_name("fs")
    2528                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("fs")
    2529                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2530                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2531                            .dwattr $C$DW$191, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2532                            .dwattr $C$DW$191, DW_AT_decl_line(0x90)
    2533                            .dwattr $C$DW$191, DW_AT_decl_column(0x09)
    2534                    $C$DW$192       .dwtag  DW_TAG_member
    2535                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$21)
    2536                            .dwattr $C$DW$192, DW_AT_name("id")
    2537                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("id")
    2538                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2539                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2540                            .dwattr $C$DW$192, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2541                            .dwattr $C$DW$192, DW_AT_decl_line(0x91)
    2542                            .dwattr $C$DW$192, DW_AT_decl_column(0x07)
    2543                    $C$DW$193       .dwtag  DW_TAG_member
TI ARM Assembler PC v5.2.5 Thu Oct 22 12:50:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   48

    2544                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$21)
    2545                            .dwattr $C$DW$193, DW_AT_name("index")
    2546                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("index")
    2547                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2548                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2549                            .dwattr $C$DW$193, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2550                            .dwattr $C$DW$193, DW_AT_decl_line(0x92)
    2551                            .dwattr $C$DW$193, DW_AT_decl_column(0x07)
    2552                    $C$DW$194       .dwtag  DW_TAG_member
    2553                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$22)
    2554                            .dwattr $C$DW$194, DW_AT_name("sclust")
    2555                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("sclust")
    2556                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2557                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2558                            .dwattr $C$DW$194, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2559                            .dwattr $C$DW$194, DW_AT_decl_line(0x93)
    2560                            .dwattr $C$DW$194, DW_AT_decl_column(0x08)
    2561                    $C$DW$195       .dwtag  DW_TAG_member
    2562                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$22)
    2563                            .dwattr $C$DW$195, DW_AT_name("clust")
    2564                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("clust")
    2565                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2566                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2567                            .dwattr $C$DW$195, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2568                            .dwattr $C$DW$195, DW_AT_decl_line(0x94)
    2569                            .dwattr $C$DW$195, DW_AT_decl_column(0x08)
    2570                    $C$DW$196       .dwtag  DW_TAG_member
    2571                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$22)
    2572                            .dwattr $C$DW$196, DW_AT_name("sect")
    2573                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("sect")
    2574                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2575                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2576                            .dwattr $C$DW$196, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2577                            .dwattr $C$DW$196, DW_AT_decl_line(0x95)
    2578                            .dwattr $C$DW$196, DW_AT_decl_column(0x08)
    2579                    $C$DW$197       .dwtag  DW_TAG_member
    2580                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$27)
    2581                            .dwattr $C$DW$197, DW_AT_name("dir")
    2582                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("dir")
    2583                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2584                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2585                            .dwattr $C$DW$197, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2586                            .dwattr $C$DW$197, DW_AT_decl_line(0x96)
    2587                            .dwattr $C$DW$197, DW_AT_decl_column(0x08)
    2588                    $C$DW$198       .dwtag  DW_TAG_member
    2589                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$27)
    2590                            .dwattr $C$DW$198, DW_AT_name("fn")
    2591                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("fn")
    2592                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2593                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2594                            .dwattr $C$DW$198, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2595                            .dwattr $C$DW$198, DW_AT_decl_line(0x97)
    2596                            .dwattr $C$DW$198, DW_AT_decl_column(0x08)
    2597                            .dwendtag $C$DW$T$29
    2598                    
TI ARM Assembler PC v5.2.5 Thu Oct 22 12:50:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   49

    2599                            .dwattr $C$DW$T$29, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2600                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x8f)
    2601                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    2602                    $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("DIR")
    2603                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$29)
    2604                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    2605                            .dwattr $C$DW$T$46, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2606                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x9c)
    2607                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x03)
    2608                    
    2609                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2610                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x18)
    2611                    $C$DW$199       .dwtag  DW_TAG_member
    2612                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$22)
    2613                            .dwattr $C$DW$199, DW_AT_name("fsize")
    2614                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("fsize")
    2615                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2616                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2617                            .dwattr $C$DW$199, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2618                            .dwattr $C$DW$199, DW_AT_decl_line(0xa3)
    2619                            .dwattr $C$DW$199, DW_AT_decl_column(0x08)
    2620                    $C$DW$200       .dwtag  DW_TAG_member
    2621                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$21)
    2622                            .dwattr $C$DW$200, DW_AT_name("fdate")
    2623                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("fdate")
    2624                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2625                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2626                            .dwattr $C$DW$200, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2627                            .dwattr $C$DW$200, DW_AT_decl_line(0xa4)
    2628                            .dwattr $C$DW$200, DW_AT_decl_column(0x07)
    2629                    $C$DW$201       .dwtag  DW_TAG_member
    2630                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$21)
    2631                            .dwattr $C$DW$201, DW_AT_name("ftime")
    2632                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("ftime")
    2633                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2634                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2635                            .dwattr $C$DW$201, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2636                            .dwattr $C$DW$201, DW_AT_decl_line(0xa5)
    2637                            .dwattr $C$DW$201, DW_AT_decl_column(0x07)
    2638                    $C$DW$202       .dwtag  DW_TAG_member
    2639                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$20)
    2640                            .dwattr $C$DW$202, DW_AT_name("fattrib")
    2641                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("fattrib")
    2642                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2643                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2644                            .dwattr $C$DW$202, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2645                            .dwattr $C$DW$202, DW_AT_decl_line(0xa6)
    2646                            .dwattr $C$DW$202, DW_AT_decl_column(0x07)
    2647                    $C$DW$203       .dwtag  DW_TAG_member
    2648                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$32)
    2649                            .dwattr $C$DW$203, DW_AT_name("fname")
    2650                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("fname")
    2651                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2652                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2653                            .dwattr $C$DW$203, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
TI ARM Assembler PC v5.2.5 Thu Oct 22 12:50:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   50

    2654                            .dwattr $C$DW$203, DW_AT_decl_line(0xa7)
    2655                            .dwattr $C$DW$203, DW_AT_decl_column(0x08)
    2656                            .dwendtag $C$DW$T$33
    2657                    
    2658                            .dwattr $C$DW$T$33, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2659                            .dwattr $C$DW$T$33, DW_AT_decl_line(0xa2)
    2660                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    2661                    $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("FILINFO")
    2662                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$33)
    2663                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    2664                            .dwattr $C$DW$T$47, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2665                            .dwattr $C$DW$T$47, DW_AT_decl_line(0xac)
    2666                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x03)
    2667                    
    2668                    $C$DW$T$35      .dwtag  DW_TAG_union_type
    2669                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x10)
    2670                    $C$DW$204       .dwtag  DW_TAG_member
    2671                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$34)
    2672                            .dwattr $C$DW$204, DW_AT_name("_Us")
    2673                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("_Us")
    2674                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2675                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2676                            .dwattr $C$DW$204, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2677                            .dwattr $C$DW$204, DW_AT_decl_line(0x3a)
    2678                            .dwattr $C$DW$204, DW_AT_decl_column(0x12)
    2679                    $C$DW$205       .dwtag  DW_TAG_member
    2680                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$16)
    2681                            .dwattr $C$DW$205, DW_AT_name("_Float")
    2682                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("_Float")
    2683                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2684                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2685                            .dwattr $C$DW$205, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2686                            .dwattr $C$DW$205, DW_AT_decl_line(0x3b)
    2687                            .dwattr $C$DW$205, DW_AT_decl_column(0x09)
    2688                    $C$DW$206       .dwtag  DW_TAG_member
    2689                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$17)
    2690                            .dwattr $C$DW$206, DW_AT_name("_Double")
    2691                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("_Double")
    2692                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2693                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2694                            .dwattr $C$DW$206, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2695                            .dwattr $C$DW$206, DW_AT_decl_line(0x3c)
    2696                            .dwattr $C$DW$206, DW_AT_decl_column(0x0a)
    2697                    $C$DW$207       .dwtag  DW_TAG_member
    2698                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$18)
    2699                            .dwattr $C$DW$207, DW_AT_name("_Long_double")
    2700                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("_Long_double")
    2701                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2702                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2703                            .dwattr $C$DW$207, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2704                            .dwattr $C$DW$207, DW_AT_decl_line(0x3d)
    2705                            .dwattr $C$DW$207, DW_AT_decl_column(0x0f)
    2706                            .dwendtag $C$DW$T$35
    2707                    
    2708                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float
TI ARM Assembler PC v5.2.5 Thu Oct 22 12:50:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   51

    2709                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x39)
    2710                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x03)
    2711                    
    2712                    $C$DW$T$36      .dwtag  DW_TAG_union_type
    2713                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x10)
    2714                    $C$DW$208       .dwtag  DW_TAG_member
    2715                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$34)
    2716                            .dwattr $C$DW$208, DW_AT_name("_Word")
    2717                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("_Word")
    2718                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2719                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2720                            .dwattr $C$DW$208, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath.
    2721                            .dwattr $C$DW$208, DW_AT_decl_line(0x8f)
    2722                            .dwattr $C$DW$208, DW_AT_decl_column(0x11)
    2723                    $C$DW$209       .dwtag  DW_TAG_member
    2724                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$16)
    2725                            .dwattr $C$DW$209, DW_AT_name("_Float")
    2726                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("_Float")
    2727                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2728                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2729                            .dwattr $C$DW$209, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath.
    2730                            .dwattr $C$DW$209, DW_AT_decl_line(0x90)
    2731                            .dwattr $C$DW$209, DW_AT_decl_column(0x08)
    2732                    $C$DW$210       .dwtag  DW_TAG_member
    2733                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$17)
    2734                            .dwattr $C$DW$210, DW_AT_name("_Double")
    2735                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("_Double")
    2736                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2737                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2738                            .dwattr $C$DW$210, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath.
    2739                            .dwattr $C$DW$210, DW_AT_decl_line(0x91)
    2740                            .dwattr $C$DW$210, DW_AT_decl_column(0x09)
    2741                    $C$DW$211       .dwtag  DW_TAG_member
    2742                            .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$18)
    2743                            .dwattr $C$DW$211, DW_AT_name("_Long_double")
    2744                            .dwattr $C$DW$211, DW_AT_TI_symbol_name("_Long_double")
    2745                            .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2746                            .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2747                            .dwattr $C$DW$211, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath.
    2748                            .dwattr $C$DW$211, DW_AT_decl_line(0x92)
    2749                            .dwattr $C$DW$211, DW_AT_decl_column(0x0e)
    2750                            .dwendtag $C$DW$T$36
    2751                    
    2752                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath
    2753                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x8e)
    2754                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x02)
    2755                    $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("_Dconst")
    2756                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$36)
    2757                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    2758                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath
    2759                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x93)
    2760                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x04)
    2761                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2762                            .dwattr $C$DW$T$2, DW_AT_name("void")
    2763                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
TI ARM Assembler PC v5.2.5 Thu Oct 22 12:50:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   52

    2764                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2765                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2766                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    2767                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2768                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    2769                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2770                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    2771                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2772                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2773                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2774                    $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    2775                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$5)
    2776                            .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    2777                            .dwattr $C$DW$T$67, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2778                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x2a)
    2779                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x1d)
    2780                    $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
    2781                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    2782                            .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    2783                            .dwattr $C$DW$T$68, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2784                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x37)
    2785                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x17)
    2786                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    2787                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2788                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2789                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2790                    $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("BYTE")
    2791                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$6)
    2792                            .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    2793                            .dwattr $C$DW$T$20, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2794                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x16)
    2795                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x17)
    2796                    $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("DSTATUS")
    2797                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$20)
    2798                            .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    2799                            .dwattr $C$DW$T$69, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2800                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x13)
    2801                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x0e)
    2802                    
    2803                    $C$DW$T$23      .dwtag  DW_TAG_array_type
    2804                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$20)
    2805                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    2806                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x200)
    2807                    $C$DW$212       .dwtag  DW_TAG_subrange_type
    2808                            .dwattr $C$DW$212, DW_AT_upper_bound(0x1ff)
    2809                            .dwendtag $C$DW$T$23
    2810                    
    2811                    $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    2812                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$20)
    2813                            .dwattr $C$DW$T$27, DW_AT_address_class(0x20)
    2814                    $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("UCHAR")
    2815                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$6)
    2816                            .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    2817                            .dwattr $C$DW$T$70, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2818                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x15)
TI ARM Assembler PC v5.2.5 Thu Oct 22 12:50:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   53

    2819                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x17)
    2820                    $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    2821                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$6)
    2822                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    2823                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2824                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x2b)
    2825                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x1c)
    2826                    $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
    2827                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$50)
    2828                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    2829                            .dwattr $C$DW$T$73, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2830                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x38)
    2831                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x16)
    2832                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    2833                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2834                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2835                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    2836                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    2837                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2838                            .dwattr $C$DW$T$8, DW_AT_name("short")
    2839                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    2840                    $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("SHORT")
    2841                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$8)
    2842                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    2843                            .dwattr $C$DW$T$74, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2844                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x19)
    2845                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x11)
    2846                    $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
    2847                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$8)
    2848                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2849                            .dwattr $C$DW$T$75, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2850                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x2c)
    2851                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x1d)
    2852                    $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
    2853                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    2854                            .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    2855                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2856                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x3a)
    2857                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x17)
    2858                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    2859                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2860                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2861                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    2862                    $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("USHORT")
    2863                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$9)
    2864                            .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    2865                            .dwattr $C$DW$T$77, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2866                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x1a)
    2867                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x18)
    2868                    $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("WCHAR")
    2869                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$9)
    2870                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    2871                            .dwattr $C$DW$T$78, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2872                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x1c)
    2873                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x18)
TI ARM Assembler PC v5.2.5 Thu Oct 22 12:50:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   54

    2874                    $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("WORD")
    2875                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$9)
    2876                            .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    2877                            .dwattr $C$DW$T$21, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2878                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x1b)
    2879                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x18)
    2880                    $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("_Wchart")
    2881                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$9)
    2882                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    2883                            .dwattr $C$DW$T$79, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yvals
    2884                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x1e5)
    2885                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x21)
    2886                    $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("_Wintt")
    2887                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$9)
    2888                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    2889                            .dwattr $C$DW$T$80, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yvals
    2890                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x1e6)
    2891                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x21)
    2892                    
    2893                    $C$DW$T$34      .dwtag  DW_TAG_array_type
    2894                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$9)
    2895                            .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    2896                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x10)
    2897                    $C$DW$213       .dwtag  DW_TAG_subrange_type
    2898                            .dwattr $C$DW$213, DW_AT_upper_bound(0x07)
    2899                            .dwendtag $C$DW$T$34
    2900                    
    2901                    $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    2902                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$9)
    2903                            .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    2904                            .dwattr $C$DW$T$81, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2905                            .dwattr $C$DW$T$81, DW_AT_decl_line(0x2d)
    2906                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x1c)
    2907                    $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
    2908                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    2909                            .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    2910                            .dwattr $C$DW$T$82, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2911                            .dwattr $C$DW$T$82, DW_AT_decl_line(0x3b)
    2912                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x16)
    2913                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    2914                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2915                            .dwattr $C$DW$T$10, DW_AT_name("int")
    2916                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    2917                    $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("INT")
    2918                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$10)
    2919                            .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    2920                            .dwattr $C$DW$T$83, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2921                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x10)
    2922                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x10)
    2923                    $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("_Ptrdifft")
    2924                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$10)
    2925                            .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    2926                            .dwattr $C$DW$T$84, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yvals
    2927                            .dwattr $C$DW$T$84, DW_AT_decl_line(0xa9)
    2928                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x1e)
TI ARM Assembler PC v5.2.5 Thu Oct 22 12:50:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   55

    2929                    $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
    2930                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$10)
    2931                            .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    2932                            .dwattr $C$DW$T$86, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2933                            .dwattr $C$DW$T$86, DW_AT_decl_line(0x2e)
    2934                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x1d)
    2935                    $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast16_t")
    2936                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    2937                            .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    2938                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2939                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x47)
    2940                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x17)
    2941                    $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast32_t")
    2942                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$86)
    2943                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    2944                            .dwattr $C$DW$T$88, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2945                            .dwattr $C$DW$T$88, DW_AT_decl_line(0x4a)
    2946                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x17)
    2947                    $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast8_t")
    2948                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$86)
    2949                            .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    2950                            .dwattr $C$DW$T$89, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2951                            .dwattr $C$DW$T$89, DW_AT_decl_line(0x45)
    2952                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x17)
    2953                    $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("int_least32_t")
    2954                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$86)
    2955                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    2956                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2957                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x3c)
    2958                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x17)
    2959                    $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("intptr_t")
    2960                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$10)
    2961                            .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    2962                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2963                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x52)
    2964                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x1a)
    2965                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    2966                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2967                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    2968                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    2969                    $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("UINT")
    2970                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$11)
    2971                            .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    2972                            .dwattr $C$DW$T$92, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2973                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x11)
    2974                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x16)
    2975                    $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("_Sizet")
    2976                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$11)
    2977                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    2978                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yvals
    2979                            .dwattr $C$DW$T$93, DW_AT_decl_line(0xab)
    2980                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x1a)
    2981                    $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("_TI_uint32_t")
    2982                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$11)
    2983                            .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v5.2.5 Thu Oct 22 12:50:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   56

    2984                            .dwattr $C$DW$T$94, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath
    2985                            .dwattr $C$DW$T$94, DW_AT_decl_line(0xb6)
    2986                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x19)
    2987                    $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
    2988                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$11)
    2989                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    2990                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2991                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x2f)
    2992                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x1c)
    2993                    $C$DW$T$100     .dwtag  DW_TAG_volatile_type
    2994                            .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$49)
    2995                    $C$DW$T$101     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast16_t")
    2996                            .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$49)
    2997                            .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    2998                            .dwattr $C$DW$T$101, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    2999                            .dwattr $C$DW$T$101, DW_AT_decl_line(0x48)
    3000                            .dwattr $C$DW$T$101, DW_AT_decl_column(0x16)
    3001                    $C$DW$T$102     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast32_t")
    3002                            .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$49)
    3003                            .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    3004                            .dwattr $C$DW$T$102, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3005                            .dwattr $C$DW$T$102, DW_AT_decl_line(0x4b)
    3006                            .dwattr $C$DW$T$102, DW_AT_decl_column(0x16)
    3007                    $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast8_t")
    3008                            .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$49)
    3009                            .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    3010                            .dwattr $C$DW$T$103, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3011                            .dwattr $C$DW$T$103, DW_AT_decl_line(0x46)
    3012                            .dwattr $C$DW$T$103, DW_AT_decl_column(0x16)
    3013                    $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least32_t")
    3014                            .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$49)
    3015                            .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    3016                            .dwattr $C$DW$T$104, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3017                            .dwattr $C$DW$T$104, DW_AT_decl_line(0x3d)
    3018                            .dwattr $C$DW$T$104, DW_AT_decl_column(0x16)
    3019                    $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("uintptr_t")
    3020                            .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$11)
    3021                            .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    3022                            .dwattr $C$DW$T$105, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3023                            .dwattr $C$DW$T$105, DW_AT_decl_line(0x53)
    3024                            .dwattr $C$DW$T$105, DW_AT_decl_column(0x1a)
    3025                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    3026                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    3027                            .dwattr $C$DW$T$12, DW_AT_name("long")
    3028                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    3029                    $C$DW$T$106     .dwtag  DW_TAG_typedef, DW_AT_name("LONG")
    3030                            .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$12)
    3031                            .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    3032                            .dwattr $C$DW$T$106, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    3033                            .dwattr $C$DW$T$106, DW_AT_decl_line(0x1f)
    3034                            .dwattr $C$DW$T$106, DW_AT_decl_column(0x10)
    3035                    $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("_Int32t")
    3036                            .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$12)
    3037                            .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    3038                            .dwattr $C$DW$T$107, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yval
TI ARM Assembler PC v5.2.5 Thu Oct 22 12:50:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   57

    3039                            .dwattr $C$DW$T$107, DW_AT_decl_line(0xa6)
    3040                            .dwattr $C$DW$T$107, DW_AT_decl_column(0x0e)
    3041                    $C$DW$T$13      .dwtag  DW_TAG_base_type
    3042                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    3043                            .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    3044                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
    3045                    $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("DWORD")
    3046                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$13)
    3047                            .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    3048                            .dwattr $C$DW$T$22, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    3049                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x21)
    3050                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x17)
    3051                    $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("ULONG")
    3052                            .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$13)
    3053                            .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
    3054                            .dwattr $C$DW$T$108, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    3055                            .dwattr $C$DW$T$108, DW_AT_decl_line(0x20)
    3056                            .dwattr $C$DW$T$108, DW_AT_decl_column(0x17)
    3057                    $C$DW$T$109     .dwtag  DW_TAG_typedef, DW_AT_name("_Uint32t")
    3058                            .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$13)
    3059                            .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    3060                            .dwattr $C$DW$T$109, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yval
    3061                            .dwattr $C$DW$T$109, DW_AT_decl_line(0xa7)
    3062                            .dwattr $C$DW$T$109, DW_AT_decl_column(0x17)
    3063                    $C$DW$T$14      .dwtag  DW_TAG_base_type
    3064                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    3065                            .dwattr $C$DW$T$14, DW_AT_name("long long")
    3066                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    3067                    $C$DW$T$110     .dwtag  DW_TAG_typedef, DW_AT_name("_Longlong")
    3068                            .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$14)
    3069                            .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    3070                            .dwattr $C$DW$T$110, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yval
    3071                            .dwattr $C$DW$T$110, DW_AT_decl_line(0x1b5)
    3072                            .dwattr $C$DW$T$110, DW_AT_decl_column(0x13)
    3073                    $C$DW$T$111     .dwtag  DW_TAG_typedef, DW_AT_name("int64_t")
    3074                            .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$14)
    3075                            .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
    3076                            .dwattr $C$DW$T$111, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3077                            .dwattr $C$DW$T$111, DW_AT_decl_line(0x32)
    3078                            .dwattr $C$DW$T$111, DW_AT_decl_column(0x21)
    3079                    $C$DW$T$112     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast64_t")
    3080                            .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$111)
    3081                            .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    3082                            .dwattr $C$DW$T$112, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3083                            .dwattr $C$DW$T$112, DW_AT_decl_line(0x4e)
    3084                            .dwattr $C$DW$T$112, DW_AT_decl_column(0x17)
    3085                    $C$DW$T$113     .dwtag  DW_TAG_typedef, DW_AT_name("int_least64_t")
    3086                            .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$111)
    3087                            .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    3088                            .dwattr $C$DW$T$113, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3089                            .dwattr $C$DW$T$113, DW_AT_decl_line(0x40)
    3090                            .dwattr $C$DW$T$113, DW_AT_decl_column(0x17)
    3091                    $C$DW$T$114     .dwtag  DW_TAG_typedef, DW_AT_name("intmax_t")
    3092                            .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$14)
    3093                            .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v5.2.5 Thu Oct 22 12:50:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   58

    3094                            .dwattr $C$DW$T$114, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3095                            .dwattr $C$DW$T$114, DW_AT_decl_line(0x56)
    3096                            .dwattr $C$DW$T$114, DW_AT_decl_column(0x20)
    3097                    $C$DW$T$15      .dwtag  DW_TAG_base_type
    3098                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    3099                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    3100                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    3101                    $C$DW$T$115     .dwtag  DW_TAG_typedef, DW_AT_name("_TI_uint64_t")
    3102                            .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$15)
    3103                            .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
    3104                            .dwattr $C$DW$T$115, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymat
    3105                            .dwattr $C$DW$T$115, DW_AT_decl_line(0xbc)
    3106                            .dwattr $C$DW$T$115, DW_AT_decl_column(0x1c)
    3107                    $C$DW$T$116     .dwtag  DW_TAG_typedef, DW_AT_name("_ULonglong")
    3108                            .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$15)
    3109                            .dwattr $C$DW$T$116, DW_AT_language(DW_LANG_C)
    3110                            .dwattr $C$DW$T$116, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yval
    3111                            .dwattr $C$DW$T$116, DW_AT_decl_line(0x1b6)
    3112                            .dwattr $C$DW$T$116, DW_AT_decl_column(0x14)
    3113                    $C$DW$T$117     .dwtag  DW_TAG_typedef, DW_AT_name("uint64_t")
    3114                            .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$15)
    3115                            .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
    3116                            .dwattr $C$DW$T$117, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3117                            .dwattr $C$DW$T$117, DW_AT_decl_line(0x33)
    3118                            .dwattr $C$DW$T$117, DW_AT_decl_column(0x20)
    3119                    $C$DW$T$118     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast64_t")
    3120                            .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$117)
    3121                            .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
    3122                            .dwattr $C$DW$T$118, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3123                            .dwattr $C$DW$T$118, DW_AT_decl_line(0x4f)
    3124                            .dwattr $C$DW$T$118, DW_AT_decl_column(0x16)
    3125                    $C$DW$T$119     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least64_t")
    3126                            .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$117)
    3127                            .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    3128                            .dwattr $C$DW$T$119, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3129                            .dwattr $C$DW$T$119, DW_AT_decl_line(0x41)
    3130                            .dwattr $C$DW$T$119, DW_AT_decl_column(0x16)
    3131                    $C$DW$T$120     .dwtag  DW_TAG_typedef, DW_AT_name("uintmax_t")
    3132                            .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$15)
    3133                            .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    3134                            .dwattr $C$DW$T$120, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3135                            .dwattr $C$DW$T$120, DW_AT_decl_line(0x57)
    3136                            .dwattr $C$DW$T$120, DW_AT_decl_column(0x20)
    3137                    $C$DW$T$16      .dwtag  DW_TAG_base_type
    3138                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    3139                            .dwattr $C$DW$T$16, DW_AT_name("float")
    3140                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    3141                    $C$DW$T$123     .dwtag  DW_TAG_typedef, DW_AT_name("float_t")
    3142                            .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$16)
