TI ARM Assembler PC v5.2.5 Sat Nov 07 12:29:27 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                             PC v5.2.5 *
       3                    ;* Date/Time created: Sat Nov 07 12:29:27 2015                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --disab
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../timers.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.2.5 Copyright (c) 1996-2015 Te
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("E:\Dev\Ti\Code\GIT\LaunchpadRoomControl\LaunchpadRoomControl
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("GPIOPinWrite")

    2079                    $C$DW$145       .dwtag  DW_TAG_enumerator, DW_AT_name("FR_NOT_ENOUGH_CORE"), DW_AT_const_value(0x11)
    2080                            .dwattr $C$DW$145, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2081                            .dwattr $C$DW$145, DW_AT_decl_line(0xc4)
    2082                            .dwattr $C$DW$145, DW_AT_decl_column(0x02)
    2083                    $C$DW$146       .dwtag  DW_TAG_enumerator, DW_AT_name("FR_TOO_MANY_OPEN_FILES"), DW_AT_const_value(0x1
    2084                            .dwattr $C$DW$146, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2085                            .dwattr $C$DW$146, DW_AT_decl_line(0xc5)
    2086                            .dwattr $C$DW$146, DW_AT_decl_column(0x02)
    2087                    $C$DW$147       .dwtag  DW_TAG_enumerator, DW_AT_name("FR_INVALID_PARAMETER"), DW_AT_const_value(0x13)
    2088                            .dwattr $C$DW$147, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2089                            .dwattr $C$DW$147, DW_AT_decl_line(0xc6)
    2090                            .dwattr $C$DW$147, DW_AT_decl_column(0x02)
    2091                            .dwendtag $C$DW$T$40
    2092                    
    2093                            .dwattr $C$DW$T$40, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2094                            .dwattr $C$DW$T$40, DW_AT_decl_line(0xb2)
    2095                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x0e)
    2096                    $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("FRESULT")
    2097                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    2098                            .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    2099                            .dwattr $C$DW$T$41, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2100                            .dwattr $C$DW$T$41, DW_AT_decl_line(0xc7)
    2101                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x03)
    2102                    
    2103                    $C$DW$T$42      .dwtag  DW_TAG_enumeration_type
TI ARM Assembler PC v5.2.5 Sat Nov 07 12:29:27 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   40

    2104                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    2105                    $C$DW$148       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_OK"), DW_AT_const_value(0x00)
    2106                            .dwattr $C$DW$148, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2107                            .dwattr $C$DW$148, DW_AT_decl_line(0x17)
    2108                            .dwattr $C$DW$148, DW_AT_decl_column(0x02)
    2109                    $C$DW$149       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_ERROR"), DW_AT_const_value(0x01)
    2110                            .dwattr $C$DW$149, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2111                            .dwattr $C$DW$149, DW_AT_decl_line(0x18)
    2112                            .dwattr $C$DW$149, DW_AT_decl_column(0x02)
    2113                    $C$DW$150       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_WRPRT"), DW_AT_const_value(0x02)
    2114                            .dwattr $C$DW$150, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2115                            .dwattr $C$DW$150, DW_AT_decl_line(0x19)
    2116                            .dwattr $C$DW$150, DW_AT_decl_column(0x02)
    2117                    $C$DW$151       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_NOTRDY"), DW_AT_const_value(0x03)
    2118                            .dwattr $C$DW$151, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2119                            .dwattr $C$DW$151, DW_AT_decl_line(0x1a)
    2120                            .dwattr $C$DW$151, DW_AT_decl_column(0x02)
    2121                    $C$DW$152       .dwtag  DW_TAG_enumerator, DW_AT_name("RES_PARERR"), DW_AT_const_value(0x04)
    2122                            .dwattr $C$DW$152, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2123                            .dwattr $C$DW$152, DW_AT_decl_line(0x1b)
    2124                            .dwattr $C$DW$152, DW_AT_decl_column(0x02)
    2125                            .dwendtag $C$DW$T$42
    2126                    
    2127                            .dwattr $C$DW$T$42, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2128                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x16)
    2129                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x0e)
    2130                    $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("DRESULT")
    2131                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    2132                            .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    2133                            .dwattr $C$DW$T$43, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
    2134                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x1c)
    2135                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x03)
    2136                    
    2137                    $C$DW$T$19      .dwtag  DW_TAG_structure_type
    2138                            .dwattr $C$DW$T$19, DW_AT_byte_size(0x48)
    2139                    $C$DW$153       .dwtag  DW_TAG_member
    2140                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$10)
    2141                            .dwattr $C$DW$153, DW_AT_name("_Ddig")
    2142                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("_Ddig")
    2143                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2144                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2145                            .dwattr $C$DW$153, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2146                            .dwattr $C$DW$153, DW_AT_decl_line(0x37)
    2147                            .dwattr $C$DW$153, DW_AT_decl_column(0x06)
    2148                    $C$DW$154       .dwtag  DW_TAG_member
    2149                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$10)
    2150                            .dwattr $C$DW$154, DW_AT_name("_Dmdig")
    2151                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("_Dmdig")
    2152                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2153                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2154                            .dwattr $C$DW$154, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2155                            .dwattr $C$DW$154, DW_AT_decl_line(0x37)
    2156                            .dwattr $C$DW$154, DW_AT_decl_column(0x0d)
    2157                    $C$DW$155       .dwtag  DW_TAG_member
    2158                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$10)
TI ARM Assembler PC v5.2.5 Sat Nov 07 12:29:27 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   41

    2159                            .dwattr $C$DW$155, DW_AT_name("_Dmax10e")
    2160                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("_Dmax10e")
    2161                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2162                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2163                            .dwattr $C$DW$155, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2164                            .dwattr $C$DW$155, DW_AT_decl_line(0x37)
    2165                            .dwattr $C$DW$155, DW_AT_decl_column(0x15)
    2166                    $C$DW$156       .dwtag  DW_TAG_member
    2167                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$10)
    2168                            .dwattr $C$DW$156, DW_AT_name("_Dmaxe")
    2169                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("_Dmaxe")
    2170                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2171                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2172                            .dwattr $C$DW$156, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2173                            .dwattr $C$DW$156, DW_AT_decl_line(0x37)
    2174                            .dwattr $C$DW$156, DW_AT_decl_column(0x1f)
    2175                    $C$DW$157       .dwtag  DW_TAG_member
    2176                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$10)
    2177                            .dwattr $C$DW$157, DW_AT_name("_Dmin10e")
    2178                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("_Dmin10e")
    2179                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2180                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2181                            .dwattr $C$DW$157, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2182                            .dwattr $C$DW$157, DW_AT_decl_line(0x37)
    2183                            .dwattr $C$DW$157, DW_AT_decl_column(0x27)
    2184                    $C$DW$158       .dwtag  DW_TAG_member
    2185                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$10)
    2186                            .dwattr $C$DW$158, DW_AT_name("_Dmine")
    2187                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("_Dmine")
    2188                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2189                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2190                            .dwattr $C$DW$158, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2191                            .dwattr $C$DW$158, DW_AT_decl_line(0x37)
    2192                            .dwattr $C$DW$158, DW_AT_decl_column(0x31)
    2193                    $C$DW$159       .dwtag  DW_TAG_member
    2194                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$35)
    2195                            .dwattr $C$DW$159, DW_AT_name("_Deps")
    2196                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("_Deps")
    2197                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2198                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2199                            .dwattr $C$DW$159, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2200                            .dwattr $C$DW$159, DW_AT_decl_line(0x3e)
    2201                            .dwattr $C$DW$159, DW_AT_decl_column(0x05)
    2202                    $C$DW$160       .dwtag  DW_TAG_member
    2203                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$35)
    2204                            .dwattr $C$DW$160, DW_AT_name("_Dmax")
    2205                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("_Dmax")
    2206                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2207                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2208                            .dwattr $C$DW$160, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2209                            .dwattr $C$DW$160, DW_AT_decl_line(0x3e)
    2210                            .dwattr $C$DW$160, DW_AT_decl_column(0x0c)
    2211                    $C$DW$161       .dwtag  DW_TAG_member
    2212                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$35)
    2213                            .dwattr $C$DW$161, DW_AT_name("_Dmin")
TI ARM Assembler PC v5.2.5 Sat Nov 07 12:29:27 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   42

    2214                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("_Dmin")
    2215                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2216                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2217                            .dwattr $C$DW$161, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2218                            .dwattr $C$DW$161, DW_AT_decl_line(0x3e)
    2219                            .dwattr $C$DW$161, DW_AT_decl_column(0x13)
    2220                            .dwendtag $C$DW$T$19
    2221                    
    2222                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float
    2223                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x36)
    2224                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x02)
    2225                    $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("_Dvals")
    2226                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$19)
    2227                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    2228                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float
    2229                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x3f)
    2230                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x04)
    2231                    
    2232                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2233                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x234)
    2234                    $C$DW$162       .dwtag  DW_TAG_member
    2235                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    2236                            .dwattr $C$DW$162, DW_AT_name("fs_type")
    2237                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("fs_type")
    2238                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2239                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2240                            .dwattr $C$DW$162, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2241                            .dwattr $C$DW$162, DW_AT_decl_line(0x4e)
    2242                            .dwattr $C$DW$162, DW_AT_decl_column(0x07)
    2243                    $C$DW$163       .dwtag  DW_TAG_member
    2244                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$20)
    2245                            .dwattr $C$DW$163, DW_AT_name("drv")
    2246                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("drv")
    2247                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2248                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2249                            .dwattr $C$DW$163, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2250                            .dwattr $C$DW$163, DW_AT_decl_line(0x4f)
    2251                            .dwattr $C$DW$163, DW_AT_decl_column(0x07)
    2252                    $C$DW$164       .dwtag  DW_TAG_member
    2253                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$20)
    2254                            .dwattr $C$DW$164, DW_AT_name("csize")
    2255                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("csize")
    2256                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2257                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2258                            .dwattr $C$DW$164, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2259                            .dwattr $C$DW$164, DW_AT_decl_line(0x50)
    2260                            .dwattr $C$DW$164, DW_AT_decl_column(0x07)
    2261                    $C$DW$165       .dwtag  DW_TAG_member
    2262                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$20)
    2263                            .dwattr $C$DW$165, DW_AT_name("n_fats")
    2264                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("n_fats")
    2265                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2266                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2267                            .dwattr $C$DW$165, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2268                            .dwattr $C$DW$165, DW_AT_decl_line(0x51)
TI ARM Assembler PC v5.2.5 Sat Nov 07 12:29:27 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   43

    2269                            .dwattr $C$DW$165, DW_AT_decl_column(0x07)
    2270                    $C$DW$166       .dwtag  DW_TAG_member
    2271                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$20)
    2272                            .dwattr $C$DW$166, DW_AT_name("wflag")
    2273                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("wflag")
    2274                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2275                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2276                            .dwattr $C$DW$166, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2277                            .dwattr $C$DW$166, DW_AT_decl_line(0x52)
    2278                            .dwattr $C$DW$166, DW_AT_decl_column(0x07)
    2279                    $C$DW$167       .dwtag  DW_TAG_member
    2280                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$20)
    2281                            .dwattr $C$DW$167, DW_AT_name("fsi_flag")
    2282                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("fsi_flag")
    2283                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2284                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2285                            .dwattr $C$DW$167, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2286                            .dwattr $C$DW$167, DW_AT_decl_line(0x53)
    2287                            .dwattr $C$DW$167, DW_AT_decl_column(0x07)
    2288                    $C$DW$168       .dwtag  DW_TAG_member
    2289                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$21)
    2290                            .dwattr $C$DW$168, DW_AT_name("id")
    2291                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("id")
    2292                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2293                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2294                            .dwattr $C$DW$168, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2295                            .dwattr $C$DW$168, DW_AT_decl_line(0x54)
    2296                            .dwattr $C$DW$168, DW_AT_decl_column(0x07)
    2297                    $C$DW$169       .dwtag  DW_TAG_member
    2298                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$21)
    2299                            .dwattr $C$DW$169, DW_AT_name("n_rootdir")
    2300                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("n_rootdir")
    2301                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2302                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2303                            .dwattr $C$DW$169, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2304                            .dwattr $C$DW$169, DW_AT_decl_line(0x55)
    2305                            .dwattr $C$DW$169, DW_AT_decl_column(0x07)
    2306                    $C$DW$170       .dwtag  DW_TAG_member
    2307                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$22)
    2308                            .dwattr $C$DW$170, DW_AT_name("last_clust")
    2309                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("last_clust")
    2310                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2311                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2312                            .dwattr $C$DW$170, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2313                            .dwattr $C$DW$170, DW_AT_decl_line(0x5d)
    2314                            .dwattr $C$DW$170, DW_AT_decl_column(0x08)
    2315                    $C$DW$171       .dwtag  DW_TAG_member
    2316                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$22)
    2317                            .dwattr $C$DW$171, DW_AT_name("free_clust")
    2318                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("free_clust")
    2319                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2320                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2321                            .dwattr $C$DW$171, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2322                            .dwattr $C$DW$171, DW_AT_decl_line(0x5e)
    2323                            .dwattr $C$DW$171, DW_AT_decl_column(0x08)
TI ARM Assembler PC v5.2.5 Sat Nov 07 12:29:27 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   44

    2324                    $C$DW$172       .dwtag  DW_TAG_member
    2325                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$22)
    2326                            .dwattr $C$DW$172, DW_AT_name("fsi_sector")
    2327                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("fsi_sector")
    2328                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2329                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2330                            .dwattr $C$DW$172, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2331                            .dwattr $C$DW$172, DW_AT_decl_line(0x5f)
    2332                            .dwattr $C$DW$172, DW_AT_decl_column(0x08)
    2333                    $C$DW$173       .dwtag  DW_TAG_member
    2334                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$22)
    2335                            .dwattr $C$DW$173, DW_AT_name("n_fatent")
    2336                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("n_fatent")
    2337                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2338                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2339                            .dwattr $C$DW$173, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2340                            .dwattr $C$DW$173, DW_AT_decl_line(0x64)
    2341                            .dwattr $C$DW$173, DW_AT_decl_column(0x08)
    2342                    $C$DW$174       .dwtag  DW_TAG_member
    2343                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$22)
    2344                            .dwattr $C$DW$174, DW_AT_name("fsize")
    2345                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("fsize")
    2346                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2347                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2348                            .dwattr $C$DW$174, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2349                            .dwattr $C$DW$174, DW_AT_decl_line(0x65)
    2350                            .dwattr $C$DW$174, DW_AT_decl_column(0x08)
    2351                    $C$DW$175       .dwtag  DW_TAG_member
    2352                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$22)
    2353                            .dwattr $C$DW$175, DW_AT_name("volbase")
    2354                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("volbase")
    2355                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2356                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2357                            .dwattr $C$DW$175, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2358                            .dwattr $C$DW$175, DW_AT_decl_line(0x66)
    2359                            .dwattr $C$DW$175, DW_AT_decl_column(0x08)
    2360                    $C$DW$176       .dwtag  DW_TAG_member
    2361                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$22)
    2362                            .dwattr $C$DW$176, DW_AT_name("fatbase")
    2363                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("fatbase")
    2364                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2365                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2366                            .dwattr $C$DW$176, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2367                            .dwattr $C$DW$176, DW_AT_decl_line(0x67)
    2368                            .dwattr $C$DW$176, DW_AT_decl_column(0x08)
    2369                    $C$DW$177       .dwtag  DW_TAG_member
    2370                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$22)
    2371                            .dwattr $C$DW$177, DW_AT_name("dirbase")
    2372                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("dirbase")
    2373                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2374                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2375                            .dwattr $C$DW$177, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2376                            .dwattr $C$DW$177, DW_AT_decl_line(0x68)
    2377                            .dwattr $C$DW$177, DW_AT_decl_column(0x08)
    2378                    $C$DW$178       .dwtag  DW_TAG_member
TI ARM Assembler PC v5.2.5 Sat Nov 07 12:29:27 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   45

    2379                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$22)
    2380                            .dwattr $C$DW$178, DW_AT_name("database")
    2381                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("database")
    2382                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2383                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2384                            .dwattr $C$DW$178, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2385                            .dwattr $C$DW$178, DW_AT_decl_line(0x69)
    2386                            .dwattr $C$DW$178, DW_AT_decl_column(0x08)
    2387                    $C$DW$179       .dwtag  DW_TAG_member
    2388                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$22)
    2389                            .dwattr $C$DW$179, DW_AT_name("winsect")
    2390                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("winsect")
    2391                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2392                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2393                            .dwattr $C$DW$179, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2394                            .dwattr $C$DW$179, DW_AT_decl_line(0x6a)
    2395                            .dwattr $C$DW$179, DW_AT_decl_column(0x08)
    2396                    $C$DW$180       .dwtag  DW_TAG_member
    2397                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$23)
    2398                            .dwattr $C$DW$180, DW_AT_name("win")
    2399                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("win")
    2400                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2401                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2402                            .dwattr $C$DW$180, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2403                            .dwattr $C$DW$180, DW_AT_decl_line(0x6b)
    2404                            .dwattr $C$DW$180, DW_AT_decl_column(0x07)
    2405                            .dwendtag $C$DW$T$24
    2406                    
    2407                            .dwattr $C$DW$T$24, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2408                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x4d)
    2409                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    2410                    $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("FATFS")
    2411                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    2412                            .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    2413                            .dwattr $C$DW$T$25, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2414                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x6c)
    2415                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x03)
    2416                    $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    2417                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    2418                            .dwattr $C$DW$T$26, DW_AT_address_class(0x20)
    2419                    
    2420                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2421                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x224)
    2422                    $C$DW$181       .dwtag  DW_TAG_member
    2423                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$26)
    2424                            .dwattr $C$DW$181, DW_AT_name("fs")
    2425                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("fs")
    2426                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2427                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2428                            .dwattr $C$DW$181, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2429                            .dwattr $C$DW$181, DW_AT_decl_line(0x73)
    2430                            .dwattr $C$DW$181, DW_AT_decl_column(0x09)
    2431                    $C$DW$182       .dwtag  DW_TAG_member
    2432                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$21)
    2433                            .dwattr $C$DW$182, DW_AT_name("id")
TI ARM Assembler PC v5.2.5 Sat Nov 07 12:29:27 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   46

    2434                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("id")
    2435                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2436                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2437                            .dwattr $C$DW$182, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2438                            .dwattr $C$DW$182, DW_AT_decl_line(0x74)
    2439                            .dwattr $C$DW$182, DW_AT_decl_column(0x07)
    2440                    $C$DW$183       .dwtag  DW_TAG_member
    2441                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$20)
    2442                            .dwattr $C$DW$183, DW_AT_name("flag")
    2443                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("flag")
    2444                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2445                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2446                            .dwattr $C$DW$183, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2447                            .dwattr $C$DW$183, DW_AT_decl_line(0x75)
    2448                            .dwattr $C$DW$183, DW_AT_decl_column(0x07)
    2449                    $C$DW$184       .dwtag  DW_TAG_member
    2450                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$20)
    2451                            .dwattr $C$DW$184, DW_AT_name("pad1")
    2452                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("pad1")
    2453                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2454                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2455                            .dwattr $C$DW$184, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2456                            .dwattr $C$DW$184, DW_AT_decl_line(0x76)
    2457                            .dwattr $C$DW$184, DW_AT_decl_column(0x07)
    2458                    $C$DW$185       .dwtag  DW_TAG_member
    2459                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$22)
    2460                            .dwattr $C$DW$185, DW_AT_name("fptr")
    2461                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("fptr")
    2462                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2463                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2464                            .dwattr $C$DW$185, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2465                            .dwattr $C$DW$185, DW_AT_decl_line(0x77)
    2466                            .dwattr $C$DW$185, DW_AT_decl_column(0x08)
    2467                    $C$DW$186       .dwtag  DW_TAG_member
    2468                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$22)
    2469                            .dwattr $C$DW$186, DW_AT_name("fsize")
    2470                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("fsize")
    2471                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2472                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2473                            .dwattr $C$DW$186, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2474                            .dwattr $C$DW$186, DW_AT_decl_line(0x78)
    2475                            .dwattr $C$DW$186, DW_AT_decl_column(0x08)
    2476                    $C$DW$187       .dwtag  DW_TAG_member
    2477                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$22)
    2478                            .dwattr $C$DW$187, DW_AT_name("sclust")
    2479                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("sclust")
    2480                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2481                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2482                            .dwattr $C$DW$187, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2483                            .dwattr $C$DW$187, DW_AT_decl_line(0x79)
    2484                            .dwattr $C$DW$187, DW_AT_decl_column(0x08)
    2485                    $C$DW$188       .dwtag  DW_TAG_member
    2486                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$22)
    2487                            .dwattr $C$DW$188, DW_AT_name("clust")
    2488                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("clust")
TI ARM Assembler PC v5.2.5 Sat Nov 07 12:29:27 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   47

    2489                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2490                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2491                            .dwattr $C$DW$188, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2492                            .dwattr $C$DW$188, DW_AT_decl_line(0x7a)
    2493                            .dwattr $C$DW$188, DW_AT_decl_column(0x08)
    2494                    $C$DW$189       .dwtag  DW_TAG_member
    2495                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$22)
    2496                            .dwattr $C$DW$189, DW_AT_name("dsect")
    2497                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("dsect")
    2498                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2499                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2500                            .dwattr $C$DW$189, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2501                            .dwattr $C$DW$189, DW_AT_decl_line(0x7b)
    2502                            .dwattr $C$DW$189, DW_AT_decl_column(0x08)
    2503                    $C$DW$190       .dwtag  DW_TAG_member
    2504                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$22)
    2505                            .dwattr $C$DW$190, DW_AT_name("dir_sect")
    2506                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("dir_sect")
    2507                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2508                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2509                            .dwattr $C$DW$190, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2510                            .dwattr $C$DW$190, DW_AT_decl_line(0x7d)
    2511                            .dwattr $C$DW$190, DW_AT_decl_column(0x08)
    2512                    $C$DW$191       .dwtag  DW_TAG_member
    2513                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$27)
    2514                            .dwattr $C$DW$191, DW_AT_name("dir_ptr")
    2515                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("dir_ptr")
    2516                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2517                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2518                            .dwattr $C$DW$191, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2519                            .dwattr $C$DW$191, DW_AT_decl_line(0x7e)
    2520                            .dwattr $C$DW$191, DW_AT_decl_column(0x08)
    2521                    $C$DW$192       .dwtag  DW_TAG_member
    2522                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$23)
    2523                            .dwattr $C$DW$192, DW_AT_name("buf")
    2524                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("buf")
    2525                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2526                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2527                            .dwattr $C$DW$192, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2528                            .dwattr $C$DW$192, DW_AT_decl_line(0x87)
    2529                            .dwattr $C$DW$192, DW_AT_decl_column(0x07)
    2530                            .dwendtag $C$DW$T$28
    2531                    
    2532                            .dwattr $C$DW$T$28, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2533                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x72)
    2534                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    2535                    $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("FIL")
    2536                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$28)
    2537                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    2538                            .dwattr $C$DW$T$45, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2539                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x89)
    2540                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x03)
    2541                    
    2542                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2543                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x1c)
TI ARM Assembler PC v5.2.5 Sat Nov 07 12:29:27 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   48

    2544                    $C$DW$193       .dwtag  DW_TAG_member
    2545                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$26)
    2546                            .dwattr $C$DW$193, DW_AT_name("fs")
    2547                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("fs")
    2548                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2549                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2550                            .dwattr $C$DW$193, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2551                            .dwattr $C$DW$193, DW_AT_decl_line(0x90)
    2552                            .dwattr $C$DW$193, DW_AT_decl_column(0x09)
    2553                    $C$DW$194       .dwtag  DW_TAG_member
    2554                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$21)
    2555                            .dwattr $C$DW$194, DW_AT_name("id")
    2556                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("id")
    2557                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2558                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2559                            .dwattr $C$DW$194, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2560                            .dwattr $C$DW$194, DW_AT_decl_line(0x91)
    2561                            .dwattr $C$DW$194, DW_AT_decl_column(0x07)
    2562                    $C$DW$195       .dwtag  DW_TAG_member
    2563                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$21)
    2564                            .dwattr $C$DW$195, DW_AT_name("index")
    2565                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("index")
    2566                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2567                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2568                            .dwattr $C$DW$195, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2569                            .dwattr $C$DW$195, DW_AT_decl_line(0x92)
    2570                            .dwattr $C$DW$195, DW_AT_decl_column(0x07)
    2571                    $C$DW$196       .dwtag  DW_TAG_member
    2572                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$22)
    2573                            .dwattr $C$DW$196, DW_AT_name("sclust")
    2574                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("sclust")
    2575                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2576                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2577                            .dwattr $C$DW$196, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2578                            .dwattr $C$DW$196, DW_AT_decl_line(0x93)
    2579                            .dwattr $C$DW$196, DW_AT_decl_column(0x08)
    2580                    $C$DW$197       .dwtag  DW_TAG_member
    2581                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$22)
    2582                            .dwattr $C$DW$197, DW_AT_name("clust")
    2583                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("clust")
    2584                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2585                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2586                            .dwattr $C$DW$197, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2587                            .dwattr $C$DW$197, DW_AT_decl_line(0x94)
    2588                            .dwattr $C$DW$197, DW_AT_decl_column(0x08)
    2589                    $C$DW$198       .dwtag  DW_TAG_member
    2590                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$22)
    2591                            .dwattr $C$DW$198, DW_AT_name("sect")
    2592                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("sect")
    2593                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2594                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2595                            .dwattr $C$DW$198, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2596                            .dwattr $C$DW$198, DW_AT_decl_line(0x95)
    2597                            .dwattr $C$DW$198, DW_AT_decl_column(0x08)
    2598                    $C$DW$199       .dwtag  DW_TAG_member
TI ARM Assembler PC v5.2.5 Sat Nov 07 12:29:27 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   49

    2599                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$27)
    2600                            .dwattr $C$DW$199, DW_AT_name("dir")
    2601                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("dir")
    2602                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2603                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2604                            .dwattr $C$DW$199, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2605                            .dwattr $C$DW$199, DW_AT_decl_line(0x96)
    2606                            .dwattr $C$DW$199, DW_AT_decl_column(0x08)
    2607                    $C$DW$200       .dwtag  DW_TAG_member
    2608                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$27)
    2609                            .dwattr $C$DW$200, DW_AT_name("fn")
    2610                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("fn")
    2611                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2612                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2613                            .dwattr $C$DW$200, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2614                            .dwattr $C$DW$200, DW_AT_decl_line(0x97)
    2615                            .dwattr $C$DW$200, DW_AT_decl_column(0x08)
    2616                            .dwendtag $C$DW$T$29
    2617                    
    2618                            .dwattr $C$DW$T$29, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2619                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x8f)
    2620                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    2621                    $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("DIR")
    2622                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$29)
    2623                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    2624                            .dwattr $C$DW$T$46, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2625                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x9c)
    2626                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x03)
    2627                    
    2628                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2629                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x18)
    2630                    $C$DW$201       .dwtag  DW_TAG_member
    2631                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$22)
    2632                            .dwattr $C$DW$201, DW_AT_name("fsize")
    2633                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("fsize")
    2634                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2635                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2636                            .dwattr $C$DW$201, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2637                            .dwattr $C$DW$201, DW_AT_decl_line(0xa3)
    2638                            .dwattr $C$DW$201, DW_AT_decl_column(0x08)
    2639                    $C$DW$202       .dwtag  DW_TAG_member
    2640                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$21)
    2641                            .dwattr $C$DW$202, DW_AT_name("fdate")
    2642                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("fdate")
    2643                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2644                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2645                            .dwattr $C$DW$202, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2646                            .dwattr $C$DW$202, DW_AT_decl_line(0xa4)
    2647                            .dwattr $C$DW$202, DW_AT_decl_column(0x07)
    2648                    $C$DW$203       .dwtag  DW_TAG_member
    2649                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$21)
    2650                            .dwattr $C$DW$203, DW_AT_name("ftime")
    2651                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("ftime")
    2652                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2653                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v5.2.5 Sat Nov 07 12:29:27 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   50

    2654                            .dwattr $C$DW$203, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2655                            .dwattr $C$DW$203, DW_AT_decl_line(0xa5)
    2656                            .dwattr $C$DW$203, DW_AT_decl_column(0x07)
    2657                    $C$DW$204       .dwtag  DW_TAG_member
    2658                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$20)
    2659                            .dwattr $C$DW$204, DW_AT_name("fattrib")
    2660                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("fattrib")
    2661                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2662                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2663                            .dwattr $C$DW$204, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2664                            .dwattr $C$DW$204, DW_AT_decl_line(0xa6)
    2665                            .dwattr $C$DW$204, DW_AT_decl_column(0x07)
    2666                    $C$DW$205       .dwtag  DW_TAG_member
    2667                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$32)
    2668                            .dwattr $C$DW$205, DW_AT_name("fname")
    2669                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("fname")
    2670                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2671                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2672                            .dwattr $C$DW$205, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2673                            .dwattr $C$DW$205, DW_AT_decl_line(0xa7)
    2674                            .dwattr $C$DW$205, DW_AT_decl_column(0x08)
    2675                            .dwendtag $C$DW$T$33
    2676                    
    2677                            .dwattr $C$DW$T$33, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2678                            .dwattr $C$DW$T$33, DW_AT_decl_line(0xa2)
    2679                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    2680                    $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("FILINFO")
    2681                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$33)
    2682                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    2683                            .dwattr $C$DW$T$47, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/ff.h")
    2684                            .dwattr $C$DW$T$47, DW_AT_decl_line(0xac)
    2685                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x03)
    2686                    
    2687                    $C$DW$T$35      .dwtag  DW_TAG_union_type
    2688                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x10)
    2689                    $C$DW$206       .dwtag  DW_TAG_member
    2690                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$34)
    2691                            .dwattr $C$DW$206, DW_AT_name("_Us")
    2692                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("_Us")
    2693                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2694                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2695                            .dwattr $C$DW$206, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2696                            .dwattr $C$DW$206, DW_AT_decl_line(0x3a)
    2697                            .dwattr $C$DW$206, DW_AT_decl_column(0x12)
    2698                    $C$DW$207       .dwtag  DW_TAG_member
    2699                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$16)
    2700                            .dwattr $C$DW$207, DW_AT_name("_Float")
    2701                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("_Float")
    2702                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2703                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2704                            .dwattr $C$DW$207, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2705                            .dwattr $C$DW$207, DW_AT_decl_line(0x3b)
    2706                            .dwattr $C$DW$207, DW_AT_decl_column(0x09)
    2707                    $C$DW$208       .dwtag  DW_TAG_member
    2708                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$17)
TI ARM Assembler PC v5.2.5 Sat Nov 07 12:29:27 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   51

    2709                            .dwattr $C$DW$208, DW_AT_name("_Double")
    2710                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("_Double")
    2711                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2712                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2713                            .dwattr $C$DW$208, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2714                            .dwattr $C$DW$208, DW_AT_decl_line(0x3c)
    2715                            .dwattr $C$DW$208, DW_AT_decl_column(0x0a)
    2716                    $C$DW$209       .dwtag  DW_TAG_member
    2717                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$18)
    2718                            .dwattr $C$DW$209, DW_AT_name("_Long_double")
    2719                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("_Long_double")
    2720                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2721                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2722                            .dwattr $C$DW$209, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float.
    2723                            .dwattr $C$DW$209, DW_AT_decl_line(0x3d)
    2724                            .dwattr $C$DW$209, DW_AT_decl_column(0x0f)
    2725                            .dwendtag $C$DW$T$35
    2726                    
    2727                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/float
    2728                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x39)
    2729                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x03)
    2730                    
    2731                    $C$DW$T$36      .dwtag  DW_TAG_union_type
    2732                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x10)
    2733                    $C$DW$210       .dwtag  DW_TAG_member
    2734                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$34)
    2735                            .dwattr $C$DW$210, DW_AT_name("_Word")
    2736                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("_Word")
    2737                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2738                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2739                            .dwattr $C$DW$210, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath.
    2740                            .dwattr $C$DW$210, DW_AT_decl_line(0x8f)
    2741                            .dwattr $C$DW$210, DW_AT_decl_column(0x11)
    2742                    $C$DW$211       .dwtag  DW_TAG_member
    2743                            .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$16)
    2744                            .dwattr $C$DW$211, DW_AT_name("_Float")
    2745                            .dwattr $C$DW$211, DW_AT_TI_symbol_name("_Float")
    2746                            .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2747                            .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2748                            .dwattr $C$DW$211, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath.
    2749                            .dwattr $C$DW$211, DW_AT_decl_line(0x90)
    2750                            .dwattr $C$DW$211, DW_AT_decl_column(0x08)
    2751                    $C$DW$212       .dwtag  DW_TAG_member
    2752                            .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$17)
    2753                            .dwattr $C$DW$212, DW_AT_name("_Double")
    2754                            .dwattr $C$DW$212, DW_AT_TI_symbol_name("_Double")
    2755                            .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2756                            .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2757                            .dwattr $C$DW$212, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath.
    2758                            .dwattr $C$DW$212, DW_AT_decl_line(0x91)
    2759                            .dwattr $C$DW$212, DW_AT_decl_column(0x09)
    2760                    $C$DW$213       .dwtag  DW_TAG_member
    2761                            .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$18)
    2762                            .dwattr $C$DW$213, DW_AT_name("_Long_double")
    2763                            .dwattr $C$DW$213, DW_AT_TI_symbol_name("_Long_double")
TI ARM Assembler PC v5.2.5 Sat Nov 07 12:29:27 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   52

    2764                            .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2765                            .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2766                            .dwattr $C$DW$213, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath.
    2767                            .dwattr $C$DW$213, DW_AT_decl_line(0x92)
    2768                            .dwattr $C$DW$213, DW_AT_decl_column(0x0e)
    2769                            .dwendtag $C$DW$T$36
    2770                    
    2771                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath
    2772                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x8e)
    2773                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x02)
    2774                    $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("_Dconst")
    2775                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$36)
    2776                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    2777                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath
    2778                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x93)
    2779                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x04)
    2780                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2781                            .dwattr $C$DW$T$2, DW_AT_name("void")
    2782                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2783                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2784                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2785                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    2786                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2787                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    2788                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2789                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    2790                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2791                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2792                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2793                    $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    2794                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$5)
    2795                            .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    2796                            .dwattr $C$DW$T$67, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2797                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x2a)
    2798                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x1d)
    2799                    $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
    2800                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    2801                            .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    2802                            .dwattr $C$DW$T$68, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2803                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x37)
    2804                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x17)
    2805                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    2806                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2807                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2808                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2809                    $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("BYTE")
    2810                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$6)
    2811                            .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    2812                            .dwattr $C$DW$T$20, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2813                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x16)
    2814                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x17)
    2815                    $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("DSTATUS")
    2816                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$20)
    2817                            .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    2818                            .dwattr $C$DW$T$69, DW_AT_decl_file("E:/Dev/Ti/TivaWare/third_party/fatfs/src/diskio.h")
TI ARM Assembler PC v5.2.5 Sat Nov 07 12:29:27 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   53

    2819                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x13)
    2820                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x0e)
    2821                    
    2822                    $C$DW$T$23      .dwtag  DW_TAG_array_type
    2823                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$20)
    2824                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    2825                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x200)
    2826                    $C$DW$214       .dwtag  DW_TAG_subrange_type
    2827                            .dwattr $C$DW$214, DW_AT_upper_bound(0x1ff)
    2828                            .dwendtag $C$DW$T$23
    2829                    
    2830                    $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    2831                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$20)
    2832                            .dwattr $C$DW$T$27, DW_AT_address_class(0x20)
    2833                    $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("UCHAR")
    2834                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$6)
    2835                            .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    2836                            .dwattr $C$DW$T$70, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2837                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x15)
    2838                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x17)
    2839                    $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    2840                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$6)
    2841                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    2842                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2843                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x2b)
    2844                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x1c)
    2845                    $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
    2846                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$50)
    2847                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    2848                            .dwattr $C$DW$T$73, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2849                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x38)
    2850                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x16)
    2851                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    2852                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2853                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2854                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    2855                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    2856                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2857                            .dwattr $C$DW$T$8, DW_AT_name("short")
    2858                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    2859                    $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("SHORT")
    2860                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$8)
    2861                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    2862                            .dwattr $C$DW$T$74, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2863                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x19)
    2864                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x11)
    2865                    $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
    2866                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$8)
    2867                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2868                            .dwattr $C$DW$T$75, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2869                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x2c)
    2870                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x1d)
    2871                    $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
    2872                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    2873                            .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v5.2.5 Sat Nov 07 12:29:27 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   54

    2874                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2875                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x3a)
    2876                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x17)
    2877                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    2878                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2879                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2880                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    2881                    $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("USHORT")
    2882                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$9)
    2883                            .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    2884                            .dwattr $C$DW$T$77, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2885                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x1a)
    2886                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x18)
    2887                    $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("WCHAR")
    2888                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$9)
    2889                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    2890                            .dwattr $C$DW$T$78, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2891                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x1c)
    2892                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x18)
    2893                    $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("WORD")
    2894                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$9)
    2895                            .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    2896                            .dwattr $C$DW$T$21, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2897                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x1b)
    2898                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x18)
    2899                    $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("_Wchart")
    2900                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$9)
    2901                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    2902                            .dwattr $C$DW$T$79, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yvals
    2903                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x1e5)
    2904                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x21)
    2905                    $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("_Wintt")
    2906                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$9)
    2907                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    2908                            .dwattr $C$DW$T$80, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yvals
    2909                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x1e6)
    2910                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x21)
    2911                    
    2912                    $C$DW$T$34      .dwtag  DW_TAG_array_type
    2913                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$9)
    2914                            .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    2915                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x10)
    2916                    $C$DW$215       .dwtag  DW_TAG_subrange_type
    2917                            .dwattr $C$DW$215, DW_AT_upper_bound(0x07)
    2918                            .dwendtag $C$DW$T$34
    2919                    
    2920                    $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    2921                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$9)
    2922                            .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    2923                            .dwattr $C$DW$T$81, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2924                            .dwattr $C$DW$T$81, DW_AT_decl_line(0x2d)
    2925                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x1c)
    2926                    $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
    2927                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    2928                            .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v5.2.5 Sat Nov 07 12:29:27 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   55

    2929                            .dwattr $C$DW$T$82, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2930                            .dwattr $C$DW$T$82, DW_AT_decl_line(0x3b)
    2931                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x16)
    2932                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    2933                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2934                            .dwattr $C$DW$T$10, DW_AT_name("int")
    2935                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    2936                    $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("INT")
    2937                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$10)
    2938                            .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    2939                            .dwattr $C$DW$T$83, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2940                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x10)
    2941                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x10)
    2942                    $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("_Ptrdifft")
    2943                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$10)
    2944                            .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    2945                            .dwattr $C$DW$T$84, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yvals
    2946                            .dwattr $C$DW$T$84, DW_AT_decl_line(0xa9)
    2947                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x1e)
    2948                    $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
    2949                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$10)
    2950                            .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    2951                            .dwattr $C$DW$T$86, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2952                            .dwattr $C$DW$T$86, DW_AT_decl_line(0x2e)
    2953                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x1d)
    2954                    $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast16_t")
    2955                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    2956                            .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    2957                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2958                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x47)
    2959                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x17)
    2960                    $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast32_t")
    2961                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$86)
    2962                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    2963                            .dwattr $C$DW$T$88, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2964                            .dwattr $C$DW$T$88, DW_AT_decl_line(0x4a)
    2965                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x17)
    2966                    $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast8_t")
    2967                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$86)
    2968                            .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    2969                            .dwattr $C$DW$T$89, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2970                            .dwattr $C$DW$T$89, DW_AT_decl_line(0x45)
    2971                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x17)
    2972                    $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("int_least32_t")
    2973                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$86)
    2974                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    2975                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2976                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x3c)
    2977                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x17)
    2978                    $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("intptr_t")
    2979                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$10)
    2980                            .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    2981                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    2982                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x52)
    2983                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x1a)
TI ARM Assembler PC v5.2.5 Sat Nov 07 12:29:27 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   56

    2984                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    2985                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2986                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    2987                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    2988                    $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("UINT")
    2989                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$11)
    2990                            .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    2991                            .dwattr $C$DW$T$92, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    2992                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x11)
    2993                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x16)
    2994                    $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("_Sizet")
    2995                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$11)
    2996                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    2997                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yvals
    2998                            .dwattr $C$DW$T$93, DW_AT_decl_line(0xab)
    2999                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x1a)
    3000                    $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("_TI_uint32_t")
    3001                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$11)
    3002                            .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    3003                            .dwattr $C$DW$T$94, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymath
    3004                            .dwattr $C$DW$T$94, DW_AT_decl_line(0xb6)
    3005                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x19)
    3006                    $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
    3007                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$11)
    3008                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    3009                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdin
    3010                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x2f)
    3011                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x1c)
    3012                    $C$DW$T$100     .dwtag  DW_TAG_volatile_type
    3013                            .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$49)
    3014                    $C$DW$T$101     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast16_t")
    3015                            .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$49)
    3016                            .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    3017                            .dwattr $C$DW$T$101, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3018                            .dwattr $C$DW$T$101, DW_AT_decl_line(0x48)
    3019                            .dwattr $C$DW$T$101, DW_AT_decl_column(0x16)
    3020                    $C$DW$T$102     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast32_t")
    3021                            .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$49)
    3022                            .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    3023                            .dwattr $C$DW$T$102, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3024                            .dwattr $C$DW$T$102, DW_AT_decl_line(0x4b)
    3025                            .dwattr $C$DW$T$102, DW_AT_decl_column(0x16)
    3026                    $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast8_t")
    3027                            .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$49)
    3028                            .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    3029                            .dwattr $C$DW$T$103, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3030                            .dwattr $C$DW$T$103, DW_AT_decl_line(0x46)
    3031                            .dwattr $C$DW$T$103, DW_AT_decl_column(0x16)
    3032                    $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least32_t")
    3033                            .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$49)
    3034                            .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    3035                            .dwattr $C$DW$T$104, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3036                            .dwattr $C$DW$T$104, DW_AT_decl_line(0x3d)
    3037                            .dwattr $C$DW$T$104, DW_AT_decl_column(0x16)
    3038                    $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("uintptr_t")
TI ARM Assembler PC v5.2.5 Sat Nov 07 12:29:27 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   57

    3039                            .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$11)
    3040                            .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    3041                            .dwattr $C$DW$T$105, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3042                            .dwattr $C$DW$T$105, DW_AT_decl_line(0x53)
    3043                            .dwattr $C$DW$T$105, DW_AT_decl_column(0x1a)
    3044                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    3045                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    3046                            .dwattr $C$DW$T$12, DW_AT_name("long")
    3047                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    3048                    $C$DW$T$106     .dwtag  DW_TAG_typedef, DW_AT_name("LONG")
    3049                            .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$12)
    3050                            .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    3051                            .dwattr $C$DW$T$106, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    3052                            .dwattr $C$DW$T$106, DW_AT_decl_line(0x1f)
    3053                            .dwattr $C$DW$T$106, DW_AT_decl_column(0x10)
    3054                    $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("_Int32t")
    3055                            .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$12)
    3056                            .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    3057                            .dwattr $C$DW$T$107, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yval
    3058                            .dwattr $C$DW$T$107, DW_AT_decl_line(0xa6)
    3059                            .dwattr $C$DW$T$107, DW_AT_decl_column(0x0e)
    3060                    $C$DW$T$13      .dwtag  DW_TAG_base_type
    3061                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    3062                            .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    3063                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
    3064                    $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("DWORD")
    3065                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$13)
    3066                            .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    3067                            .dwattr $C$DW$T$22, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    3068                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x21)
    3069                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x17)
    3070                    $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("ULONG")
    3071                            .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$13)
    3072                            .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
    3073                            .dwattr $C$DW$T$108, DW_AT_decl_file("E:\Dev\Ti\TivaWare\third_party\fatfs\src\integer.h")
    3074                            .dwattr $C$DW$T$108, DW_AT_decl_line(0x20)
    3075                            .dwattr $C$DW$T$108, DW_AT_decl_column(0x17)
    3076                    $C$DW$T$109     .dwtag  DW_TAG_typedef, DW_AT_name("_Uint32t")
    3077                            .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$13)
    3078                            .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    3079                            .dwattr $C$DW$T$109, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yval
    3080                            .dwattr $C$DW$T$109, DW_AT_decl_line(0xa7)
    3081                            .dwattr $C$DW$T$109, DW_AT_decl_column(0x17)
    3082                    $C$DW$T$14      .dwtag  DW_TAG_base_type
    3083                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    3084                            .dwattr $C$DW$T$14, DW_AT_name("long long")
    3085                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    3086                    $C$DW$T$110     .dwtag  DW_TAG_typedef, DW_AT_name("_Longlong")
    3087                            .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$14)
    3088                            .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    3089                            .dwattr $C$DW$T$110, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yval
    3090                            .dwattr $C$DW$T$110, DW_AT_decl_line(0x1b5)
    3091                            .dwattr $C$DW$T$110, DW_AT_decl_column(0x13)
    3092                    $C$DW$T$111     .dwtag  DW_TAG_typedef, DW_AT_name("int64_t")
    3093                            .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$14)
TI ARM Assembler PC v5.2.5 Sat Nov 07 12:29:27 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   58

    3094                            .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
    3095                            .dwattr $C$DW$T$111, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3096                            .dwattr $C$DW$T$111, DW_AT_decl_line(0x32)
    3097                            .dwattr $C$DW$T$111, DW_AT_decl_column(0x21)
    3098                    $C$DW$T$112     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast64_t")
    3099                            .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$111)
    3100                            .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    3101                            .dwattr $C$DW$T$112, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3102                            .dwattr $C$DW$T$112, DW_AT_decl_line(0x4e)
    3103                            .dwattr $C$DW$T$112, DW_AT_decl_column(0x17)
    3104                    $C$DW$T$113     .dwtag  DW_TAG_typedef, DW_AT_name("int_least64_t")
    3105                            .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$111)
    3106                            .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    3107                            .dwattr $C$DW$T$113, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3108                            .dwattr $C$DW$T$113, DW_AT_decl_line(0x40)
    3109                            .dwattr $C$DW$T$113, DW_AT_decl_column(0x17)
    3110                    $C$DW$T$114     .dwtag  DW_TAG_typedef, DW_AT_name("intmax_t")
    3111                            .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$14)
    3112                            .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    3113                            .dwattr $C$DW$T$114, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3114                            .dwattr $C$DW$T$114, DW_AT_decl_line(0x56)
    3115                            .dwattr $C$DW$T$114, DW_AT_decl_column(0x20)
    3116                    $C$DW$T$15      .dwtag  DW_TAG_base_type
    3117                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    3118                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    3119                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    3120                    $C$DW$T$115     .dwtag  DW_TAG_typedef, DW_AT_name("_TI_uint64_t")
    3121                            .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$15)
    3122                            .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
    3123                            .dwattr $C$DW$T$115, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/ymat
    3124                            .dwattr $C$DW$T$115, DW_AT_decl_line(0xbc)
    3125                            .dwattr $C$DW$T$115, DW_AT_decl_column(0x1c)
    3126                    $C$DW$T$116     .dwtag  DW_TAG_typedef, DW_AT_name("_ULonglong")
    3127                            .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$15)
    3128                            .dwattr $C$DW$T$116, DW_AT_language(DW_LANG_C)
    3129                            .dwattr $C$DW$T$116, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/yval
    3130                            .dwattr $C$DW$T$116, DW_AT_decl_line(0x1b6)
    3131                            .dwattr $C$DW$T$116, DW_AT_decl_column(0x14)
    3132                    $C$DW$T$117     .dwtag  DW_TAG_typedef, DW_AT_name("uint64_t")
    3133                            .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$15)
    3134                            .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
    3135                            .dwattr $C$DW$T$117, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3136                            .dwattr $C$DW$T$117, DW_AT_decl_line(0x33)
    3137                            .dwattr $C$DW$T$117, DW_AT_decl_column(0x20)
    3138                    $C$DW$T$118     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast64_t")
    3139                            .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$117)
    3140                            .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
    3141                            .dwattr $C$DW$T$118, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3142                            .dwattr $C$DW$T$118, DW_AT_decl_line(0x4f)
    3143                            .dwattr $C$DW$T$118, DW_AT_decl_column(0x16)
    3144                    $C$DW$T$119     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least64_t")
    3145                            .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$117)
    3146                            .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    3147                            .dwattr $C$DW$T$119, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3148                            .dwattr $C$DW$T$119, DW_AT_decl_line(0x41)
TI ARM Assembler PC v5.2.5 Sat Nov 07 12:29:27 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
timers.asm                                                           PAGE   59

    3149                            .dwattr $C$DW$T$119, DW_AT_decl_column(0x16)
    3150                    $C$DW$T$120     .dwtag  DW_TAG_typedef, DW_AT_name("uintmax_t")
    3151                            .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$15)
    3152                            .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    3153                            .dwattr $C$DW$T$120, DW_AT_decl_file("C:/ti/ccsv6/tools/compiler/ti-cgt-arm_5.2.5/include/stdi
    3154                            .dwattr $C$DW$T$120, DW_AT_decl_line(0x57)
    3155                            .dwattr $C$DW$T$120, DW_AT_decl_column(0x20)
    3156                    $C$DW$T$16      .dwtag  DW_TAG_base_type
    3157                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    3158                            .dwattr $C$DW$T$16, DW_AT_name("float")
    3159                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
